[{"label": 0, "content": "Asteroid Apophisone of the scariest rocks in the solar systemwont pose a threat to Earth for at least another century, according to updated NASA calculations.\r\nEvery 80,000 years or so, an object mea… [+4637 chars]"}, {"label": 0, "content": "In a new first for genetic engineering, scientists have developed a single-celled synthetic organism that grows and divides much like a normal cell, mimicking aspects of the cell division cycle that … [+3133 chars]"}, {"label": 0, "content": "At the heart of almost every large galaxy lies an object of immense proportions a supermassive black hole. Up to billions of times more massive than our sun, these titans drive the evolution of the g… [+2986 chars]"}, {"label": 0, "content": "The scientists that revealed the very first photograph of a black hole have added polarized light to the image, offering a more detailed look at its magnetic fields.According to New Scientist, the gr… [+3119 chars]"}, {"label": 0, "content": "NASA is taking more steps to support new commercial space stations in low Earth orbit (LEO).\r\nNASA held an online industry briefing about\"commercial LEO destinations\" Tuesday (March 23) to solicit fe… [+7263 chars]"}, {"label": 0, "content": "A protoplanet slammed into the Earth about 4.5 billion years ago, knocking loose a chunk of rock that would later become the moon\r\n. Now, scientists say that remnants of that protoplanet can still be… [+2962 chars]"}, {"label": 0, "content": "A cute species of peacock spider has been named after Nemo, the beloved clownfish in Pixar's Finding Nemo franchise. \r\nMaratus nemo, which is only about the size of a grain of rice at just over 4mm i… [+6823 chars]"}, {"label": 0, "content": "The center of the Milky Way is mysteriously glowing.\r\nSure, there's a whole bunch of stars there, along with a black hole 4 million times the mass of the Sun - but subtract the light from all that, a… [+5155 chars]"}, {"label": 1, "content": "The woes that arose from Archegos Capital Management at the end of last week bled into Monday as a slew of big banks saw their share prices decline.\r\nHere's how the $20 billion blowup unfolded.\r\nU.S.… [+3566 chars]"}, {"label": 1, "content": "Sony has confirmed today that the PSN digital stores on PlayStation 3 and PSP will be closing on July 2. The PS Vita store will also shut down on August 27. Players will still be able to download gam… [+1617 chars]"}, {"label": 1, "content": "If you thought the pandemic was over in the US, think again. After almost three months of steady decline, the number of daily new cases of COVID-19 across the nation is rising. In several states, led… [+6520 chars]"}, {"label": 1, "content": "Mr. Cuomos announcement comes as New York has been adding new virus cases at one of the highest rates among U.S. states. As of Monday, the state was a seven-day average of 49 new virus cases a day fo… [+1269 chars]"}, {"label": 1, "content": "Former heavyweight champion Stipe Miocic has released his first statement after suffering a second-round knockout loss to Francis Ngannou at UFC 260 this past weekend.\r\nThe Ohio native wasnt able to … [+2987 chars]"}, {"label": 1, "content": "A federal ban on evictions is putting the squeeze on smaller landlords, who are unable to directly access Covid rental relief funds, and some are starting to sell properties to recoup losses.\r\nThis w… [+5351 chars]"}, {"label": 1, "content": "WASHINGTON The director of the Centers for Disease Control and Prevention, Rochelle Walensky, warned Monday of \"impending doom\" as the U.S. sees a steady rise in Covid-19 cases and gave an emotional … [+2413 chars]"}, {"label": 1, "content": "Suez, Egypt — The colossal container ship that spent almost a week wedged across the Suez Canal was \"successfully refloated\" and on the move again on Monday, according to Egypt's canal authority and … [+4949 chars]"}, {"label": 1, "content": "Senate Majority Leader Chuck Schumer, D-N.Y., is exploring how to pass President Biden's third economic spending bill later this year without any Republican votes via an obscure Senate rule that woul… [+5237 chars]"}, {"label": 1, "content": "Asteroid Apophisone of the scariest rocks in the solar systemwont pose a threat to Earth for at least another century, according to updated NASA calculations.\r\nEvery 80,000 years or so, an object mea… [+4637 chars]"}, {"label": 1, "content": "Public health experts are encouraging everyone to get vaccinated and fast to reduce the number of hospitalizations and coronavirus-related deaths.\r\nAll the coronavirus vaccines are free, paid for by … [+10899 chars]"}, {"label": 1, "content": "People in England are now allowed to meet outdoors in groups of up to six or two households (with social distancing), as the first of the country's coronavirus measures were eased Monday. \r\nThe count… [+1761 chars]"}, {"label": 1, "content": "Godzilla vs Kong, the marquee monster rematch of the decade, is almost here to deliver the big battle we've been waiting for. And you'll be able to watch it on HBO Max, too. The movie is already brea… [+5802 chars]"}, {"label": 1, "content": "With Jimmy Garoppolo‘s days numbered in San Francisco, speculation regarding his eventual future has centered on the Patriots. Former NFL tight end (who played at one point for the Patriots) Jermaine… [+1015 chars]"}, {"label": 1, "content": "George Floyd's attorneys and family spoke on March 29 in Minneapolis ahead of the start of the murder trial of former police officer Derek Chauvin. (Court TV)\r\nFloyds family members gathered outside … [+1861 chars]"}, {"label": 1, "content": "Both couples revealed their budding romances within the last year, with Kardashian and Barker dropping the bomb on fans via Instagram in February while Fox and Kelly shared their news on the same pla… [+374 chars]"}, {"label": 1, "content": "Cyberpunk 2077's 1.2 patch notes are huge, with literally hundreds of changes listed, which means the little details can easily get lost. One of the smaller changes did catch our eye, however the gam… [+2151 chars]"}, {"label": 1, "content": "In a new first for genetic engineering, scientists have developed a single-celled synthetic organism that grows and divides much like a normal cell, mimicking aspects of the cell division cycle that … [+3133 chars]"}, {"label": 1, "content": "AmazonThe Amazon News Twitter account and executive Dave Clark have been lashing out at critics online just as Alabama workers vote on unionization \r\nMon 29 Mar 2021 16.03 BST\r\nSay what you will abou… [+4069 chars]"}, {"label": 1, "content": "DES MOINES, Iowa —Iowas COVID-19 positivity rates continue to climb after months of declines. \r\nThe Iowa Department of Public Health reported 110 new positive virus tests and seven additional deaths … [+1163 chars]"}, {"label": 1, "content": "An Amish community in Pennsylvania may have become the first group in the U.S. to achieve herd immunity, a local health official claims.\r\nThe administrator of a medical center in the heart of Lancast… [+3162 chars]"}, {"label": 1, "content": "SportsPulse: Scott Gleeson picked Virginia to win it all in 2019. He called Loyola-Chicago as a Cinderella in 2018. Now he's ready to give you his guarantees for Monday's Elite Eight action.\r\nUSA TOD… [+2596 chars]"}, {"label": 1, "content": "YANGON, Burma A series of airstrikes by Burma's military along the country's border raised concerns Monday that more villagers might flee to neighboring Thailand in large numbers, adding a new dimens… [+6683 chars]"}, {"label": 1, "content": "Lil Nas X is sparring with critics of his latest song and the subsequent shoe line that accompanied it, including South Dakota Governor Kristi Noem. \r\nThe rapper released his controversial new song \"… [+3311 chars]"}, {"label": 1, "content": "The Mi 11 Ultra should be a serious camera upgrade\r\nXiaomi has announced its latest flagship, the Mi 11 Ultra. Its based on the excellent new Mi 11, but has a more advanced camera system including a … [+1917 chars]"}, {"label": 1, "content": "BERLIN (AP) German Chancellor Angela Merkel has blamed her countrys difficulties during the coronavirus pandemic from the slow vaccine rollout to the back-and-forth over lockdown rules partly on a te… [+4464 chars]"}, {"label": 1, "content": "The Sea Star 1, owned by the Tanzanian Zan Ferries, docked on Monday at the port in Pemba, Mozambique. The vessel has been used to evacuate around 1,400 people, mostly foreign gas workers, from fight… [+3664 chars]"}, {"label": 1, "content": "As coronavirus cases rise once again in the United States, the country is also administering vaccinations at a faster pace than ever.\r\nU.S. Covid-19 cases\r\nMore than 63,000 daily new Covid-19 cases a… [+1622 chars]"}, {"label": 1, "content": "Woody Allen has spoken out about the allegations against him as well as his relationship with wife Soon-Yi Previn in a newly released interview. \r\nThe embattled filmmaker, 85, spoke with \"CBS Sunday … [+4185 chars]"}, {"label": 1, "content": "By introducing its own M1 chips to its latest range of Macs, Apple finally brought the cohesive experience of its iPhone and iPads to its laptops and desktops. As we noted in our reviews, the improve… [+1650 chars]"}, {"label": 1, "content": "Sam Darnold‘s short tenure as a starting quarterback in New York seems to be coming to an end, as all signs are pointing toward the Jets selecting Zach Wilson with the second overall pick of the 2021… [+10262 chars]"}, {"label": 1, "content": "When we said there were millions of tests available, there werent, right? said Brett Giroir, who served as the nations coronavirus testing czar, referencing the administrations repeated claims in Mar… [+10207 chars]"}, {"label": 1, "content": "If you think the practice of value investing has been made redundant by the emergence of high-growing tech stocks, you are mistaken. Amidst an overvalued stock market and near-zero interest rates, yi… [+4552 chars]"}, {"label": 1, "content": "AUSTIN (KXAN) Texas opened registration for the COVID-19 vaccine to people aged 16 years or older Monday, and with the move, the state launched a website to help people sign up to get it.\r\nThe Texas … [+1585 chars]"}, {"label": 1, "content": "There is very little set in stone for a recall election in which voters could remove Gov. Gavin Newsom from office beyond the ballots basic question of whether the governor should keep his job.\r\nReca… [+7214 chars]"}, {"label": 1, "content": "A protoplanet slammed into the Earth about 4.5 billion years ago, knocking loose a chunk of rock that would later become the moon\r\n. Now, scientists say that remnants of that protoplanet can still be… [+2962 chars]"}, {"label": 1, "content": "A contracted helicopter carrying guides and guests from a lodge on a heli-skiing trip in Southcentral Alaskas backcountry crashed Saturday evening, killing the pilot and four others, including the Cz… [+4240 chars]"}, {"label": 2, "content": "The Pfizer and Moderna Covid-19 vaccines are extremely effective in the real world, reducing infections by 90 percent in fully vaccinated people, the Centers for Disease Control and Prevention report… [+2982 chars]"}, {"label": 2, "content": "OSCEOLA COUNTY, Fla. —On Monday, the state of Florida dropped the age requirement for COVID-19 vaccines to 40. \r\nWhat were asking individuals to do who are interested in getting vaccinated at our loc… [+1498 chars]"}, {"label": 2, "content": "MichiganLaw passed by Republicans in control of state legislature prompts Democrats to accuse them of politicizing public health effort\r\nResidents of Michigan receiving the Johnson &amp; Johnson Covi… [+3652 chars]"}, {"label": 2, "content": "Dietary supplements are used by millions for their purported health benefits, constituting a nearly $37 billion industry in the U.S. as of 2021. But one popular daily pill could be creating serious p… [+3503 chars]"}, {"label": 2, "content": "People in England are now allowed to meet outdoors in groups of up to six or two households (with social distancing), as the first of the country's coronavirus measures were eased Monday. \r\nThe count… [+1761 chars]"}, {"label": 2, "content": "DES MOINES, Iowa —Iowas COVID-19 positivity rates continue to climb after months of declines. \r\nThe Iowa Department of Public Health reported 110 new positive virus tests and seven additional deaths … [+1163 chars]"}, {"label": 2, "content": "Two counties in the Hudson Valley have the highest COVID-19 positivity rate in New York State, according to the most recent data from the Department of Health. \r\nIn Orange County, the 6.7 percent pos… [+3443 chars]"}, {"label": 2, "content": "An Amish community in Pennsylvania may have become the first group in the U.S. to achieve herd immunity, a local health official claims.\r\nThe administrator of a medical center in the heart of Lancast… [+3162 chars]"}, {"label": 2, "content": "Some immunocompromised people are wondering whether or when to get the COVID-19 vaccine.\r\nSarahbeth Maney/San Francisco Chronicle via Getty Images\r\nLots of people have questions about getting vaccina… [+8200 chars]"}, {"label": 2, "content": "WINSTON-SALEM, N.C. —The North Carolina Department of Health and Human Services has an online tool to help North Carolinians know when they will be eligible to get their vaccine. \r\nThe Find My Vaccin… [+10469 chars]"}, {"label": 2, "content": "Michigan now has 13 of its 83 counties with a positivity rate over 15% as a seven-day average on coronavirus diagnostic tests.\r\nThose counties include Macomb, Genesee, Lapeer and St. Clair.\r\n6 reason… [+6645 chars]"}, {"label": 2, "content": "Ten states are set to open vaccine eligibility to all adults this week, about a month before President BidenJoe BidenThe Hill's Morning Report - Biden to talk infrastructure amid border, voting contr… [+1337 chars]"}, {"label": 2, "content": "People with severe gum disease are twice as likely to have high blood pressure, according to a new study.\r\nA study of 250 people with periodontitis severe gum disease found people with the condition … [+4627 chars]"}, {"label": 2, "content": "SAN FRANCISCO (KGO) -- The COVID-19 pandemic is having a major impact across the world and also in cities across Northern California. The latest number of confirmed cases in the U.S. can be found at … [+19355 chars]"}, {"label": 2, "content": "Alexander Gintsburg, the director of Moscow’s Gamaleya Institute – which developed the pioneering formula – claimed in an interview with Moscow outlet Izvestiya, published on Monday, that the virus c… [+2409 chars]"}, {"label": 2, "content": "Students and educators from schools across the nation discuss how they have maintained relationships this past year amidst the coronavirus pandemic.\r\nUSA TODAY\r\nTen states will open eligibility for c… [+4730 chars]"}, {"label": 2, "content": "A woman ended up in hospital with third degree burns after she and her partner attempted to spice up their sex life by melting down a giant gummy bear.\r\nThe problem being, gummy bears are made entire… [+1964 chars]"}, {"label": 2, "content": "More than 540.9 million vaccine doses have been administered worldwide, equal to 7.0 doses for every 100 people. There is already a stark gap between vaccination programs in different countries, with… [+2322 chars]"}, {"label": 2, "content": "To date, the U.S. Centers for Disease Control and Prevention has awarded five variants this dubious distinction: B.1.1.7 (or the British variant), P.1 (Brazilian), B.1.351 (South African) and B.1.427… [+1091 chars]"}, {"label": 2, "content": "DURHAM, N.C. (AP) The 9-year-old twins didn't flinch as each received test doses of Pfizer's COVID-19 vaccine and then a sparkly bandage to cover the spot.\r\n\"Sparkles make everything better,\" declare… [+4925 chars]"}, {"label": 3, "content": "The woes that arose from Archegos Capital Management at the end of last week bled into Monday as a slew of big banks saw their share prices decline.\r\nHere's how the $20 billion blowup unfolded.\r\nU.S.… [+3566 chars]"}, {"label": 3, "content": "Volkswagen accidentally posted a press release on its website a month early on Monday announcing a new name for its U.S. operations, Voltswagen of America, emphasizing the German automaker's electric… [+2169 chars]"}, {"label": 3, "content": "During a panel discussion hosted by the Chicago Board Options Exchange (CBOE) last week, CEO of investment management firm Ark Investment Management Cathie Wood shared some decidedly bullish sentimen… [+1257 chars]"}, {"label": 3, "content": "By David Shepardson\r\nWASHINGTON (Reuters) - Thirteen U.S. House Democratic lawmakers on Monday urged the U.S. Postal Service's governing board to halt implementation of a contract that could be worth… [+1733 chars]"}, {"label": 3, "content": "Married? You may want to think about how claiming Social Security early would affect your spousal benefits.\r\nFor starters, not all early filers can access those benefits right away. And for those who… [+4454 chars]"}, {"label": 3, "content": "We are ready to rock-and-roll, national climate adviser Gina McCarthy told reporters in a phone call Monday. She framed the effort as being as much about jobs as about clean energy. Offshore wind pow… [+4084 chars]"}, {"label": 3, "content": "NEW YORK (AP) The U.S government's first look at the real-world use of COVID-19 vaccines found their effectiveness was nearly as robust as it was in controlled studies.\r\nThe two vaccines available si… [+3619 chars]"}, {"label": 3, "content": "The latest 13F reporting period has come and gone, and Insider Monkey is again at the forefront when it comes to making use of this gold mine of data. Insider Monkey finished processing 887 13F filin… [+6486 chars]"}, {"label": 3, "content": "Drew Lehman of Lansdale, Pa., became unable to work after a traumatic car accident. He is currently navigating the confusing, bureaucratic process of getting his federal student loans discharged.\r\n/N… [+7846 chars]"}, {"label": 3, "content": "The Federal Reserve is not keeping monetary policy easy to enable the government to rung up debts and deficits, Fed Governor Christopher Waller said Monday.\r\nDefending the Fed's independence from the… [+2094 chars]"}, {"label": 3, "content": "MADRID With the number of new COVID-19 cases in Spain creeping higher, officials are urging people to prevent the pandemic from surging out of control by complying with restrictions on movements and … [+12568 chars]"}, {"label": 3, "content": "Tesla has secured a new order for 10 Tesla electric semi-trucks and 2 Megachargers with almost $2 million in US government support.\r\nSince unveiling the Tesla Semi in 2017, Tesla has been taking rese… [+2322 chars]"}, {"label": 3, "content": "Two more Bay Area counties are expected to advance from the red tier to the more lenient orange tier in the state's reopening plan, paving the way for more reopenings.Alameda and Napa are on track to… [+3082 chars]"}, {"label": 3, "content": "Stretch unloads a Spot robot dog in a Boston Dynamics video showing prototypes of the box-moving machines.\r\nBoston Dynamics video screenshot by Amanda Kooser/CNET\r\nBoston Dynamics is known for Spot, … [+1422 chars]"}, {"label": 3, "content": "(WSYR-TV) — New York State is the first in the U.S. to formally launch an app, using technology to fast track the reopening of businesses and event venues. The New York Excelsior Pass provides a free… [+3006 chars]"}, {"label": 3, "content": "JACKSONVILLE, Fla. Floridas age eligibility requirement for getting the COVID-19 vaccine drops to 40 and older on Monday, making it available to another 2.5 million Floridians.\r\nThe age requirement d… [+2739 chars]"}, {"label": 3, "content": "A worker stacks boxes inside of an Amazon fulfillment center in Robbinsville, New Jersey.\r\nThe next big industrial warehouse might find itself on top of a former golf course. Or in an empty office bu… [+6054 chars]"}, {"label": 3, "content": "AmazonThe Amazon News Twitter account and executive Dave Clark have been lashing out at critics online just as Alabama workers vote on unionization \r\nMon 29 Mar 2021 16.03 BST\r\nSay what you will abou… [+4069 chars]"}, {"label": 3, "content": "Oliver Zak and Selom Agbitor started Mad Rabbit Tattoo, a company that sells tattoo aftercare products, as a side hustle while attending Miami University in 2019. Now, that side hustle has landed the… [+2585 chars]"}, {"label": 3, "content": "Early on Monday morning, March 22, during the Bank of International Settlement’s Innovation Summit, Federal Reserve chair Jerome Powell had this to say about bitcoin or, in his words, “crypto assets”… [+7348 chars]"}, {"label": 3, "content": "Editor's note: SpaceX has not released webcast details for today's Starship SN11 test flight. Above is a livestream of Starship SN11 testing from NASASpacefight.com, which you can watch directly on Y… [+2977 chars]"}, {"label": 3, "content": "DAVIE, Fla. Stop what youre doing and check your tickets.\r\nA $28 million Florida Lotto ticket was sold in Davie, and state lottery officials are still waiting for the jackpot winner to come forward.\r… [+1008 chars]"}, {"label": 3, "content": "American depositary receipts of Chinese electric-vehicle makers NIO, Li Auto, and XPeng are under more pressure after an editorial in a Chinese news outlet called out some problems with the local EV … [+261 chars]"}, {"label": 3, "content": "A new supersonic commercial airliner was announced on Monday, one that its designer and manufacturer says will reach speeds of Mach 4-plus. Aerion said the AS3 will make its first flight before the e… [+2359 chars]"}, {"label": 3, "content": "If youve paid attention when you pull up to the pumps, you know that gas prices have been on the rise as of late. But why?\r\nMoney expert Clark Howard says there are three reasons why youre paying mor… [+3043 chars]"}, {"label": 3, "content": "That's a lot of screen.\r\nMercedes-Benz\r\nHere's the Mercedes-Benz EQS' ginormous Hyperscreen in all its glory. This weekend, the German luxury brand decided to show off the interior in full before the… [+2692 chars]"}, {"label": 3, "content": "U.S. equity markets were mixed Monday as banks were left licking their wounds after a large hedge fund was forced to unwind billions of dollars in positions.\r\n<table><tr><th>Ticker</th><th>Security</… [+4174 chars]"}, {"label": 3, "content": "U.S. stocks opened lower Monday, dogged by concerns about the ripple effects from forced selling Friday by a large investment firm. The Dow Jones Industrial Average \r\n DJIA,\r\n +0.16%\r\nlost 139 points… [+499 chars]"}, {"label": 3, "content": "Investment banking firm Oppenheimer &amp; Co expects blockchain technology to eventually upend many legacy industries including banking, law, healthcare and supply chains.\r\nIn the firm's most recent … [+5265 chars]"}, {"label": 3, "content": "Global demand for books print and digital has never been higher than it is now, Brian Murray, the president and chief executive of HarperCollins Publishers, said in a statement. We expect faster grow… [+1885 chars]"}, {"label": 3, "content": "Based on data compiled by Credible Operations, Inc., NMLS Number 1681276, current mortgage refinance rates have risen compared to last Friday’s. Rates for 30-year refinance have hit 3.250% again, whi… [+4671 chars]"}, {"label": 3, "content": "Gold futures posted their lowest settlement in three weeks on Monday, pressured by strength in the U.S. dollar and Treasury yields.The U.S. dollar edged up by 0.2% to 92.91, as measured by the ICE U.… [+3062 chars]"}, {"label": 3, "content": "\"We have African Americans today who have a lot less wealth in part because they have not been able to inherent the wealth that would have accrued had their ancestors been able to accrue that wealth.… [+38 chars]"}, {"label": 3, "content": "If you think the practice of value investing has been made redundant by the emergence of high-growing tech stocks, you are mistaken. Amidst an overvalued stock market and near-zero interest rates, yi… [+4552 chars]"}, {"label": 3, "content": "A major construction team on the California bullet train project notified the state rail authority this month that it will not complete a 65-mile section of the future route in Kings County until at … [+6841 chars]"}, {"label": 3, "content": "Scientists view Florida the state furthest along in lifting restrictions, reopening society and welcoming tourists as a bellwether for the nation.\r\nIf recent trends there are any indication, the rest… [+801 chars]"}, {"label": 3, "content": "image copyright Science Photo Library\r\nFacebook and Google are planning two new undersea internet cables to connect South East Asia to North America.\r\nThe project with regional telecoms companies aim… [+2283 chars]"}, {"label": 3, "content": "The reactions have been different from the callouts pursued by the Instagram watchdog Diet Prada they are broader and more personal.\r\nEach time, Mr. Clemens and Mr. Radboy have stayed quiet, in part … [+979 chars]"}, {"label": 3, "content": "Hand sanitizers have become trusted tools to keep people safe and healthy in the fight against the COVID-19 pandemic — but now, an independent study suggests some products may be having the opposite … [+3052 chars]"}, {"label": 3, "content": "Establishing an intelligent clinical development program pathway from the start is vital for clarity around the complex processes required to achieve product registration.\r\nThe Drug Development Plan … [+536 chars]"}, {"label": 3, "content": "Chicago Tribune\r\nRobservations on the media beat:\r\nCould an 85-year-old billionaire environmentalist from Wyoming turn out to be the savior of the Chicago Tribune?Hansjörg Wyss, Swiss-born former chi… [+2913 chars]"}, {"label": 3, "content": "Enlarge/ Look ma, I'm on the blockchain\r\n136 with 94 posters participating, including story author\r\nIt has been nearly 10 years now since Ars Technica first described Bitcoin to readers as the worlds… [+11902 chars]"}, {"label": 3, "content": "BURLINGAME, Calif.--(BUSINESS WIRE)--Humanigen, Inc. (Nasdaq: HGEN) (Humanigen), a clinical-stage biopharmaceutical company focused on preventing and treating an immune hyper-response called cytokine… [+10137 chars]"}, {"label": 3, "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncomme… [+32 chars]"}, {"label": 3, "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+2825 chars]"}, {"label": 3, "content": "LONDON Food delivery start-up Deliveroo has changed the target value for its initial public offering on the London Stock Exchange, after some some investors expressed concerns over workers' rights an… [+2887 chars]"}, {"label": 3, "content": "I can imagine that for someone like Mark Zuckerberg, having to jump on a video meeting with members of Congress to answer questions about how your platform is sowing misinformation is quite an inconv… [+3819 chars]"}, {"label": 3, "content": "Cazoo founder and CEO Alex Chesterman.\r\nLONDON Cazoo announced Monday that it will go public through a merger with billionaire investor Daniel Och's special purpose acquisition company.\r\nCazoo, found… [+2793 chars]"}, {"label": 3, "content": "Visa Inc. headquarters in Foster City, California\r\n© 2020 Bloomberg Finance LP\r\nVisa is piloting transaction settlement in stablecoins on the Ethereum blockchain. \r\nThe credit card provider that move… [+3116 chars]"}, {"label": 3, "content": "What goes up must come down, as we all know. This fact of physics is the underlying worry of the stock market, that fuels our suspicions of bubbles. But investment firm Goldman Sachs doesnt believe w… [+8675 chars]"}, {"label": 4, "content": "Demi Lovato says she identifies as pansexual.\r\nThe “Confident” singer, who has previously come out as sexually fluid, said in a new interview on “The Joe Rogan Experience” that she isn’t sure if she’… [+1635 chars]"}, {"label": 4, "content": "Jason Statham is back to put bullets in bodies again in Wrath of Man, the latest film from Snatch and The Gentlemen director Guy Ritchie. It should come as no surprise that this movie features heists… [+1893 chars]"}, {"label": 4, "content": "(CNN)Almost 60 years after they rumbled in a pretty awful 1962 movie -- featuring guys in monster suits destroying tiny models -- \"Godzilla vs. Kong\" reunite with all the wonders that modern special … [+2997 chars]"}, {"label": 4, "content": "Katie Courics fresh-faced beauty is making the news.\r\nThe award-winning journalist, 64, posed makeup-free for Peoples annual Beautiful Issue,” telling the magazine she felt “both liberated and vulner… [+1870 chars]"}, {"label": 4, "content": "Sunshine, pool time and a glass in hand? We'll cheers to that!\r\nAnd that was exactly what was on Jennifer Lopez's Sunday schedule. On March 28, the star took to social media to chronicle how she was … [+662 chars]"}, {"label": 4, "content": "Did Travis Barker trade his signature Tootsie Roll lollipops for Kourtney Kardashian’s finger?\r\nThe internet seems to think the Blink-182 drummer was caught sucking on the “Keeping Up With the Kardas… [+1977 chars]"}, {"label": 4, "content": "What is a boyfriend jean in 2021? While the traditional borrowed-from-the-boys denim silhouette connotes a slim-fitting, low-rise pair with a looser leg; a cropped, cuffed hem; and an overall constit… [+2804 chars]"}, {"label": 4, "content": "Madonna’s weekend included both self-reflection and sexy selfies.\r\nIn the wake of Photoshop accusations, the 62-year-old pop superstar shared a series of racy lingerie photos on Sunday.\r\nAnd Now For … [+1390 chars]"}, {"label": 4, "content": "Lil Nas X is sparring with critics of his latest song and the subsequent shoe line that accompanied it, including South Dakota Governor Kristi Noem. \r\nThe rapper released his controversial new song \"… [+3311 chars]"}, {"label": 4, "content": "Sounds like the Middletons are starting to speak publicly about Prince Harry and Meghan Markle's Oprah interview. And by that I mean Kate's uncle, Gary Goldsmith, has spoken out about Meghan saying K… [+1923 chars]"}, {"label": 4, "content": "Kate Middleton appeared to pay tribute to her late mother-in-law with her choice of outfit to launch her new photo book.\r\nLast year, the Duchess of Cambridge, 39, asked the public to submit photograp… [+6768 chars]"}, {"label": 4, "content": "NEW YORK (AP) A graphic novel for children from the wildly popular Captain Underpants series is being pulled from library and book store shelves after its publisher said it perpetuates passive racism… [+1595 chars]"}, {"label": 4, "content": "Im desperate to change the industry for the better\r\nLeslee Sullivant approaches the camera curiously. Her hair is pulled back into a ponytail, and shes dressed in an olive green button-up against a b… [+4473 chars]"}, {"label": 4, "content": "Obi-Wan Kenobi, the new Disney+ special event series starring Ewan McGregor as the iconic Jedi Master, will begin shooting in April.\r\nThe story begins 10 years after the dramatic events of Star Wars:… [+904 chars]"}, {"label": 4, "content": "Weve had a lot of fun over the years with Dwayne Johnson and his passion project, the DC superhero film Black Adam. From plot details, to casting updates, to which characters from the comics will be … [+1389 chars]"}, {"label": 4, "content": "Shawn Mendes and Camila Cabello reportedly had their home in Los Angeles broken into.\r\nTMZ reported that last week the thieves were able to steal Mendes' car, a Mercedes G-Class SUV, after they broke… [+1446 chars]"}, {"label": 4, "content": "“Good Morning Britain” personality Alex Beresford kept it light after Piers Morgan dubbed him “uptight.”\r\nBeresford who clashed on-air with Morgan before the star’s bitter departure from the morning … [+2254 chars]"}, {"label": 4, "content": "Somebody tell the Rose family that theyre getting evicted once again.\r\nThe Canadian motel that set the scene for \"Schitts Creek\" has hit the market for $1.6 million, inviting buyers to play hotelier … [+2069 chars]"}, {"label": 4, "content": "Kylie Jenner channeled one of this years biggest athleisure trends with ease for her latest workout.\r\nTaking her talents outdoors for a warm-weather run, the beauty mogul posed in the sun in coordina… [+2043 chars]"}, {"label": 4, "content": "This was your week Disney fans! After a long year of nothing . . . Disneyland isn’t just closer to reopening, but we have a decade or more of rumors of expansions, new attractions, more shopping, hot… [+30959 chars]"}, {"label": 4, "content": "Back in 2018, Emma opened up toElle about wanting to start a new chapter in her life.\r\n\"My perspective about kids has changed as I've gotten older. I never babysat or anything. As a teenager, I was l… [+668 chars]"}, {"label": 4, "content": "Anthony Mackie and Sebastian Stan chat with USA TODAY's Brian Truitt about the new Marvel miniseries, \"The Falcon and the Winter Soldier,\" on Disney+.\r\nUSA TODAY\r\nSpoiler alert: The following post co… [+4980 chars]"}, {"label": 4, "content": "Three weeks after Piers Morgan’s blistering attack on Meghan Markle’s CBS interview cost him his job hosting Good Morning Britain, the British firebrand is still mad as hell.\r\nOver the weekend, Morga… [+1581 chars]"}, {"label": 4, "content": "Here is the most anticipated trailer of Vakeel Saab, the film that marks the comeback of Power Star Pawan Kalyan. The trailer begins with trial lawyer questioning Pallavi (Nivetha Thomas), “Ms Pallav… [+841 chars]"}, {"label": 4, "content": "Woody Allen has spoken out about the allegations against him as well as his relationship with wife Soon-Yi Previn in a newly released interview. \r\nThe embattled filmmaker, 85, spoke with \"CBS Sunday … [+4185 chars]"}, {"label": 4, "content": "Priyanka Chopra chats with USA TODAY's Andrea Mandell about her new Netflix movie, \"The White Tiger,\" and her marriage to Nick Jonas.\r\nUSA TODAY\r\nCOVID-19 safety protocols mean Holi can't be celebrat… [+2177 chars]"}, {"label": 4, "content": "In the Guides weekly Solved! column, we look into a crucial pop-culture question youve been burning to know the answer to and settle it, once and for all\r\nAfter this Septembers No Time to Die, there … [+3041 chars]"}, {"label": 4, "content": "The couple was accused of paying $500,000 in bribe money to Rick Singer, the ringleader of Operation Varsity Blues, as well as officials at the University of Southern California.\r\nThey also falsely p… [+1163 chars]"}, {"label": 4, "content": "image copyrightGetty Images\r\nimage captionJohnson has won numerous Grammy awards as the drummer for US rock band Alabama Shakes\r\nSteven Johnson, the drummer for Grammy award-winning US rock band Alab… [+999 chars]"}, {"label": 4, "content": "Zack Snyder has explained why Darkseid forgot the Anti-Life Equation is on Earth in Zack Snyder's Justice League.\r\nIn the movie, Steppenwolf is shown the location of Anti-Life by the Mother Boxes. Wh… [+2023 chars]"}, {"label": 4, "content": "You may have heard the protagonists of the new Mighty Ducks series are not the actual Mighty Ducks. Instead, theyre the Dont Bothers, a new underdog youth hockey team that forms to challenge the reig… [+5189 chars]"}, {"label": 4, "content": "Vanessa Bryant has asked a judge to give her mom the boot in her lawsuit to win lifetime support.\r\nVanessa's mom, Sofia Laine, has filed a lawsuit against Kobe'sestate, claiming Kobe promised to take… [+1576 chars]"}, {"label": 4, "content": "The Louvre has made its entire art collection available online and for free.\r\nThe new Collections database is comprised of 482,000 works from the French museum, the Musée National Eugène-Delacroix, t… [+1465 chars]"}, {"label": 4, "content": "Onlookers could be forgiven for a doing a double take this week as Hollywood actress Kristen Stewart filmed her latest scenes as the late Diana, Princess Of Wales. \r\nThe former Twilight star takes on… [+10514 chars]"}, {"label": 4, "content": "It's always good to know which of your friendships are strong enough to withstand a difference of opinion over camera angles, as Mario Lopez recently learned.\r\nThe performer is the guest host for The… [+2131 chars]"}, {"label": 4, "content": "WWE veteran set designer Jason Robinson has assured fans that “they are going to love what they see” at Raymond James Stadium, where WrestleMania 37 will take place in less than two weeks.\r\nIn a rece… [+1844 chars]"}, {"label": 4, "content": "Speculating on the rumors surrounding pro wrestling is a favored pastime of many fans, perhaps second only to actually watching the matches. In this daily column, we take a look at the latest rumors … [+1298 chars]"}, {"label": 4, "content": "Justin Bieber recalls feeling \"Lonely\" in his new song with Benny Blanco. T.I., Tommy Lee and the Goo Goo Dolls also drop new music this weekend.\r\nUSA TODAY\r\nJustin Bieber's mom has some thoughts abo… [+2219 chars]"}, {"label": 4, "content": "Keep up with the latest daily buzz with the BuzzFeed Daily newsletter!"}, {"label": 4, "content": "American Idol Season 19s performance-packed, two-night Showstoppers round commenced Sunday, as Hollywood Weeks 64 remaining hopefuls sang with the shows in-house live band for the first time and then… [+13493 chars]"}, {"label": 4, "content": "Amy Schumer donned her fanciest dress as she  received her first dose of the COVID-19 vaccine in New York on Sunday afternoon. \r\nThe comedian, 39, has been encouraging people to put on their nicest c… [+6691 chars]"}, {"label": 4, "content": "Warning: This article contains spoilers about Sunday's episode The Walking Dead titled \"Diverged.\"\r\nSunday's \"Diverged\" episode of The Walking Dead picked up right where the \"Find Me\" episode from a … [+10100 chars]"}, {"label": 4, "content": "Of all the events canceled because of the coronavirus, few are as lively and vibrant as Comic-Con. As the conference moves online, here's a look back at some of the best fan costumes over the years. … [+4367 chars]"}, {"label": 4, "content": "Viola Davis says she's spoken to Michelle Obama 'for several hours' as she prepares to play her on Showtime's The First Lady.\r\nThe 55-year-old actress, appearing on The Tonight Show Starring Jimmy Fa… [+2605 chars]"}, {"label": 4, "content": "Paul McCartney repaid a long-standing 'debt' once he was famous with the Beatles, a letter penned by the musician and now up for auction has revealed. \r\nIn 1958, the singer, 78, and his late bandmate… [+4099 chars]"}, {"label": 5, "content": "The Marlins will option prized pitching prospect Sixto Sanchez to their alternate site/Triple-A to begin the season, Jordan McPherson of the Miami Herald reports (Twitterlinks). They’ll open the year… [+1785 chars]"}, {"label": 5, "content": "There was no one in the world busier over the weekend than Ryan Wilson -- well, except for the guys trying to get the boat unstuck in the Suez Canal -- and that's because Wilson had to completely rev… [+9225 chars]"}, {"label": 5, "content": "Cubs first baseman Anthony Rizzo told reporters today that extension talks with the team have stalled and a new deal now looks unlikely (Twitter link via The Athletic’s Patrick Mooney). The slugger a… [+2571 chars]"}, {"label": 5, "content": "Brooklyns latest addition of LaMarcus Aldridge isnt just the rich getting richer. Its a billionaire winning the Powerball and everybody else getting triggered.\r\nThe Nets officially signed Aldridge on… [+3985 chars]"}, {"label": 5, "content": "Murfreesboro (Tenn.) Oakland Top247 running back Jordan James says he had been leaning Georgia for quite some time before announcing his commitment to the Bulldogs Monday afternoon.\r\nWith James’s ple… [+2753 chars]"}, {"label": 5, "content": "NASCAR® and its marks are trademarks of the National Association for Stock Car Auto Racing, LLC. All other trademarks are the property of their respective owners.\r\nCopyright © 2021 NASCAR Digital Med… [+28 chars]"}, {"label": 5, "content": "Record: 18-28Pace: 99.9 (14) OffRtg: 112.4 (13) DefRtg: 112.5 (23) NetRtg: -0.1 (16)\r\nOther teams made bigger trades, but the Raptors led the league in deadline-week drama. Their eight-game losing st… [+1576 chars]"}, {"label": 5, "content": "JACKSONVILLE, Fla. -- It looks like Trevor Lawrence is headed to Jacksonville.\r\nJaguars coach Urban Meyer told NBCSports.com that the team is leaning toward taking the former Clemson quarterback with… [+838 chars]"}, {"label": 5, "content": "The list of lawsuits against Texans quarterback Deshaun Watson has now reached 19. One of the newest lawsuits contains a different type of allegation.\r\nVia Aaron Reiss of TheAthletic.com, one of the … [+1348 chars]"}, {"label": 5, "content": "Right-hander Mark Appel, the No. 1 pick in the 2013 MLB draft, is attempting a comeback with the Philadelphia Phillies, the team announced Monday morning. Appel stepped away from baseball to pursue a… [+2448 chars]"}, {"label": 5, "content": "Last week’s trade that moved the 49ers into the third pick of this year’s draft was followed by nearly unanimous speculation that the team plans to select a quarterback.\r\nChris Simms of NBC has sugge… [+753 chars]"}, {"label": 5, "content": "The moves that are being made are not always the ones making the headlines in the NFL. Sometimes those that do not happen do as well; just take the trade speculation surrounding New England Patriots … [+2977 chars]"}, {"label": 5, "content": "SportsPulse: The Tampa Bay Rays look to defend their AL title while the Yankees look to break their World Series drought. Steve Gardner breaks down the biggest question facing each team in the AL Eas… [+2945 chars]"}, {"label": 5, "content": "The Celtics made a strong push to add some bulk to their roster already after the trade deadline, but ultimately did not succeed in their quest to land free agent center Andre Drummond before he opte… [+6175 chars]"}, {"label": 5, "content": "Joe Robbins/Getty Images\r\nThe Pick: CB Kelvin Joseph, Kentucky\r\nJoseph is a bit of a raw prospect in this draft with only 20 career college games played in his time at both LSU and Kentucky after his… [+879 chars]"}, {"label": 5, "content": "According to a report from NFL Networks Tom Pelissero, the New Orleans Saints are in the process of signing former Kansas City Chiefs defensive end Tanoh Kpassagnon to a two-year contract.\r\nThe #Sain… [+1481 chars]"}, {"label": 5, "content": "Michigan offensive coordinator Josh Gattis updates QB battle, March 17, 2021.\r\nDetroit Free Press\r\nAs spring practice continues, Michigan football will have to prepare for another loss.\r\nReceiver Gil… [+1762 chars]"}, {"label": 5, "content": "In theory, it is difficult to quibble with the smart and progressive approach the Dolphins have taken to their rebuild under general manager Chris Grier. I've long been a proponent of them finally ta… [+7785 chars]"}, {"label": 5, "content": "We now know what the Cardinals 26 man roster will look like when the first pitch is thrown on Opening Day in a few days. No more speculating about who might or might not make the team. And while most… [+5814 chars]"}, {"label": 5, "content": "The Chicago White Sox have an agreement to sign free agent third baseman Jake Lamb, pending a physical, per Robert Murray of FanSided (via Twitter). Lamb spent the spring with the Atlanta Braves, who… [+1632 chars]"}, {"label": 5, "content": "When Ryan Fitzpatrick signed a one-year, $10 million contract with Washington Football Team in free agency, he seemingly secured the starting quarterback job for the reigning NFC East champions. As t… [+1606 chars]"}, {"label": 5, "content": "The Miami Heat were Kyle Lowry's preferred team if he was traded at the deadline, sources tell Kevin O'Connor of The Ringer. Lowry's close friendship with Jimmy Butler is cited as the driving force o… [+685 chars]"}, {"label": 5, "content": "A pair of trades on Friday rocked the top 10 of the 2021 NFL draft. How did those moves impact the Cleveland Browns down near the bottom of the first round?\r\nDraft Wire’s Luke Easterling took a stab … [+696 chars]"}, {"label": 5, "content": "SAN ANTONIO (March 29, 2021)  The San Antonio Spurs today announced that they have signed center Gorgui Dieng. Per team policy, terms of the contract were not announced. \r\nDieng, 6-10/250, spent the … [+975 chars]"}, {"label": 5, "content": "The Colts are adding some depth on the offensive line.\r\nPer multiple reports, Julién Davenport has signed with Indianapolis on a one-year deal.\r\nZak Keefer of TheAthletic.com reported the Colts were … [+469 chars]"}, {"label": 5, "content": "TribLIVE's Daily and Weekly email newsletters deliver the news you want and information you need, right to your inbox.\r\nThe Penguins have been missing their entire second line and two-thirds of their… [+4723 chars]"}, {"label": 5, "content": "The quiet free agency period for the Kansas City Chiefs was finally broken with a big-name signing. Former Seattle Seahawks defensive tackle Jarran Reed agreed to a one-year deal with the Chiefs on S… [+5978 chars]"}, {"label": 5, "content": "SportsPulse: Scott Gleeson picked Virginia to win it all in 2019. He called Loyola-Chicago as a Cinderella in 2018. Now he's ready to give you his guarantees for Monday's Elite Eight action.\r\nUSA TOD… [+2596 chars]"}, {"label": 5, "content": "The Andre Drummond signing is a correction, a transparent attempt to fill the Dwight Howard-sized hole that has festered in the Los Angeles Lakers' frontcourt all season long. Rob Pelinka made a cons… [+9715 chars]"}, {"label": 5, "content": "We welcome relevant reader comments on our sports stories on TribLIVE.com. Commenting is not available on any other stories.\r\nPlease read and be familiar our commenting policy, as follows.\r\nYou are s… [+1876 chars]"}, {"label": 5, "content": "Its an off-season refrain we have heard all too often from fans of the Green Bay Packers.\r\nThey arent doing enough in free agency!\r\nEven with a team who is coming a second consecutive NFC Championshi… [+2569 chars]"}, {"label": 5, "content": "Pro Football Focus and The Athletic released new mock drafts on Monday morning. Both have the San Francisco 49ers selecting quarterbacks at their new draft slot—No. 3 overall. They just disagreed on … [+2969 chars]"}, {"label": 5, "content": "With a new head coach and General Manager, Detroit is looking to establish some long-term success after three consecutive last-place finishes in the NFC North.\r\nQuarterback Jared Goff said during his… [+1155 chars]"}, {"label": 5, "content": "The 2021 Formula 1 season kicked off on sensational style in Bahrain courtesy of a two-team race-long fight for victory through Lewis Hamilton and Max Verstappen. There were plenty of other shining l… [+8805 chars]"}, {"label": 5, "content": "That 5th starter situation with the Dodgers seems like such a red wire, blue wire type deal man. Normally, I’d say Dustin May because his stuff is straight up filthy, but having a rotation of Kershaw… [+93 chars]"}, {"label": 5, "content": "The beginning of the NFL draft can sometimes act as a formality; with there being little surprise as to who gets picked at the top of the first round. The San Francisco 49ers trade into the top three… [+2342 chars]"}, {"label": 5, "content": "The U.S. mens national soccer team committed two errors Sunday in a match against Honduras and cost the Americans a spot in the Olympics for the third straight time.\r\nHonduras Juan Carlos Obregon sco… [+1762 chars]"}, {"label": 5, "content": "Sam Darnold‘s short tenure as a starting quarterback in New York seems to be coming to an end, as all signs are pointing toward the Jets selecting Zach Wilson with the second overall pick of the 2021… [+10262 chars]"}, {"label": 5, "content": "We live in a society that loves, and values, points. If you’re an athlete we’d like you to be either high-scoring or high-flying, but we’d prefer both. Stuff a stat sheet and we’re sure to pay attent… [+9813 chars]"}, {"label": 5, "content": "Florida Panthers defender Aaron Ekblad was carried off the ice on a stretcher in a scary scene Sunday as the team defeated the Dallas Stars, 4-1.\r\nEkblad was injured in the second period of the game … [+1142 chars]"}, {"label": 5, "content": "Should Roy Williams and the UNC basketball program reach out to Florida transfer Noah Locke? The junior guard has hit better than 40 percent of his threes over the past three seasons.\r\nThe North Caro… [+3759 chars]"}, {"label": 5, "content": "The Washington Capitals were cruising with a late 4-0 lead and heading to another casual home victory before they decided to throw all of that away and need a fifth goal to seal two points. They got … [+2254 chars]"}, {"label": 5, "content": "During a losing season, tensions run high both inside organizations and out. During the Dallas Cowboys’ 6-10 campaign, things were no different. In early October, they were 1-3 and had almost given u… [+5646 chars]"}, {"label": 5, "content": "Free agency can reveal a lot for NFL teams — weaknesses, strengths, depth issues, an abundance of depth, and if you are the New England Patriots, a change in philosophy from a free-agency watcher to … [+625 chars]"}, {"label": 5, "content": "Despite many experts predicting otherwise, Michigan was the betting favorite to reach the Final Four at the start of the NCAA Tournament. That hasnt changed entering Tuesdays Elite Eight matchup with… [+1030 chars]"}, {"label": 5, "content": "Creighton coach Greg McDermott cringed when he glanced at a halftime box score.\r\nThe Bluejays held Gonzaga first-team All-American Corey Kispert to two first-half points on Sunday, yet they still tra… [+6508 chars]"}, {"label": 5, "content": "SAN ANTONIO -- Texas put the brakes on second-seeded Maryland's high-octane offense, and the Longhorns are rolling into the Elite Eight as the lowest seed still alive in the women's NCAA tournament.\r… [+3624 chars]"}, {"label": 5, "content": "Observations from the Mets’ spring training game Sunday. \r\nNimmo Delivers\r\nBrandon Nimmo smashed his second homer of the spring in the Mets 10-2 loss to the Marlins at Roger Dean Chevrolet Stadium. N… [+706 chars]"}, {"label": 5, "content": "A tradition unlike any other, the Masters tournament at Augusta National is only two weeks away. But like other organizations, Augusta National is finding itself in the middle of a political firestor… [+4237 chars]"}, {"label": 5, "content": "The Boston Celtics could have Evan Fournier back in the lineup for Mondays game at TD Garden against the New Orleans Pelicans, which will also be the first chance for a limited number of fans to be i… [+1434 chars]"}]