[{"label": 0, "content": "Asteroid Apophisone of the scariest rocks in the solar systemwont pose a threat to Earth for at least another century, according to updated NASA calculations.\r\nEvery 80,000 years or so, an object mea… [+4637 chars]"}, {"label": 0, "content": "In a new first for genetic engineering, scientists have developed a single-celled synthetic organism that grows and divides much like a normal cell, mimicking aspects of the cell division cycle that … [+3133 chars]"}, {"label": 0, "content": "At the heart of almost every large galaxy lies an object of immense proportions a supermassive black hole. Up to billions of times more massive than our sun, these titans drive the evolution of the g… [+2986 chars]"}, {"label": 0, "content": "The scientists that revealed the very first photograph of a black hole have added polarized light to the image, offering a more detailed look at its magnetic fields.According to New Scientist, the gr… [+3119 chars]"}, {"label": 0, "content": "NASA is taking more steps to support new commercial space stations in low Earth orbit (LEO).\r\nNASA held an online industry briefing about\"commercial LEO destinations\" Tuesday (March 23) to solicit fe… [+7263 chars]"}, {"label": 0, "content": "A protoplanet slammed into the Earth about 4.5 billion years ago, knocking loose a chunk of rock that would later become the moon\r\n. Now, scientists say that remnants of that protoplanet can still be… [+2962 chars]"}, {"label": 0, "content": "A cute species of peacock spider has been named after Nemo, the beloved clownfish in Pixar's Finding Nemo franchise. \r\nMaratus nemo, which is only about the size of a grain of rice at just over 4mm i… [+6823 chars]"}, {"label": 0, "content": "The center of the Milky Way is mysteriously glowing.\r\nSure, there's a whole bunch of stars there, along with a black hole 4 million times the mass of the Sun - but subtract the light from all that, a… [+5155 chars]"}, {"label": 1, "content": "The woes that arose from Archegos Capital Management at the end of last week bled into Monday as a slew of big banks saw their share prices decline.\r\nHere's how the $20 billion blowup unfolded.\r\nU.S.… [+3566 chars]"}, {"label": 1, "content": "Sony has confirmed today that the PSN digital stores on PlayStation 3 and PSP will be closing on July 2. The PS Vita store will also shut down on August 27. Players will still be able to download gam… [+1617 chars]"}, {"label": 1, "content": "If you thought the pandemic was over in the US, think again. After almost three months of steady decline, the number of daily new cases of COVID-19 across the nation is rising. In several states, led… [+6520 chars]"}, {"label": 1, "content": "Mr. Cuomos announcement comes as New York has been adding new virus cases at one of the highest rates among U.S. states. As of Monday, the state was a seven-day average of 49 new virus cases a day fo… [+1269 chars]"}, {"label": 1, "content": "Former heavyweight champion Stipe Miocic has released his first statement after suffering a second-round knockout loss to Francis Ngannou at UFC 260 this past weekend.\r\nThe Ohio native wasnt able to … [+2987 chars]"}, {"label": 1, "content": "A federal ban on evictions is putting the squeeze on smaller landlords, who are unable to directly access Covid rental relief funds, and some are starting to sell properties to recoup losses.\r\nThis w… [+5351 chars]"}, {"label": 1, "content": "WASHINGTON The director of the Centers for Disease Control and Prevention, Rochelle Walensky, warned Monday of \"impending doom\" as the U.S. sees a steady rise in Covid-19 cases and gave an emotional … [+2413 chars]"}, {"label": 1, "content": "Suez, Egypt — The colossal container ship that spent almost a week wedged across the Suez Canal was \"successfully refloated\" and on the move again on Monday, according to Egypt's canal authority and … [+4949 chars]"}, {"label": 1, "content": "Senate Majority Leader Chuck Schumer, D-N.Y., is exploring how to pass President Biden's third economic spending bill later this year without any Republican votes via an obscure Senate rule that woul… [+5237 chars]"}, {"label": 1, "content": "Asteroid Apophisone of the scariest rocks in the solar systemwont pose a threat to Earth for at least another century, according to updated NASA calculations.\r\nEvery 80,000 years or so, an object mea… [+4637 chars]"}, {"label": 1, "content": "Public health experts are encouraging everyone to get vaccinated and fast to reduce the number of hospitalizations and coronavirus-related deaths.\r\nAll the coronavirus vaccines are free, paid for by … [+10899 chars]"}, {"label": 1, "content": "People in England are now allowed to meet outdoors in groups of up to six or two households (with social distancing), as the first of the country's coronavirus measures were eased Monday. \r\nThe count… [+1761 chars]"}, {"label": 1, "content": "Godzilla vs Kong, the marquee monster rematch of the decade, is almost here to deliver the big battle we've been waiting for. And you'll be able to watch it on HBO Max, too. The movie is already brea… [+5802 chars]"}, {"label": 1, "content": "With Jimmy Garoppolo‘s days numbered in San Francisco, speculation regarding his eventual future has centered on the Patriots. Former NFL tight end (who played at one point for the Patriots) Jermaine… [+1015 chars]"}, {"label": 1, "content": "George Floyd's attorneys and family spoke on March 29 in Minneapolis ahead of the start of the murder trial of former police officer Derek Chauvin. (Court TV)\r\nFloyds family members gathered outside … [+1861 chars]"}, {"label": 1, "content": "Both couples revealed their budding romances within the last year, with Kardashian and Barker dropping the bomb on fans via Instagram in February while Fox and Kelly shared their news on the same pla… [+374 chars]"}, {"label": 1, "content": "Cyberpunk 2077's 1.2 patch notes are huge, with literally hundreds of changes listed, which means the little details can easily get lost. One of the smaller changes did catch our eye, however the gam… [+2151 chars]"}, {"label": 1, "content": "In a new first for genetic engineering, scientists have developed a single-celled synthetic organism that grows and divides much like a normal cell, mimicking aspects of the cell division cycle that … [+3133 chars]"}, {"label": 1, "content": "AmazonThe Amazon News Twitter account and executive Dave Clark have been lashing out at critics online just as Alabama workers vote on unionization \r\nMon 29 Mar 2021 16.03 BST\r\nSay what you will abou… [+4069 chars]"}, {"label": 1, "content": "DES MOINES, Iowa —Iowas COVID-19 positivity rates continue to climb after months of declines. \r\nThe Iowa Department of Public Health reported 110 new positive virus tests and seven additional deaths … [+1163 chars]"}, {"label": 1, "content": "An Amish community in Pennsylvania may have become the first group in the U.S. to achieve herd immunity, a local health official claims.\r\nThe administrator of a medical center in the heart of Lancast… [+3162 chars]"}, {"label": 1, "content": "SportsPulse: Scott Gleeson picked Virginia to win it all in 2019. He called Loyola-Chicago as a Cinderella in 2018. Now he's ready to give you his guarantees for Monday's Elite Eight action.\r\nUSA TOD… [+2596 chars]"}, {"label": 1, "content": "YANGON, Burma A series of airstrikes by Burma's military along the country's border raised concerns Monday that more villagers might flee to neighboring Thailand in large numbers, adding a new dimens… [+6683 chars]"}, {"label": 1, "content": "Lil Nas X is sparring with critics of his latest song and the subsequent shoe line that accompanied it, including South Dakota Governor Kristi Noem. \r\nThe rapper released his controversial new song \"… [+3311 chars]"}, {"label": 1, "content": "The Mi 11 Ultra should be a serious camera upgrade\r\nXiaomi has announced its latest flagship, the Mi 11 Ultra. Its based on the excellent new Mi 11, but has a more advanced camera system including a … [+1917 chars]"}, {"label": 1, "content": "BERLIN (AP) German Chancellor Angela Merkel has blamed her countrys difficulties during the coronavirus pandemic from the slow vaccine rollout to the back-and-forth over lockdown rules partly on a te… [+4464 chars]"}, {"label": 1, "content": "The Sea Star 1, owned by the Tanzanian Zan Ferries, docked on Monday at the port in Pemba, Mozambique. The vessel has been used to evacuate around 1,400 people, mostly foreign gas workers, from fight… [+3664 chars]"}, {"label": 1, "content": "As coronavirus cases rise once again in the United States, the country is also administering vaccinations at a faster pace than ever.\r\nU.S. Covid-19 cases\r\nMore than 63,000 daily new Covid-19 cases a… [+1622 chars]"}, {"label": 1, "content": "Woody Allen has spoken out about the allegations against him as well as his relationship with wife Soon-Yi Previn in a newly released interview. \r\nThe embattled filmmaker, 85, spoke with \"CBS Sunday … [+4185 chars]"}, {"label": 1, "content": "By introducing its own M1 chips to its latest range of Macs, Apple finally brought the cohesive experience of its iPhone and iPads to its laptops and desktops. As we noted in our reviews, the improve… [+1650 chars]"}, {"label": 1, "content": "Sam Darnold‘s short tenure as a starting quarterback in New York seems to be coming to an end, as all signs are pointing toward the Jets selecting Zach Wilson with the second overall pick of the 2021… [+10262 chars]"}, {"label": 1, "content": "When we said there were millions of tests available, there werent, right? said Brett Giroir, who served as the nations coronavirus testing czar, referencing the administrations repeated claims in Mar… [+10207 chars]"}, {"label": 1, "content": "If you think the practice of value investing has been made redundant by the emergence of high-growing tech stocks, you are mistaken. Amidst an overvalued stock market and near-zero interest rates, yi… [+4552 chars]"}, {"label": 1, "content": "AUSTIN (KXAN) Texas opened registration for the COVID-19 vaccine to people aged 16 years or older Monday, and with the move, the state launched a website to help people sign up to get it.\r\nThe Texas … [+1585 chars]"}, {"label": 1, "content": "There is very little set in stone for a recall election in which voters could remove Gov. Gavin Newsom from office beyond the ballots basic question of whether the governor should keep his job.\r\nReca… [+7214 chars]"}, {"label": 1, "content": "A protoplanet slammed into the Earth about 4.5 billion years ago, knocking loose a chunk of rock that would later become the moon\r\n. Now, scientists say that remnants of that protoplanet can still be… [+2962 chars]"}, {"label": 1, "content": "A contracted helicopter carrying guides and guests from a lodge on a heli-skiing trip in Southcentral Alaskas backcountry crashed Saturday evening, killing the pilot and four others, including the Cz… [+4240 chars]"}, {"label": 2, "content": "The Pfizer and Moderna Covid-19 vaccines are extremely effective in the real world, reducing infections by 90 percent in fully vaccinated people, the Centers for Disease Control and Prevention report… [+2982 chars]"}, {"label": 2, "content": "OSCEOLA COUNTY, Fla. —On Monday, the state of Florida dropped the age requirement for COVID-19 vaccines to 40. \r\nWhat were asking individuals to do who are interested in getting vaccinated at our loc… [+1498 chars]"}, {"label": 2, "content": "MichiganLaw passed by Republicans in control of state legislature prompts Democrats to accuse them of politicizing public health effort\r\nResidents of Michigan receiving the Johnson &amp; Johnson Covi… [+3652 chars]"}, {"label": 2, "content": "Dietary supplements are used by millions for their purported health benefits, constituting a nearly $37 billion industry in the U.S. as of 2021. But one popular daily pill could be creating serious p… [+3503 chars]"}, {"label": 2, "content": "People in England are now allowed to meet outdoors in groups of up to six or two households (with social distancing), as the first of the country's coronavirus measures were eased Monday. \r\nThe count… [+1761 chars]"}, {"label": 2, "content": "DES MOINES, Iowa —Iowas COVID-19 positivity rates continue to climb after months of declines. \r\nThe Iowa Department of Public Health reported 110 new positive virus tests and seven additional deaths … [+1163 chars]"}, {"label": 2, "content": "Two counties in the Hudson Valley have the highest COVID-19 positivity rate in New York State, according to the most recent data from the Department of Health. \r\nIn Orange County, the 6.7 percent pos… [+3443 chars]"}, {"label": 2, "content": "An Amish community in Pennsylvania may have become the first group in the U.S. to achieve herd immunity, a local health official claims.\r\nThe administrator of a medical center in the heart of Lancast… [+3162 chars]"}, {"label": 2, "content": "Some immunocompromised people are wondering whether or when to get the COVID-19 vaccine.\r\nSarahbeth Maney/San Francisco Chronicle via Getty Images\r\nLots of people have questions about getting vaccina… [+8200 chars]"}, {"label": 2, "content": "WINSTON-SALEM, N.C. —The North Carolina Department of Health and Human Services has an online tool to help North Carolinians know when they will be eligible to get their vaccine. \r\nThe Find My Vaccin… [+10469 chars]"}, {"label": 2, "content": "Michigan now has 13 of its 83 counties with a positivity rate over 15% as a seven-day average on coronavirus diagnostic tests.\r\nThose counties include Macomb, Genesee, Lapeer and St. Clair.\r\n6 reason… [+6645 chars]"}, {"label": 2, "content": "Ten states are set to open vaccine eligibility to all adults this week, about a month before President BidenJoe BidenThe Hill's Morning Report - Biden to talk infrastructure amid border, voting contr… [+1337 chars]"}, {"label": 2, "content": "People with severe gum disease are twice as likely to have high blood pressure, according to a new study.\r\nA study of 250 people with periodontitis severe gum disease found people with the condition … [+4627 chars]"}, {"label": 2, "content": "SAN FRANCISCO (KGO) -- The COVID-19 pandemic is having a major impact across the world and also in cities across Northern California. The latest number of confirmed cases in the U.S. can be found at … [+19355 chars]"}, {"label": 2, "content": "Alexander Gintsburg, the director of Moscow’s Gamaleya Institute – which developed the pioneering formula – claimed in an interview with Moscow outlet Izvestiya, published on Monday, that the virus c… [+2409 chars]"}, {"label": 2, "content": "Students and educators from schools across the nation discuss how they have maintained relationships this past year amidst the coronavirus pandemic.\r\nUSA TODAY\r\nTen states will open eligibility for c… [+4730 chars]"}, {"label": 2, "content": "A woman ended up in hospital with third degree burns after she and her partner attempted to spice up their sex life by melting down a giant gummy bear.\r\nThe problem being, gummy bears are made entire… [+1964 chars]"}, {"label": 2, "content": "More than 540.9 million vaccine doses have been administered worldwide, equal to 7.0 doses for every 100 people. There is already a stark gap between vaccination programs in different countries, with… [+2322 chars]"}, {"label": 2, "content": "To date, the U.S. Centers for Disease Control and Prevention has awarded five variants this dubious distinction: B.1.1.7 (or the British variant), P.1 (Brazilian), B.1.351 (South African) and B.1.427… [+1091 chars]"}, {"label": 2, "content": "DURHAM, N.C. (AP) The 9-year-old twins didn't flinch as each received test doses of Pfizer's COVID-19 vaccine and then a sparkly bandage to cover the spot.\r\n\"Sparkles make everything better,\" declare… [+4925 chars]"}, {"label": 3, "content": "The woes that arose from Archegos Capital Management at the end of last week bled into Monday as a slew of big banks saw their share prices decline.\r\nHere's how the $20 billion blowup unfolded.\r\nU.S.… [+3566 chars]"}, {"label": 3, "content": "Volkswagen accidentally posted a press release on its website a month early on Monday announcing a new name for its U.S. operations, Voltswagen of America, emphasizing the German automaker's electric… [+2169 chars]"}, {"label": 3, "content": "During a panel discussion hosted by the Chicago Board Options Exchange (CBOE) last week, CEO of investment management firm Ark Investment Management Cathie Wood shared some decidedly bullish sentimen… [+1257 chars]"}, {"label": 3, "content": "By David Shepardson\r\nWASHINGTON (Reuters) - Thirteen U.S. House Democratic lawmakers on Monday urged the U.S. Postal Service's governing board to halt implementation of a contract that could be worth… [+1733 chars]"}, {"label": 3, "content": "Married? You may want to think about how claiming Social Security early would affect your spousal benefits.\r\nFor starters, not all early filers can access those benefits right away. And for those who… [+4454 chars]"}, {"label": 3, "content": "We are ready to rock-and-roll, national climate adviser Gina McCarthy told reporters in a phone call Monday. She framed the effort as being as much about jobs as about clean energy. Offshore wind pow… [+4084 chars]"}, {"label": 3, "content": "NEW YORK (AP) The U.S government's first look at the real-world use of COVID-19 vaccines found their effectiveness was nearly as robust as it was in controlled studies.\r\nThe two vaccines available si… [+3619 chars]"}, {"label": 3, "content": "The latest 13F reporting period has come and gone, and Insider Monkey is again at the forefront when it comes to making use of this gold mine of data. Insider Monkey finished processing 887 13F filin… [+6486 chars]"}, {"label": 3, "content": "Drew Lehman of Lansdale, Pa., became unable to work after a traumatic car accident. He is currently navigating the confusing, bureaucratic process of getting his federal student loans discharged.\r\n/N… [+7846 chars]"}, {"label": 3, "content": "The Federal Reserve is not keeping monetary policy easy to enable the government to rung up debts and deficits, Fed Governor Christopher Waller said Monday.\r\nDefending the Fed's independence from the… [+2094 chars]"}, {"label": 3, "content": "MADRID With the number of new COVID-19 cases in Spain creeping higher, officials are urging people to prevent the pandemic from surging out of control by complying with restrictions on movements and … [+12568 chars]"}, {"label": 3, "content": "Tesla has secured a new order for 10 Tesla electric semi-trucks and 2 Megachargers with almost $2 million in US government support.\r\nSince unveiling the Tesla Semi in 2017, Tesla has been taking rese… [+2322 chars]"}, {"label": 3, "content": "Two more Bay Area counties are expected to advance from the red tier to the more lenient orange tier in the state's reopening plan, paving the way for more reopenings.Alameda and Napa are on track to… [+3082 chars]"}, {"label": 3, "content": "Stretch unloads a Spot robot dog in a Boston Dynamics video showing prototypes of the box-moving machines.\r\nBoston Dynamics video screenshot by Amanda Kooser/CNET\r\nBoston Dynamics is known for Spot, … [+1422 chars]"}, {"label": 3, "content": "(WSYR-TV) — New York State is the first in the U.S. to formally launch an app, using technology to fast track the reopening of businesses and event venues. The New York Excelsior Pass provides a free… [+3006 chars]"}, {"label": 3, "content": "JACKSONVILLE, Fla. Floridas age eligibility requirement for getting the COVID-19 vaccine drops to 40 and older on Monday, making it available to another 2.5 million Floridians.\r\nThe age requirement d… [+2739 chars]"}, {"label": 3, "content": "A worker stacks boxes inside of an Amazon fulfillment center in Robbinsville, New Jersey.\r\nThe next big industrial warehouse might find itself on top of a former golf course. Or in an empty office bu… [+6054 chars]"}, {"label": 3, "content": "AmazonThe Amazon News Twitter account and executive Dave Clark have been lashing out at critics online just as Alabama workers vote on unionization \r\nMon 29 Mar 2021 16.03 BST\r\nSay what you will abou… [+4069 chars]"}, {"label": 3, "content": "Oliver Zak and Selom Agbitor started Mad Rabbit Tattoo, a company that sells tattoo aftercare products, as a side hustle while attending Miami University in 2019. Now, that side hustle has landed the… [+2585 chars]"}, {"label": 3, "content": "Early on Monday morning, March 22, during the Bank of International Settlement’s Innovation Summit, Federal Reserve chair Jerome Powell had this to say about bitcoin or, in his words, “crypto assets”… [+7348 chars]"}, {"label": 3, "content": "Editor's note: SpaceX has not released webcast details for today's Starship SN11 test flight. Above is a livestream of Starship SN11 testing from NASASpacefight.com, which you can watch directly on Y… [+2977 chars]"}, {"label": 3, "content": "DAVIE, Fla. Stop what youre doing and check your tickets.\r\nA $28 million Florida Lotto ticket was sold in Davie, and state lottery officials are still waiting for the jackpot winner to come forward.\r… [+1008 chars]"}, {"label": 3, "content": "American depositary receipts of Chinese electric-vehicle makers NIO, Li Auto, and XPeng are under more pressure after an editorial in a Chinese news outlet called out some problems with the local EV … [+261 chars]"}, {"label": 3, "content": "A new supersonic commercial airliner was announced on Monday, one that its designer and manufacturer says will reach speeds of Mach 4-plus. Aerion said the AS3 will make its first flight before the e… [+2359 chars]"}, {"label": 3, "content": "If youve paid attention when you pull up to the pumps, you know that gas prices have been on the rise as of late. But why?\r\nMoney expert Clark Howard says there are three reasons why youre paying mor… [+3043 chars]"}, {"label": 3, "content": "That's a lot of screen.\r\nMercedes-Benz\r\nHere's the Mercedes-Benz EQS' ginormous Hyperscreen in all its glory. This weekend, the German luxury brand decided to show off the interior in full before the… [+2692 chars]"}, {"label": 3, "content": "U.S. equity markets were mixed Monday as banks were left licking their wounds after a large hedge fund was forced to unwind billions of dollars in positions.\r\n<table><tr><th>Ticker</th><th>Security</… [+4174 chars]"}, {"label": 3, "content": "U.S. stocks opened lower Monday, dogged by concerns about the ripple effects from forced selling Friday by a large investment firm. The Dow Jones Industrial Average \r\n DJIA,\r\n +0.16%\r\nlost 139 points… [+499 chars]"}, {"label": 3, "content": "Investment banking firm Oppenheimer &amp; Co expects blockchain technology to eventually upend many legacy industries including banking, law, healthcare and supply chains.\r\nIn the firm's most recent … [+5265 chars]"}, {"label": 3, "content": "Global demand for books print and digital has never been higher than it is now, Brian Murray, the president and chief executive of HarperCollins Publishers, said in a statement. We expect faster grow… [+1885 chars]"}, {"label": 3, "content": "Based on data compiled by Credible Operations, Inc., NMLS Number 1681276, current mortgage refinance rates have risen compared to last Friday’s. Rates for 30-year refinance have hit 3.250% again, whi… [+4671 chars]"}, {"label": 3, "content": "Gold futures posted their lowest settlement in three weeks on Monday, pressured by strength in the U.S. dollar and Treasury yields.The U.S. dollar edged up by 0.2% to 92.91, as measured by the ICE U.… [+3062 chars]"}, {"label": 3, "content": "\"We have African Americans today who have a lot less wealth in part because they have not been able to inherent the wealth that would have accrued had their ancestors been able to accrue that wealth.… [+38 chars]"}, {"label": 3, "content": "If you think the practice of value investing has been made redundant by the emergence of high-growing tech stocks, you are mistaken. Amidst an overvalued stock market and near-zero interest rates, yi… [+4552 chars]"}, {"label": 3, "content": "A major construction team on the California bullet train project notified the state rail authority this month that it will not complete a 65-mile section of the future route in Kings County until at … [+6841 chars]"}, {"label": 3, "content": "Scientists view Florida the state furthest along in lifting restrictions, reopening society and welcoming tourists as a bellwether for the nation.\r\nIf recent trends there are any indication, the rest… [+801 chars]"}, {"label": 3, "content": "image copyright Science Photo Library\r\nFacebook and Google are planning two new undersea internet cables to connect South East Asia to North America.\r\nThe project with regional telecoms companies aim… [+2283 chars]"}, {"label": 3, "content": "The reactions have been different from the callouts pursued by the Instagram watchdog Diet Prada they are broader and more personal.\r\nEach time, Mr. Clemens and Mr. Radboy have stayed quiet, in part … [+979 chars]"}, {"label": 3, "content": "Hand sanitizers have become trusted tools to keep people safe and healthy in the fight against the COVID-19 pandemic — but now, an independent study suggests some products may be having the opposite … [+3052 chars]"}, {"label": 3, "content": "Establishing an intelligent clinical development program pathway from the start is vital for clarity around the complex processes required to achieve product registration.\r\nThe Drug Development Plan … [+536 chars]"}, {"label": 3, "content": "Chicago Tribune\r\nRobservations on the media beat:\r\nCould an 85-year-old billionaire environmentalist from Wyoming turn out to be the savior of the Chicago Tribune?Hansjörg Wyss, Swiss-born former chi… [+2913 chars]"}, {"label": 3, "content": "Enlarge/ Look ma, I'm on the blockchain\r\n136 with 94 posters participating, including story author\r\nIt has been nearly 10 years now since Ars Technica first described Bitcoin to readers as the worlds… [+11902 chars]"}, {"label": 3, "content": "BURLINGAME, Calif.--(BUSINESS WIRE)--Humanigen, Inc. (Nasdaq: HGEN) (Humanigen), a clinical-stage biopharmaceutical company focused on preventing and treating an immune hyper-response called cytokine… [+10137 chars]"}, {"label": 3, "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncomme… [+32 chars]"}, {"label": 3, "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+2825 chars]"}, {"label": 3, "content": "LONDON Food delivery start-up Deliveroo has changed the target value for its initial public offering on the London Stock Exchange, after some some investors expressed concerns over workers' rights an… [+2887 chars]"}, {"label": 3, "content": "I can imagine that for someone like Mark Zuckerberg, having to jump on a video meeting with members of Congress to answer questions about how your platform is sowing misinformation is quite an inconv… [+3819 chars]"}, {"label": 3, "content": "Cazoo founder and CEO Alex Chesterman.\r\nLONDON Cazoo announced Monday that it will go public through a merger with billionaire investor Daniel Och's special purpose acquisition company.\r\nCazoo, found… [+2793 chars]"}, {"label": 3, "content": "Visa Inc. headquarters in Foster City, California\r\n© 2020 Bloomberg Finance LP\r\nVisa is piloting transaction settlement in stablecoins on the Ethereum blockchain. \r\nThe credit card provider that move… [+3116 chars]"}, {"label": 3, "content": "What goes up must come down, as we all know. This fact of physics is the underlying worry of the stock market, that fuels our suspicions of bubbles. But investment firm Goldman Sachs doesnt believe w… [+8675 chars]"}, {"label": 4, "content": "Demi Lovato says she identifies as pansexual.\r\nThe “Confident” singer, who has previously come out as sexually fluid, said in a new interview on “The Joe Rogan Experience” that she isn’t sure if she’… [+1635 chars]"}, {"label": 4, "content": "Jason Statham is back to put bullets in bodies again in Wrath of Man, the latest film from Snatch and The Gentlemen director Guy Ritchie. It should come as no surprise that this movie features heists… [+1893 chars]"}, {"label": 4, "content": "(CNN)Almost 60 years after they rumbled in a pretty awful 1962 movie -- featuring guys in monster suits destroying tiny models -- \"Godzilla vs. Kong\" reunite with all the wonders that modern special … [+2997 chars]"}, {"label": 4, "content": "Katie Courics fresh-faced beauty is making the news.\r\nThe award-winning journalist, 64, posed makeup-free for Peoples annual Beautiful Issue,” telling the magazine she felt “both liberated and vulner… [+1870 chars]"}, {"label": 4, "content": "Sunshine, pool time and a glass in hand? We'll cheers to that!\r\nAnd that was exactly what was on Jennifer Lopez's Sunday schedule. On March 28, the star took to social media to chronicle how she was … [+662 chars]"}, {"label": 4, "content": "Did Travis Barker trade his signature Tootsie Roll lollipops for Kourtney Kardashian’s finger?\r\nThe internet seems to think the Blink-182 drummer was caught sucking on the “Keeping Up With the Kardas… [+1977 chars]"}, {"label": 4, "content": "What is a boyfriend jean in 2021? While the traditional borrowed-from-the-boys denim silhouette connotes a slim-fitting, low-rise pair with a looser leg; a cropped, cuffed hem; and an overall constit… [+2804 chars]"}, {"label": 4, "content": "Madonna’s weekend included both self-reflection and sexy selfies.\r\nIn the wake of Photoshop accusations, the 62-year-old pop superstar shared a series of racy lingerie photos on Sunday.\r\nAnd Now For … [+1390 chars]"}, {"label": 4, "content": "Lil Nas X is sparring with critics of his latest song and the subsequent shoe line that accompanied it, including South Dakota Governor Kristi Noem. \r\nThe rapper released his controversial new song \"… [+3311 chars]"}, {"label": 4, "content": "Sounds like the Middletons are starting to speak publicly about Prince Harry and Meghan Markle's Oprah interview. And by that I mean Kate's uncle, Gary Goldsmith, has spoken out about Meghan saying K… [+1923 chars]"}, {"label": 4, "content": "Kate Middleton appeared to pay tribute to her late mother-in-law with her choice of outfit to launch her new photo book.\r\nLast year, the Duchess of Cambridge, 39, asked the public to submit photograp… [+6768 chars]"}, {"label": 4, "content": "NEW YORK (AP) A graphic novel for children from the wildly popular Captain Underpants series is being pulled from library and book store shelves after its publisher said it perpetuates passive racism… [+1595 chars]"}, {"label": 4, "content": "Im desperate to change the industry for the better\r\nLeslee Sullivant approaches the camera curiously. Her hair is pulled back into a ponytail, and shes dressed in an olive green button-up against a b… [+4473 chars]"}, {"label": 4, "content": "Obi-Wan Kenobi, the new Disney+ special event series starring Ewan McGregor as the iconic Jedi Master, will begin shooting in April.\r\nThe story begins 10 years after the dramatic events of Star Wars:… [+904 chars]"}, {"label": 4, "content": "Weve had a lot of fun over the years with Dwayne Johnson and his passion project, the DC superhero film Black Adam. From plot details, to casting updates, to which characters from the comics will be … [+1389 chars]"}, {"label": 4, "content": "Shawn Mendes and Camila Cabello reportedly had their home in Los Angeles broken into.\r\nTMZ reported that last week the thieves were able to steal Mendes' car, a Mercedes G-Class SUV, after they broke… [+1446 chars]"}, {"label": 4, "content": "“Good Morning Britain” personality Alex Beresford kept it light after Piers Morgan dubbed him “uptight.”\r\nBeresford who clashed on-air with Morgan before the star’s bitter departure from the morning … [+2254 chars]"}, {"label": 4, "content": "Somebody tell the Rose family that theyre getting evicted once again.\r\nThe Canadian motel that set the scene for \"Schitts Creek\" has hit the market for $1.6 million, inviting buyers to play hotelier … [+2069 chars]"}, {"label": 4, "content": "Kylie Jenner channeled one of this years biggest athleisure trends with ease for her latest workout.\r\nTaking her talents outdoors for a warm-weather run, the beauty mogul posed in the sun in coordina… [+2043 chars]"}, {"label": 4, "content": "This was your week Disney fans! After a long year of nothing . . . Disneyland isn’t just closer to reopening, but we have a decade or more of rumors of expansions, new attractions, more shopping, hot… [+30959 chars]"}, {"label": 4, "content": "Back in 2018, Emma opened up toElle about wanting to start a new chapter in her life.\r\n\"My perspective about kids has changed as I've gotten older. I never babysat or anything. As a teenager, I was l… [+668 chars]"}, {"label": 4, "content": "Anthony Mackie and Sebastian Stan chat with USA TODAY's Brian Truitt about the new Marvel miniseries, \"The Falcon and the Winter Soldier,\" on Disney+.\r\nUSA TODAY\r\nSpoiler alert: The following post co… [+4980 chars]"}, {"label": 4, "content": "Three weeks after Piers Morgan’s blistering attack on Meghan Markle’s CBS interview cost him his job hosting Good Morning Britain, the British firebrand is still mad as hell.\r\nOver the weekend, Morga… [+1581 chars]"}, {"label": 4, "content": "Here is the most anticipated trailer of Vakeel Saab, the film that marks the comeback of Power Star Pawan Kalyan. The trailer begins with trial lawyer questioning Pallavi (Nivetha Thomas), “Ms Pallav… [+841 chars]"}, {"label": 4, "content": "Woody Allen has spoken out about the allegations against him as well as his relationship with wife Soon-Yi Previn in a newly released interview. \r\nThe embattled filmmaker, 85, spoke with \"CBS Sunday … [+4185 chars]"}, {"label": 4, "content": "Priyanka Chopra chats with USA TODAY's Andrea Mandell about her new Netflix movie, \"The White Tiger,\" and her marriage to Nick Jonas.\r\nUSA TODAY\r\nCOVID-19 safety protocols mean Holi can't be celebrat… [+2177 chars]"}, {"label": 4, "content": "In the Guides weekly Solved! column, we look into a crucial pop-culture question youve been burning to know the answer to and settle it, once and for all\r\nAfter this Septembers No Time to Die, there … [+3041 chars]"}, {"label": 4, "content": "The couple was accused of paying $500,000 in bribe money to Rick Singer, the ringleader of Operation Varsity Blues, as well as officials at the University of Southern California.\r\nThey also falsely p… [+1163 chars]"}, {"label": 4, "content": "image copyrightGetty Images\r\nimage captionJohnson has won numerous Grammy awards as the drummer for US rock band Alabama Shakes\r\nSteven Johnson, the drummer for Grammy award-winning US rock band Alab… [+999 chars]"}, {"label": 4, "content": "Zack Snyder has explained why Darkseid forgot the Anti-Life Equation is on Earth in Zack Snyder's Justice League.\r\nIn the movie, Steppenwolf is shown the location of Anti-Life by the Mother Boxes. Wh… [+2023 chars]"}, {"label": 4, "content": "You may have heard the protagonists of the new Mighty Ducks series are not the actual Mighty Ducks. Instead, theyre the Dont Bothers, a new underdog youth hockey team that forms to challenge the reig… [+5189 chars]"}, {"label": 4, "content": "Vanessa Bryant has asked a judge to give her mom the boot in her lawsuit to win lifetime support.\r\nVanessa's mom, Sofia Laine, has filed a lawsuit against Kobe'sestate, claiming Kobe promised to take… [+1576 chars]"}, {"label": 4, "content": "The Louvre has made its entire art collection available online and for free.\r\nThe new Collections database is comprised of 482,000 works from the French museum, the Musée National Eugène-Delacroix, t… [+1465 chars]"}, {"label": 4, "content": "Onlookers could be forgiven for a doing a double take this week as Hollywood actress Kristen Stewart filmed her latest scenes as the late Diana, Princess Of Wales. \r\nThe former Twilight star takes on… [+10514 chars]"}, {"label": 4, "content": "It's always good to know which of your friendships are strong enough to withstand a difference of opinion over camera angles, as Mario Lopez recently learned.\r\nThe performer is the guest host for The… [+2131 chars]"}, {"label": 4, "content": "WWE veteran set designer Jason Robinson has assured fans that “they are going to love what they see” at Raymond James Stadium, where WrestleMania 37 will take place in less than two weeks.\r\nIn a rece… [+1844 chars]"}, {"label": 4, "content": "Speculating on the rumors surrounding pro wrestling is a favored pastime of many fans, perhaps second only to actually watching the matches. In this daily column, we take a look at the latest rumors … [+1298 chars]"}, {"label": 4, "content": "Justin Bieber recalls feeling \"Lonely\" in his new song with Benny Blanco. T.I., Tommy Lee and the Goo Goo Dolls also drop new music this weekend.\r\nUSA TODAY\r\nJustin Bieber's mom has some thoughts abo… [+2219 chars]"}, {"label": 4, "content": "Keep up with the latest daily buzz with the BuzzFeed Daily newsletter!"}, {"label": 4, "content": "American Idol Season 19s performance-packed, two-night Showstoppers round commenced Sunday, as Hollywood Weeks 64 remaining hopefuls sang with the shows in-house live band for the first time and then… [+13493 chars]"}, {"label": 4, "content": "Amy Schumer donned her fanciest dress as she  received her first dose of the COVID-19 vaccine in New York on Sunday afternoon. \r\nThe comedian, 39, has been encouraging people to put on their nicest c… [+6691 chars]"}, {"label": 4, "content": "Warning: This article contains spoilers about Sunday's episode The Walking Dead titled \"Diverged.\"\r\nSunday's \"Diverged\" episode of The Walking Dead picked up right where the \"Find Me\" episode from a … [+10100 chars]"}, {"label": 4, "content": "Of all the events canceled because of the coronavirus, few are as lively and vibrant as Comic-Con. As the conference moves online, here's a look back at some of the best fan costumes over the years. … [+4367 chars]"}, {"label": 4, "content": "Viola Davis says she's spoken to Michelle Obama 'for several hours' as she prepares to play her on Showtime's The First Lady.\r\nThe 55-year-old actress, appearing on The Tonight Show Starring Jimmy Fa… [+2605 chars]"}, {"label": 4, "content": "Paul McCartney repaid a long-standing 'debt' once he was famous with the Beatles, a letter penned by the musician and now up for auction has revealed. \r\nIn 1958, the singer, 78, and his late bandmate… [+4099 chars]"}, {"label": 5, "content": "The Marlins will option prized pitching prospect Sixto Sanchez to their alternate site/Triple-A to begin the season, Jordan McPherson of the Miami Herald reports (Twitterlinks). They’ll open the year… [+1785 chars]"}, {"label": 5, "content": "There was no one in the world busier over the weekend than Ryan Wilson -- well, except for the guys trying to get the boat unstuck in the Suez Canal -- and that's because Wilson had to completely rev… [+9225 chars]"}, {"label": 5, "content": "Cubs first baseman Anthony Rizzo told reporters today that extension talks with the team have stalled and a new deal now looks unlikely (Twitter link via The Athletic’s Patrick Mooney). The slugger a… [+2571 chars]"}, {"label": 5, "content": "Brooklyns latest addition of LaMarcus Aldridge isnt just the rich getting richer. Its a billionaire winning the Powerball and everybody else getting triggered.\r\nThe Nets officially signed Aldridge on… [+3985 chars]"}, {"label": 5, "content": "Murfreesboro (Tenn.) Oakland Top247 running back Jordan James says he had been leaning Georgia for quite some time before announcing his commitment to the Bulldogs Monday afternoon.\r\nWith James’s ple… [+2753 chars]"}, {"label": 5, "content": "NASCAR® and its marks are trademarks of the National Association for Stock Car Auto Racing, LLC. All other trademarks are the property of their respective owners.\r\nCopyright © 2021 NASCAR Digital Med… [+28 chars]"}, {"label": 5, "content": "Record: 18-28Pace: 99.9 (14) OffRtg: 112.4 (13) DefRtg: 112.5 (23) NetRtg: -0.1 (16)\r\nOther teams made bigger trades, but the Raptors led the league in deadline-week drama. Their eight-game losing st… [+1576 chars]"}, {"label": 5, "content": "JACKSONVILLE, Fla. -- It looks like Trevor Lawrence is headed to Jacksonville.\r\nJaguars coach Urban Meyer told NBCSports.com that the team is leaning toward taking the former Clemson quarterback with… [+838 chars]"}, {"label": 5, "content": "The list of lawsuits against Texans quarterback Deshaun Watson has now reached 19. One of the newest lawsuits contains a different type of allegation.\r\nVia Aaron Reiss of TheAthletic.com, one of the … [+1348 chars]"}, {"label": 5, "content": "Right-hander Mark Appel, the No. 1 pick in the 2013 MLB draft, is attempting a comeback with the Philadelphia Phillies, the team announced Monday morning. Appel stepped away from baseball to pursue a… [+2448 chars]"}, {"label": 5, "content": "Last week’s trade that moved the 49ers into the third pick of this year’s draft was followed by nearly unanimous speculation that the team plans to select a quarterback.\r\nChris Simms of NBC has sugge… [+753 chars]"}, {"label": 5, "content": "The moves that are being made are not always the ones making the headlines in the NFL. Sometimes those that do not happen do as well; just take the trade speculation surrounding New England Patriots … [+2977 chars]"}, {"label": 5, "content": "SportsPulse: The Tampa Bay Rays look to defend their AL title while the Yankees look to break their World Series drought. Steve Gardner breaks down the biggest question facing each team in the AL Eas… [+2945 chars]"}, {"label": 5, "content": "The Celtics made a strong push to add some bulk to their roster already after the trade deadline, but ultimately did not succeed in their quest to land free agent center Andre Drummond before he opte… [+6175 chars]"}, {"label": 5, "content": "Joe Robbins/Getty Images\r\nThe Pick: CB Kelvin Joseph, Kentucky\r\nJoseph is a bit of a raw prospect in this draft with only 20 career college games played in his time at both LSU and Kentucky after his… [+879 chars]"}, {"label": 5, "content": "According to a report from NFL Networks Tom Pelissero, the New Orleans Saints are in the process of signing former Kansas City Chiefs defensive end Tanoh Kpassagnon to a two-year contract.\r\nThe #Sain… [+1481 chars]"}, {"label": 5, "content": "Michigan offensive coordinator Josh Gattis updates QB battle, March 17, 2021.\r\nDetroit Free Press\r\nAs spring practice continues, Michigan football will have to prepare for another loss.\r\nReceiver Gil… [+1762 chars]"}, {"label": 5, "content": "In theory, it is difficult to quibble with the smart and progressive approach the Dolphins have taken to their rebuild under general manager Chris Grier. I've long been a proponent of them finally ta… [+7785 chars]"}, {"label": 5, "content": "We now know what the Cardinals 26 man roster will look like when the first pitch is thrown on Opening Day in a few days. No more speculating about who might or might not make the team. And while most… [+5814 chars]"}, {"label": 5, "content": "The Chicago White Sox have an agreement to sign free agent third baseman Jake Lamb, pending a physical, per Robert Murray of FanSided (via Twitter). Lamb spent the spring with the Atlanta Braves, who… [+1632 chars]"}, {"label": 5, "content": "When Ryan Fitzpatrick signed a one-year, $10 million contract with Washington Football Team in free agency, he seemingly secured the starting quarterback job for the reigning NFC East champions. As t… [+1606 chars]"}, {"label": 5, "content": "The Miami Heat were Kyle Lowry's preferred team if he was traded at the deadline, sources tell Kevin O'Connor of The Ringer. Lowry's close friendship with Jimmy Butler is cited as the driving force o… [+685 chars]"}, {"label": 5, "content": "A pair of trades on Friday rocked the top 10 of the 2021 NFL draft. How did those moves impact the Cleveland Browns down near the bottom of the first round?\r\nDraft Wire’s Luke Easterling took a stab … [+696 chars]"}, {"label": 5, "content": "SAN ANTONIO (March 29, 2021)  The San Antonio Spurs today announced that they have signed center Gorgui Dieng. Per team policy, terms of the contract were not announced. \r\nDieng, 6-10/250, spent the … [+975 chars]"}, {"label": 5, "content": "The Colts are adding some depth on the offensive line.\r\nPer multiple reports, Julién Davenport has signed with Indianapolis on a one-year deal.\r\nZak Keefer of TheAthletic.com reported the Colts were … [+469 chars]"}, {"label": 5, "content": "TribLIVE's Daily and Weekly email newsletters deliver the news you want and information you need, right to your inbox.\r\nThe Penguins have been missing their entire second line and two-thirds of their… [+4723 chars]"}, {"label": 5, "content": "The quiet free agency period for the Kansas City Chiefs was finally broken with a big-name signing. Former Seattle Seahawks defensive tackle Jarran Reed agreed to a one-year deal with the Chiefs on S… [+5978 chars]"}, {"label": 5, "content": "SportsPulse: Scott Gleeson picked Virginia to win it all in 2019. He called Loyola-Chicago as a Cinderella in 2018. Now he's ready to give you his guarantees for Monday's Elite Eight action.\r\nUSA TOD… [+2596 chars]"}, {"label": 5, "content": "The Andre Drummond signing is a correction, a transparent attempt to fill the Dwight Howard-sized hole that has festered in the Los Angeles Lakers' frontcourt all season long. Rob Pelinka made a cons… [+9715 chars]"}, {"label": 5, "content": "We welcome relevant reader comments on our sports stories on TribLIVE.com. Commenting is not available on any other stories.\r\nPlease read and be familiar our commenting policy, as follows.\r\nYou are s… [+1876 chars]"}, {"label": 5, "content": "Its an off-season refrain we have heard all too often from fans of the Green Bay Packers.\r\nThey arent doing enough in free agency!\r\nEven with a team who is coming a second consecutive NFC Championshi… [+2569 chars]"}, {"label": 5, "content": "Pro Football Focus and The Athletic released new mock drafts on Monday morning. Both have the San Francisco 49ers selecting quarterbacks at their new draft slot—No. 3 overall. They just disagreed on … [+2969 chars]"}, {"label": 5, "content": "With a new head coach and General Manager, Detroit is looking to establish some long-term success after three consecutive last-place finishes in the NFC North.\r\nQuarterback Jared Goff said during his… [+1155 chars]"}, {"label": 5, "content": "The 2021 Formula 1 season kicked off on sensational style in Bahrain courtesy of a two-team race-long fight for victory through Lewis Hamilton and Max Verstappen. There were plenty of other shining l… [+8805 chars]"}, {"label": 5, "content": "That 5th starter situation with the Dodgers seems like such a red wire, blue wire type deal man. Normally, I’d say Dustin May because his stuff is straight up filthy, but having a rotation of Kershaw… [+93 chars]"}, {"label": 5, "content": "The beginning of the NFL draft can sometimes act as a formality; with there being little surprise as to who gets picked at the top of the first round. The San Francisco 49ers trade into the top three… [+2342 chars]"}, {"label": 5, "content": "The U.S. mens national soccer team committed two errors Sunday in a match against Honduras and cost the Americans a spot in the Olympics for the third straight time.\r\nHonduras Juan Carlos Obregon sco… [+1762 chars]"}, {"label": 5, "content": "Sam Darnold‘s short tenure as a starting quarterback in New York seems to be coming to an end, as all signs are pointing toward the Jets selecting Zach Wilson with the second overall pick of the 2021… [+10262 chars]"}, {"label": 5, "content": "We live in a society that loves, and values, points. If you’re an athlete we’d like you to be either high-scoring or high-flying, but we’d prefer both. Stuff a stat sheet and we’re sure to pay attent… [+9813 chars]"}, {"label": 5, "content": "Florida Panthers defender Aaron Ekblad was carried off the ice on a stretcher in a scary scene Sunday as the team defeated the Dallas Stars, 4-1.\r\nEkblad was injured in the second period of the game … [+1142 chars]"}, {"label": 5, "content": "Should Roy Williams and the UNC basketball program reach out to Florida transfer Noah Locke? The junior guard has hit better than 40 percent of his threes over the past three seasons.\r\nThe North Caro… [+3759 chars]"}, {"label": 5, "content": "The Washington Capitals were cruising with a late 4-0 lead and heading to another casual home victory before they decided to throw all of that away and need a fifth goal to seal two points. They got … [+2254 chars]"}, {"label": 5, "content": "During a losing season, tensions run high both inside organizations and out. During the Dallas Cowboys’ 6-10 campaign, things were no different. In early October, they were 1-3 and had almost given u… [+5646 chars]"}, {"label": 5, "content": "Free agency can reveal a lot for NFL teams — weaknesses, strengths, depth issues, an abundance of depth, and if you are the New England Patriots, a change in philosophy from a free-agency watcher to … [+625 chars]"}, {"label": 5, "content": "Despite many experts predicting otherwise, Michigan was the betting favorite to reach the Final Four at the start of the NCAA Tournament. That hasnt changed entering Tuesdays Elite Eight matchup with… [+1030 chars]"}, {"label": 5, "content": "Creighton coach Greg McDermott cringed when he glanced at a halftime box score.\r\nThe Bluejays held Gonzaga first-team All-American Corey Kispert to two first-half points on Sunday, yet they still tra… [+6508 chars]"}, {"label": 5, "content": "SAN ANTONIO -- Texas put the brakes on second-seeded Maryland's high-octane offense, and the Longhorns are rolling into the Elite Eight as the lowest seed still alive in the women's NCAA tournament.\r… [+3624 chars]"}, {"label": 5, "content": "Observations from the Mets’ spring training game Sunday. \r\nNimmo Delivers\r\nBrandon Nimmo smashed his second homer of the spring in the Mets 10-2 loss to the Marlins at Roger Dean Chevrolet Stadium. N… [+706 chars]"}, {"label": 5, "content": "A tradition unlike any other, the Masters tournament at Augusta National is only two weeks away. But like other organizations, Augusta National is finding itself in the middle of a political firestor… [+4237 chars]"}, {"label": 5, "content": "The Boston Celtics could have Evan Fournier back in the lineup for Mondays game at TD Garden against the New Orleans Pelicans, which will also be the first chance for a limited number of fans to be i… [+1434 chars]"}, {"label": 0, "content": "The mysteries of space never cease to amaze us, which is why we're constantly looking towards the galaxies for the next big discovery. Now, there's a new one to learn all about: University of Melbour… [+2239 chars]"}, {"label": 0, "content": "New observations with the European Southern Observatory’s Very Large Telescope (ESO’s VLT) indicate that the rogue comet 2I/Borisov, which is only the second and most recently detected interstellar v… [+10185 chars]"}, {"label": 0, "content": "A severe thunderstorm cloud that formed over the Pacific Ocean in 2018 reached the coldest temperatures ever recorded, according to a new study.\r\nThe very top of the storm cloud reached a bone-chilli… [+2626 chars]"}, {"label": 0, "content": "March 30, 2021\r\n — A former Space Camp counselor and an \"analog astronaut\" whose father tracked Apollo science experiments deployed on the moon have won seats on board the first all-civilian spacefli… [+6098 chars]"}, {"label": 0, "content": "Astronomers have searched the entire Milky Way to identify the safest places to live. It turns out, we're in a pretty good spot. \r\nBut if the past year has made you feel ready to relocate to another … [+4575 chars]"}, {"label": 0, "content": "It’s always fun to look over aerial and satellite maps of places we know, seeing a perspective different from our usual ground level view. We lose that context when it’s a place we don’t know by hear… [+1890 chars]"}, {"label": 0, "content": "The rock got them.\r\nOli Scarff/Getty Images\r\nIf you asked Joe Blow on the street how the dinosaurs became went extinct, he'd mostly likely say an asteroid wiped them out, but the truth is a little mo… [+2174 chars]"}, {"label": 0, "content": "An interdisciplinary team at Monash University discovered a new universal rule of biological growth that explains surprising similarities in the shapes of sharp structures across the tree of life, in… [+3228 chars]"}, {"label": 1, "content": "The people, who spoke on the condition of anonymity to reveal internal deliberations, cautioned that White House officials were still making last-minute adjustments to the plan and that details were … [+6025 chars]"}, {"label": 1, "content": "HARRISBURG, Pa. —Pennsylvania Gov. Tom Wolf gave an update on COVID-19 vaccination efforts across the Commonwealth Tuesday afternoon.\r\nTap the video player above to watch a replay of Wolf's update.\r\n… [+1464 chars]"}, {"label": 1, "content": "Los Angeles and Orange counties have passed a new marker on what they hope is a return to normalcy from the coronavirus, clearing the way for them to further relax restrictions on businesses and acti… [+5860 chars]"}, {"label": 1, "content": "More lawsuits have been filed against Deshaun Watson this week, as ESPN.com’s Sarah Barshop details. This latest round of suits includes one alleging that Watson is deleting Instagram messages and co… [+1270 chars]"}, {"label": 1, "content": "UConn womens basketball coach Geno Auriemma was unconcerned about the late no-call at the end of his teams victory over Baylor in their NCAA Tournament matchup on Monday night.\r\nWhile it appeared Bay… [+1524 chars]"}, {"label": 1, "content": "WASHINGTON Civil rights groups have now filed at least three legal challenges to Georgia's newly enacted law changing state election procedures, putting it to the courts to decide if the law's passag… [+5125 chars]"}, {"label": 1, "content": "Updated with L.A. County cleared to move to 50% capacity at cinemas:Unlike Easter last year, we’re actually going to be able to go to the movies this weekend.\r\nWith drive-ins solely operating in the … [+4458 chars]"}, {"label": 1, "content": "Canada and three German cities are no longer recommending the AstraZeneca COVID-19 vaccine to young people amid reports the inoculation is causing serious blood clots in some recipients, reports and … [+2700 chars]"}, {"label": 1, "content": "Financial markets remained somewhat volatile on Tuesday as investors surveyed the damage wrought by the failure of hedge fund Archegos Capital Management, an event that, along with the drama surround… [+5481 chars]"}, {"label": 1, "content": "They protect against infections, not just symptoms\r\nPhoto by Spencer Platt / Getty Images\r\nThree months after the United States COVID-19 vaccination campaign began, researchers are starting to collec… [+3809 chars]"}, {"label": 1, "content": "A Virginia man is rebounding from a days-long hospital stay after suffering a severe skin reaction to what his doctors believe was the Johnson &amp; Johnson COVID-19vaccine. Richard Terrell has since… [+3625 chars]"}, {"label": 1, "content": "BERLINA press release published on the website of Volkswagen AGs U.S. subsidiarys Tuesday said the company will rebrand itself as Voltswagen of America to emphasize its multibilliondollar drive to tr… [+569 chars]"}, {"label": 1, "content": "We're mere days away from the 2021 Major League Baseball season, which means it's time for predictions. Our Eye on Baseball team will lay out our predictions for order of finish by division here alon… [+553 chars]"}, {"label": 1, "content": "Game of Thrones is headed to Broadway.\r\nA dramatic stage show spectacular based on George R.R. Martins fantasy world is now in development, The Hollywood Reporter has learned exclusively.\r\nThe play i… [+6726 chars]"}, {"label": 1, "content": "With the first wave of free agency behind us and the 2021 NFL Draft less than a month away, how does our latest 2021 First Round NFL Mock Draft shape up heading into April? Following the trades at th… [+8003 chars]"}, {"label": 1, "content": "Rep. Matt Gaetz (R-Fla.) has privately told confidants he's seriously considering not seeking re-election and possibly leaving Congress early for a job at Newsmax, three sources with direct knowledge… [+1659 chars]"}, {"label": 1, "content": "By Reuters Staff\r\n(Reuters) -An uncrewed SpaceX Starship prototype rocket failed to land safely on Tuesday after a test launch from Boca Chica, Texas, and engineers were investigating, SpaceX said.\r\n… [+1621 chars]"}, {"label": 1, "content": "The Dow Jones Industrial Average fell 100 points, while tech stocks stumbled, as Treasury yields jumped to new highs Tuesday. Apple and Tesla stock opened sharply lower, while Dow giant Boeing is in … [+5575 chars]"}, {"label": 1, "content": "A severe thunderstorm cloud that formed over the Pacific Ocean in 2018 reached the coldest temperatures ever recorded, according to a new study.\r\nThe very top of the storm cloud reached a bone-chilli… [+2626 chars]"}, {"label": 1, "content": "A special courtroom in Lamezia Terme, Calabria, shown on Jan. 13, as more than 350 alleged members of Calabria's 'Ndrangheta organized crime group and their associates went on trial. One alleged memb… [+3715 chars]"}, {"label": 1, "content": "March 30, 2021\r\n — A former Space Camp counselor and an \"analog astronaut\" whose father tracked Apollo science experiments deployed on the moon have won seats on board the first all-civilian spacefli… [+6098 chars]"}, {"label": 1, "content": "The trial of Derek Chauvin, the ex-Minneapolis police officer charged in George Floyds death, is resuming Tuesday with further testimony from an MMA fighter who witnessed Floyds arrest.\r\nDonald Willi… [+4792 chars]"}, {"label": 1, "content": "Just like last year\r\nApple just announced that its Worldwide Developers Conference (WWDC) will take place on June 7th through June 11th this year, and that like last year it will be an online-only ev… [+1723 chars]"}, {"label": 1, "content": "Enlarge/ Our test rig is a little more unlovely than usual, due to Asus' decision to entomb the CPU socket in surrounding high-rise heatsinks, with the system's RAM closing in just as tightly from th… [+7042 chars]"}, {"label": 1, "content": "Technology today is already quite assistive, from location-aware reminders to notifications telling you when to leave, factoring in live traffic conditions. In fact, that’s now the base level of usef… [+10777 chars]"}, {"label": 1, "content": "Members of the district councils the only fully democratic body in Hong Kong will be excluded from the committee that selects Hong Kongs chief executive.\r\nThis is shocking and difficult to comprehend… [+3792 chars]"}, {"label": 1, "content": "Amid growing fears of a fourth wave of U.S. Covid-19 cases, government officials urged Americans to continue taking precautions to prevent the spread of the virus.\r\nDuring a press conference on Monda… [+2207 chars]"}, {"label": 1, "content": "Judge Ketanji Brown Jackson is seen as a possible Supreme Court justice, should a vacancy arise in the Biden years.\r\nU.S. District Court, District of Columbia\r\nKetanji Brown Jackson, nominated Tuesda… [+6154 chars]"}, {"label": 1, "content": "Astronomers have searched the entire Milky Way to identify the safest places to live. It turns out, we're in a pretty good spot. \r\nBut if the past year has made you feel ready to relocate to another … [+4575 chars]"}, {"label": 1, "content": "Swatch will own the One More Thing trademark in the UK, despite the fact that it achieved its current fame through Steve Jobs’s use of it in Apple keynote presentations.\r\nApple failed to persuade a c… [+2247 chars]"}, {"label": 1, "content": "Everyone 16 and older in California will be eligible to get the coronavirus vaccine starting April 15. Individuals who are 50 and older will get a head start on Thursday, April 1.In the Bay Area, Con… [+2961 chars]"}, {"label": 1, "content": "Oscars 2021Concerns over inclusivity for non-US-based nominees and those who are vulnerable or shielding to be raised with show producers in Tuesday summit\r\nProducers for this years Oscars ceremony a… [+2248 chars]"}, {"label": 1, "content": "New details of his Jan. 20 arrest were revealed this week in court documents as prosecutors urged a judge not to release him before his trial, noting that he allegedly admitted to bringing a gun into… [+3816 chars]"}, {"label": 2, "content": "STANISLAUS COUNTY, Calif. —Stanislaus County officials announced Tuesday that county residents 16 years old and up will be eligible for COVID-19 vaccines starting April 1.\r\nThe announcement comes aft… [+1796 chars]"}, {"label": 2, "content": "HARRISBURG, Pa. —Pennsylvania Gov. Tom Wolf gave an update on COVID-19 vaccination efforts across the Commonwealth Tuesday afternoon.\r\nTap the video player above to watch a replay of Wolf's update.\r\n… [+1464 chars]"}, {"label": 2, "content": "They protect against infections, not just symptoms\r\nPhoto by Spencer Platt / Getty Images\r\nThree months after the United States COVID-19 vaccination campaign began, researchers are starting to collec… [+3809 chars]"}, {"label": 2, "content": "A Virginia man is rebounding from a days-long hospital stay after suffering a severe skin reaction to what his doctors believe was the Johnson &amp; Johnson COVID-19vaccine. Richard Terrell has since… [+3625 chars]"}, {"label": 2, "content": "Students stand for the Pledge of Allegiance as they return to in-person learning at St. Anthony Catholic High School in California on March 24. Masks and physical distancing are proving to have some … [+5114 chars]"}, {"label": 2, "content": "No deaths from the flu have been reported in Washington state during the 2020-2021 season, according to data from the state health department. \r\nFlu activity in the state is considered low, according… [+2131 chars]"}, {"label": 2, "content": "Edward Campbell, a microbiologist at Loyola University, started SafeGuard after learning of a virus test developed by researchers at the University of Wisconsin-Madison. SafeGuard serves about 30 sch… [+1576 chars]"}, {"label": 2, "content": "DES MOINES, Iowa —Iowas 7-day COVID-19 positivity rate is back up to 5% as rates have been slowly rising in the state over the last week.\r\nThe Iowa Department of Public Health on Tuesday reported 654… [+1314 chars]"}, {"label": 2, "content": "Coronavirus cases continue to rise across the United States, fueling fears of a fourth wave as officials urge Americans to keep following public health measures.\r\nOn Monday, the U.S. recorded 69,417 … [+7005 chars]"}, {"label": 2, "content": "DEAR DR. ROACH: I have had over 50 vaccinations in my life (Im 78), most of them while I was in the military. I have often wondered how the vaccine spreads throughout the body, as the shots are almos… [+3487 chars]"}, {"label": 2, "content": "Women who are exposed to industrial chemicals while pregnant, including metals and pesticides, are more likely to have autistic children, according to a new study.  \r\nSimon Fraser University research… [+4778 chars]"}, {"label": 2, "content": "ST. LOUIS It's become part of our new pandemic vocabulary, but what exactly is \"herd immunity?\"\r\nDefined by the CDC as when a high percentage of the community is immune to a disease (through vaccinat… [+1838 chars]"}, {"label": 2, "content": "A surge in coronavirus cases in Michigan is being fueled by a spike in cases among younger age groups.\r\n\"Right now, we are seeing a much younger population coming in, and by younger we mean maybe 40s… [+1502 chars]"}, {"label": 2, "content": "Nope, its not just youor your imagination. Stress-induced hair loss has risen in the past year. (According to Google, the average number of searches on the topic surpasses 829,000 times a month in th… [+6854 chars]"}, {"label": 2, "content": "If you get the COVID-19 vaccine, you also get an important souvenir, a vaccine card. But what happens if you lose it?The two-shot COVID-19 vaccine requires people to wait three to four weeks between … [+1330 chars]"}, {"label": 2, "content": "Scientists have discovered an Israeli coronavirus variant, and believe there are hundreds of cases of the mutation in the north, south and center of the country but they dont believe it poses a chall… [+2548 chars]"}, {"label": 2, "content": "Syrian President Bashar al-Assad and his wife, Asma, have recovered from Covid-19 and are no longer symptomatic, the president's office said in a statement on Tuesday.\r\nAssad's office said in a state… [+892 chars]"}, {"label": 2, "content": "It's a race against the COVID-19 vaccines and the variants, and you're reading a ton of information about coronavirus and what to do while we're in an active pandemic. Some of what you've heard is sp… [+29513 chars]"}, {"label": 2, "content": "(CNN)To get more Black people vaccinated against coronavirus infections, Dr. Kimberly Manning is determined to keep doing what she has had a conviction to do since before the pandemic hit. \r\n\"I'm det… [+9813 chars]"}, {"label": 2, "content": "The stereotype of a cannabis smoker is one of a laid back, lackadaisical, sloth-like individual who is trapped in a lethargic stupor, with exercise far from their mind. \r\nBut a new study from researc… [+6737 chars]"}, {"label": 2, "content": "PHILADELPHIA (CBS) — New concerns as COVID-19 variants are linked to more infections in the Philadelphia region. Troubling mutations, such as those from Brazil and South Africa are more contagious an… [+2382 chars]"}, {"label": 2, "content": "For the remainder of 2021, anyone who shows their COVID-19 vaccination card at Krispy Kreme will receive a free original glazed donut.\r\nUSA TODAY\r\nSoon after the Pfizer/BioNTech and Moderna COVID-19 … [+8589 chars]"}, {"label": 2, "content": "COVID-19 variants are surging in America and scientists are learning the vaccine may not work as well against them.\r\nUSA TODAY\r\nAs COVID-19 cases creep up again across the country, federal officials … [+7081 chars]"}, {"label": 2, "content": "CanadaSpasms, memory loss and hallucinations among symptoms of 43 patients in Acadian region of New Brunswick province\r\nTue 30 Mar 2021 11.00 BST\r\nDoctors in Canada are concerned they could be dealin… [+4909 chars]"}, {"label": 2, "content": "A shrinking percentage of Americans are expressing reluctance to get a Covid-19 vaccine, a positive sign for the efforts to get shots in the arms of enough people to reach herd immunity.\r\nThe finding… [+1196 chars]"}, {"label": 2, "content": "Dialysis clinics are often located in areas that are underserved by other forms of health care. And many already vaccinate their patients againstother illnesses.\r\nBruno Maccanti Pescador/Getty Images… [+4524 chars]"}, {"label": 2, "content": "The nation’s top public health authority warned of “impending doom” for the United States, and President Biden implored states to reinstate mask mandates on Monday, amid signs that a fourth wave of t… [+5874 chars]"}, {"label": 2, "content": "Biting into something cold with a damaged or sensitive tooth can trigger a particularly excruciating type of pain, but scientists have never fully understood how this pain signal gets transmitted. No… [+3303 chars]"}, {"label": 2, "content": "In February, the California Department of Fish and Wildlife began getting calls about a small black bear that was showing up in Pollock Pines in El Dorado County, slow to move and with little fear of… [+3040 chars]"}, {"label": 2, "content": "A week after opening up coronavirus vaccine appointments to residents and workers ages 50 and older, Contra Costa County officials are already planning to dramatically expand the eligible age group s… [+2304 chars]"}, {"label": 2, "content": "Then theres cancer. Scientists may never devise a single vaccine for cancer, because cancer is not a single disease but a constellation of more than 100 maladies, which we usually name for the place … [+1700 chars]"}, {"label": 3, "content": "Tesla is building a new Tesla Semi production line at a new building near its Gigafactory Nevada plant, and it plans to produce five electric trucks per week, according to sources familiar with the m… [+2474 chars]"}, {"label": 3, "content": "Commercial spaceflight company Virgin Galactic unveiled the piloted space plane \"VSS Imagine\" on Tuesday. \r\nThe spacecraft's release marks the first of Virgin Galactic's next-generation SpaceShip III… [+3047 chars]"}, {"label": 3, "content": "SpaceXCEO Elon Musk is giving back to Cameron County, Texas, home of the aerospace company's Boca Chica launch site, and the nearby city of Brownsville.\r\nMusk announced on Twitter that he would be do… [+3266 chars]"}, {"label": 3, "content": "Canada and three German cities are no longer recommending the AstraZeneca COVID-19 vaccine to young people amid reports the inoculation is causing serious blood clots in some recipients, reports and … [+2700 chars]"}, {"label": 3, "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+3586 chars]"}, {"label": 3, "content": "Financial markets remained somewhat volatile on Tuesday as investors surveyed the damage wrought by the failure of hedge fund Archegos Capital Management, an event that, along with the drama surround… [+5481 chars]"}, {"label": 3, "content": "Many tech workers say they have experienced more harassment, hostility and anxiety while working remotely during the pandemic.\r\nWilfredo Lee/AP\r\nTech workers say they have experienced more harassment… [+3638 chars]"}, {"label": 3, "content": "Cisco has taken a big step forward with its first network-as-a-service offering that ultimately will let customers buy enterprise-network hardware and software components on an as-needed basis.\r\nThe … [+8031 chars]"}, {"label": 3, "content": "As the Bitcoin (BTC) price edges closer to $59,000, its value relative to gold is approaching new all-time highs, possibly hinting at the emergence of a new preferred store of value.\r\nMeasured agains… [+2608 chars]"}, {"label": 3, "content": "The startup behind online service Cameo tripled its valuation to more than $1 billion after raising more capital, reflecting the hot market for platforms that help celebrities and content creators ma… [+1610 chars]"}, {"label": 3, "content": "Theres nothing \"crypto\" about the value of burritos.\r\nWhen a holiday like National Burrito Day comes along, its pretty obvious that a chain like Chipotle is going to get in on the celebration. Of cou… [+2371 chars]"}, {"label": 3, "content": "U.S. home prices grew at their fastest pace in seven years in January as supply plummeted to a new low.\r\nMORTGAGE REFINANCE INCENTIVES NO MORE\r\nThe Case Shiller 20-city index posted an 11.1% year-ove… [+2705 chars]"}, {"label": 3, "content": "By Reuters Staff\r\n(Reuters) -An uncrewed SpaceX Starship prototype rocket failed to land safely on Tuesday after a test launch from Boca Chica, Texas, and engineers were investigating, SpaceX said.\r\n… [+1621 chars]"}, {"label": 3, "content": "Videogame retailer GameStop Corp. \r\n GME,\r\n +9.84%\r\nsaid Tuesday it has appointed former Amazon executive Elliott Wilke to the role of chief growth officer effective April 5. Wilke has held a range o… [+1016 chars]"}, {"label": 3, "content": "The Dow Jones Industrial Average fell 100 points, while tech stocks stumbled, as Treasury yields jumped to new highs Tuesday. Apple and Tesla stock opened sharply lower, while Dow giant Boeing is in … [+5575 chars]"}, {"label": 3, "content": "The National Labor Relations Board has rejected Amazon's request to install a video camera to keep an eye on boxes containing thousands of ballots key to a high-stakes union election in Alabama.\r\nThe… [+3443 chars]"}, {"label": 3, "content": "The automaker is renaming its North American division\r\nVolkswagen is changing the name of its American brand to Voltswagen, in a not-so-subtle nod to the German automakers multibillion-dollar effort … [+2761 chars]"}, {"label": 3, "content": "JPMorgan Chase &amp; Co., Salesforce.com Inc. and PricewaterhouseCoopers are among the major firms looking to unload big blocks of office space, the latest sign that remote work is hurting demand for… [+5057 chars]"}, {"label": 3, "content": "Another day, another partnership\r\nVolvo is partnering with self-driving startup Aurora on a new lineup of fully autonomous semi trucks, the companies announced. The trucks will be deployed in North A… [+3422 chars]"}, {"label": 3, "content": "CVS has expanded locations offering the COVID-19 vaccine in Michigan.\r\nAs of 9 a.m. on Tuesday, March 30 -- appointments were available at several locations across the state, including Detroit, Frase… [+1739 chars]"}, {"label": 3, "content": "Arguably the most controversial on the Street, penny stocks are a hot-button issue. Usually, there isnt a lot of middle-ground with respect to these tickers priced for less than $5 apiece. Dividing m… [+7343 chars]"}, {"label": 3, "content": "Based on data compiled by Credible Operations, Inc., NMLS Number 1681276, mortgage rates have risen slightly since yesterday.\r\n<ul><li>30-year fixed mortgage rates: 3.125%, Unchanging</li><li>20-year… [+6485 chars]"}, {"label": 3, "content": "Dapper Labs, the startup behind virtual trading-card platform NBA Top Shot, has closed a $305 million funding round as the market for digital collectibles continues to boom, the company announced Tue… [+2455 chars]"}, {"label": 3, "content": "The pandemic dramatically changed the travel and credit card landscape last year. As a result, Chase rapidly made adjustments as cardholders shifted their spending habits and priorities.\r\nOne of thes… [+5132 chars]"}, {"label": 3, "content": "CUPERTINO — Target will close two Bay Area stores in late June following a wide-ranging review of all of the company’s stores, the retailing giant said Tuesday.\r\nAn estimated 75 people work at the Ta… [+1346 chars]"}, {"label": 3, "content": "To focus on live music, cultural, and sports conversations\r\nPhoto by Michele Doying / The Verge\r\nSpotify has invested heavily in prerecorded podcast content, and now, the company is looking to host l… [+2724 chars]"}, {"label": 3, "content": "It is no secret: NFTs are helping to destroy our planet. That Beeple sale not only racked up $69.3m, it also generated an eye-watering 78,597kg of CO emissionsthe same amount of electricity used by m… [+8290 chars]"}, {"label": 3, "content": "By Maayan Lubell\r\nJERUSALEM (Reuters) - A new coronavirus strain has been identified in Israel, the Health Ministry said on Tuesday, and the Pfizer/BioNTech vaccine, used primarily in a swift nationw… [+2021 chars]"}, {"label": 3, "content": "(CBS4) – As more people get vaccinated, doctors are learning about new and unusual side effects. CBS4 Medical Editor Dr. Dave Hnida said they are related to a response from the body’s immune system d… [+2601 chars]"}, {"label": 3, "content": "The buyer of the $69 million NFT by the artist Beeple said he was prepared to bid even higher, since it will be seen by history as the starting point of a new age of digital art.\r\nIn his first televi… [+3049 chars]"}, {"label": 3, "content": "More than a dozen states aren't offering a new tax break on unemployment benefits.\r\nThat means taxpayers will need to pay state tax on benefits they received last year, absent any forthcoming changes… [+3723 chars]"}, {"label": 3, "content": "Many of LinkedIns newest features makes it feel less like a job-seeking platform and even more like Instagram. But that seems to be what its going for.\r\nThe company today announced that LinkedIn prof… [+1474 chars]"}, {"label": 3, "content": "The UK government has restated it is considering \"all options\" to keep Liberty Steel's UK plants and jobs afloat, including nationalisation.\r\nOn Sunday, the government rejected a request for £170m in… [+4220 chars]"}, {"label": 3, "content": "The points game is one of strategy. You want to pick loyalty programs that earn the types of rewards you can get the most use out of, and obtain the associated credit cards that offer earning rates a… [+14940 chars]"}, {"label": 3, "content": "DraftKings has acquired VSiN, The Post has learned.\r\nVSiN (Vegas Sports Information Network) began in 2017 with designs on delivering trusted betting information across different platforms. After fou… [+850 chars]"}, {"label": 3, "content": "Lilium's five-seater air taxi, the Lilium Jet, can be seen flying at an airfield in southern Germany in new footage released by the firm.\r\nGerman aviation start-up Lilium has agreed to go public thro… [+4068 chars]"}, {"label": 3, "content": "GUANGZHOU, China Chinese smartphone giant Xiaomi has announced plans to launch an electric vehicle business and invest $10 billion over the next 10 years.\r\nThe company will set up a wholly-owned subs… [+1135 chars]"}, {"label": 3, "content": "Midwestern Pet Foods is recalling a lengthy list of dog and cat food brands potentially contaminated with salmonella, posing a possible health risk to animals as well as to the humans feeding them.\r\n… [+1933 chars]"}, {"label": 3, "content": "Quantum computing has been positioned as a revolutionary tool for healthcare that can help with everything from clinical trials to disease registries to electronic health records. Now more than ever,… [+2647 chars]"}, {"label": 3, "content": "While we wait for Mercedes-Benz to unveil its 2022 EQS luxury EV sedan on April 15th, the automaker has given us the first detailed look at the interior. As we learned recently, the EQS will feature … [+1828 chars]"}, {"label": 3, "content": "Kia has unveiled today the Kia EV6, an electric crossover based on the Hyundai E-GMP platform, and the specs are basically the same as the recently unveiled Ioniq 5, but in a different package.\r\nLast… [+3793 chars]"}, {"label": 3, "content": "Lexus is planning to introduce 20 new or redesigned vehicles globally by 2025, at least half of which executives say will be all-electric or electrified hybrid models.\r\nTo symbolize the direction of … [+1361 chars]"}, {"label": 3, "content": "The U.S. 10-year Treasury yield topped 1.77% on Tuesday, as coronavirus vaccine rollouts and planned infrastructure spending boosted expectations of a broad economic recovery and rising inflation.\r\nT… [+2325 chars]"}, {"label": 3, "content": "Emmarie HuettemanA new poll of attitudes toward covid vaccinations shows Americans are growing more enthusiastic about being vaccinated, with the most positive change in the past month occurring amon… [+4959 chars]"}, {"label": 3, "content": "(CNN) Right now, a lot of us can't even fly out of our own countries, but if Florida-based planemakers Aerion are to be believed, by the end of the decade we'll be able to jet between Los Angeles and… [+5519 chars]"}, {"label": 3, "content": "Finding an extra $10 charge on your groceries is enough to make most people angry, but what if you paid twice for a a $56,000 car? Tesla buyers have been reporting that they've been double-charged on… [+1517 chars]"}, {"label": 3, "content": "T-Mobile's TV streaming services won't look the same after April 29th: The carrier has announced that it's expanding its collaboration with Google across its products, including TVision. The original… [+2075 chars]"}, {"label": 3, "content": "Photos of the five men killed in a mountainside helicopter crash in Alaska emerged Monday as investigators worked to piece together what caused the horrific wreck.\r\nAmong the dead was Czech Republics… [+1656 chars]"}, {"label": 3, "content": "HONOLULU, Hawaii (HawaiiNewsNow) - As coronavirus cases rise on Oahu, some fear it means falling back into Tier 2 restrictions. Mayor Blangiardi has said thats not an option. \r\nLindsey Dymond, Kalapa… [+1574 chars]"}, {"label": 3, "content": "Index provider FTSE Russell gave final approval on Monday for inclusion of Chinese sovereign bonds in its flagship bond index, starting later this year, setting the stage for billions of dollars of i… [+2329 chars]"}, {"label": 4, "content": "Dancing With the Stars has tangoed right out of its twenties: The ABC competition series will be back for a milestone 30th season, TVLine has learned.\r\nTyra Banks, who took over as host for Season 29… [+1465 chars]"}, {"label": 4, "content": "Quavo and Saweetie's issues appear to run much deeper than alleged infidelity because they had a fight in an elevator -- before they split -- and the altercation was all captured on video.\r\nTMZ obtai… [+1242 chars]"}, {"label": 4, "content": "Here they are! \r\nAaron Rodgers and Shailene Woodley were pictured for the first time together since news of their relationship leaked earlier this year. The Green Bay Packers quarterback, 37, and Big… [+1443 chars]"}, {"label": 4, "content": "What could possibly connect rapper Lil Nas X, shoe company Nike and ... sneakers made with human blood? Strap in for a brief explanation of one of 2021's most unusual and colorful news stories.\r\nThe … [+5586 chars]"}, {"label": 4, "content": "Updated with L.A. County cleared to move to 50% capacity at cinemas:Unlike Easter last year, we’re actually going to be able to go to the movies this weekend.\r\nWith drive-ins solely operating in the … [+4458 chars]"}, {"label": 4, "content": "HomeTheaterBroadway: “Diana,” the Musical That Won’t Go Away, Going First to Netflix...\r\nPrincess Diana always went her own way. Her musical is following suit.\r\n“Diana The Musical” almost opened a ye… [+503 chars]"}, {"label": 4, "content": "Sharon Stone revealed that a plastic surgeon she went to ended up giving her larger breast implants than she originally consented to.\r\nThe 63-year-old \"Basic Instinct\" actress wrote about the experie… [+2309 chars]"}, {"label": 4, "content": "“Jeopardy!” ratings dropped another 5% in Katie Couric’s second week as guest host, falling behind “Family Feud” to finish second for the first time since Alex Trebek’s last episodes.\r\n“Jeopardy!” fi… [+1720 chars]"}, {"label": 4, "content": "The latest animated Star Wars series is just a few weeks away from hitting Disney+, and Lucasfilm has offered a deeper look at what to expect from Star Wars: The Bad Batch. The action-packed trailer … [+699 chars]"}, {"label": 4, "content": "Rachel Bilson and Rami Malek have apparently been involved in some drama thats straight out of a high school yearbook.\r\nThe former star of The O.C. sat down with Dax Shepard and Monica Padman on a re… [+2487 chars]"}, {"label": 4, "content": "Seth Rogen would like to set the record straight once and for all: Emma Watson didnt storm off the set of his movie This Is the End.\r\nThe actor and comedian attempted to clarify the longstanding rumo… [+3174 chars]"}, {"label": 4, "content": "Jason Derulo is having a baby boy!\r\nThe \"Take You Dancing\" singer, 31, is currently expecting his first child with girlfriend Jena Frumes, they announced over the weekend, and now, the pair reveal ex… [+1940 chars]"}, {"label": 4, "content": "Game of Thrones is headed to Broadway.\r\nA dramatic stage show spectacular based on George R.R. Martins fantasy world is now in development, The Hollywood Reporter has learned exclusively.\r\nThe play i… [+6726 chars]"}, {"label": 4, "content": "No one could have ever imagined that Zack Snyder's Justice League would actually happen —not even Snyder himself. But after the director's early exit from the original Justice League production due t… [+2850 chars]"}, {"label": 4, "content": "William Shatner has been announced for the Celebrity Wing of the WWE Hall of Fame.WWE and USA Today made the announcement this morning. It was noted that Shatner is being inducted into the 2020 Class… [+3255 chars]"}, {"label": 4, "content": "Angelina Jolie was out yesterday with Vivienne. They went to FOREVER 21 which yeah of course they did. Vivienne is 12 years old. And even though shes the child of celebrities, it doesnt mean she does… [+1734 chars]"}, {"label": 4, "content": "In time, all good things must come to an end, and in American Godscase, that time came at some point after the first season finale when Bryan Fuller and Michael Green, American Gods original showrunn… [+1679 chars]"}, {"label": 4, "content": "Refurbishments and reimaginings currently abound at Walt Disney World. Let's have a little fun and engage in some amateur Imagineering! Below are three themes with a rich legacy in the world of Disne… [+5809 chars]"}, {"label": 4, "content": "Last week, Walt Disney Studios announced a flurry of release date changes for its upcoming film slate, kicking a number of premium titles down the road as COVID-19-stricken movie theaters slowly reop… [+7092 chars]"}, {"label": 4, "content": "Kim then tweeted, \"They clearly spoke so I let you all see that. Nobody ever denied the word 'bitch' was used without her permission.\" She also claimed, \"At the time when they spoke the song had not … [+1305 chars]"}, {"label": 4, "content": "From Marie Claire\r\nSounds like the Middletons are starting to speak publicly about Prince Harry and Meghan Markles Oprah interview. And by that, I mean Kates uncle Gary Goldsmith has spoken out about… [+1625 chars]"}, {"label": 4, "content": "WWE and NBCUniversal have signed a new multi-year deal that will keep NXT on USA Network. In addition, NXT will be moving from Wednesday to Tuesday nights beginning April 13.\r\nSpeaking with Variety, … [+2137 chars]"}, {"label": 4, "content": "HBO Max\r\nHave you ever wondered about the daily grind of a movie star? Curious what it’s like to run multiple businesses that you don’t *actually* run? Want to know about the struggles of being an in… [+1691 chars]"}, {"label": 4, "content": "\"Killing Eve\" star Sandra Oh said she's \"proud to be Asian\" while addressing a crowd at a \"Stop Asian Hate\" protest in Oakland, Pittsburgh.\r\nStoryful\r\nKat Ahn, a guest actress on the \"Benihana Christ… [+4574 chars]"}, {"label": 4, "content": "Virginia Beach, Va. — Musician Pharrell Williams said he had a relative killed by police in Virginia beach, Virginia last weekend.\r\nOn Twitter, Williams wrote that his cousin Donovan Lynch was killed… [+645 chars]"}, {"label": 4, "content": "Brooke Shields has shared a series of snaps of herself getting hospital treatment after breaking her right femur in an accident at a New York City gym in January.\r\nThe actress, 55, took to Instagram … [+5202 chars]"}, {"label": 4, "content": "Oscars 2021Concerns over inclusivity for non-US-based nominees and those who are vulnerable or shielding to be raised with show producers in Tuesday summit\r\nProducers for this years Oscars ceremony a… [+2248 chars]"}, {"label": 4, "content": "The Apollon Gallery at the Louvre museum in Paris on Jan. 14, 2020.\r\nStephanie de Sakutin/AFP via Getty Images\r\nOne of the world's most massive museums has announced an encompassing digitization of i… [+3660 chars]"}, {"label": 4, "content": "Kelly Clarkson has been a regular coach on The Voice since 2018 never sitting out a season, and becoming such a crucial cast member (and threat to Blake Shelton) that she eventually ended up sitting … [+7907 chars]"}, {"label": 4, "content": "SPOILER ALERT: The following article contains details about the Season 2 finale of TNT’s Snowpiercer.\r\nTonight’s two-part Snowpiercer finale brought key characters through a number of major turns, bo… [+11632 chars]"}, {"label": 4, "content": "Miranda Lambert has fond memories with her ex-husband Blake Shelton.\r\nThe 37-year-old country songstress recently appeared on Apple Music's \"Essentials Radio\" for an interview with Kelleigh Bannen, i… [+2452 chars]"}, {"label": 4, "content": "Amy Schumer sat at the bedside of her father in an image shared to Instagram as he was hospitalised on Monday evening.\r\nThe actress, 39, revealed Gordon was in an 'unfortunate magician sawing acciden… [+2206 chars]"}, {"label": 4, "content": "As WWE champion Bobby Lashley and challenger Drew McIntyre head toward their WrestleMania 37 showdown, the intensity has continued to ratchet up. That continued Monday night on WWE Raw, a show that s… [+5471 chars]"}, {"label": 4, "content": "American Idol is really starting to narrow the field. Monday's new episode saw the judges round out their choices for the Top 24.\r\nStarting the Showstopper round with 64 contestants, the judges -- in… [+2527 chars]"}, {"label": 5, "content": "Quarterback Justin Fields ran the 40-yard dash in an unofficial time of 4.44 seconds at the Ohio State Buckeyes' pro day Tuesday.\r\nThe 6-foot-3, 228-pound player, widely expected to be a first-round … [+1321 chars]"}, {"label": 5, "content": "The New York Mets have offered a deal close to 10 years and $325 million to All-Star shortstop Francisco Lindor as the two sides continue to work toward an agreement for a contract extension, Andy Ma… [+2850 chars]"}, {"label": 5, "content": "Perhaps Chuck Fletcher has had enough with the Flyers' maddening March.\r\nIf this is his way of sending a message to his roster, it should be received.\r\nThe general manager placed Shayne Gostisbehere … [+2753 chars]"}, {"label": 5, "content": "Austin Gayle of Pro Football Focus recently released his two-round mock draft and predicts the New York Giants will dip into a familiar pool to upgrade their 31st-ranked offense this April.\r\nDespite … [+1936 chars]"}, {"label": 5, "content": "More lawsuits have been filed against Deshaun Watson this week, as ESPN.com’s Sarah Barshop details. This latest round of suits includes one alleging that Watson is deleting Instagram messages and co… [+1270 chars]"}, {"label": 5, "content": "UConn womens basketball coach Geno Auriemma was unconcerned about the late no-call at the end of his teams victory over Baylor in their NCAA Tournament matchup on Monday night.\r\nWhile it appeared Bay… [+1524 chars]"}, {"label": 5, "content": "The 2021 NFL Draft presents a unique challenge this year. Not only was there no NFL Combine to help evaluate players both on the field and on it, but many players in this years class have limited tap… [+2129 chars]"}, {"label": 5, "content": "The Buccaneers have spent first part of the offseason bringing back as many members of their Super Bowl LV-winning squad as they can, but there’s one notable free agent still out there as March comes… [+658 chars]"}, {"label": 5, "content": "The Panthers might not be able to get their hands on BYU quarterback Zach Wilson, but they did find something interesting in Utah.\r\nThe Panthers signed wide receiver Micah Simon, who was part of Wils… [+30 chars]"}, {"label": 5, "content": "The U.S. Olympic and Paralympic Committee will not sanction athletes for raising their fists or kneeling during the national anthem at Olympic trials, previewing a contentious policy it expects to st… [+3357 chars]"}, {"label": 5, "content": "Steph Curry knows Baron Davis' mindset, and, of course, has great respect for the former Warriors guard.\r\nBut Curry also was the focal point of the greatest collection of talent in NBA history. The g… [+2169 chars]"}, {"label": 5, "content": "Story Links\r\nThis week's Nebraska vs. Penn State volleyball matches at the Bob Devaney Sports Center have been canceled. The decision was mutually agreed upon out of an abundance of caution surroundi… [+739 chars]"}, {"label": 5, "content": "LAS VEGAS They hadnt yet pulled Stipe Miocic off the canvas at Apex on Saturday when the Jon Jones tweet storm began.\r\nThe former light heavyweight champion was tweeting about Francis Ngannous second… [+5064 chars]"}, {"label": 5, "content": "The Steelers signed running back Kalen Ballage and offensive lineman Rashaad Coward to one-year contracts on Tuesday. \r\nBallage enters his fourth season in the NFL after being drafted by the Miami Do… [+1083 chars]"}, {"label": 5, "content": "We're mere days away from the 2021 Major League Baseball season, which means it's time for predictions. Our Eye on Baseball team will lay out our predictions for order of finish by division here alon… [+553 chars]"}, {"label": 5, "content": "With the first wave of free agency behind us and the 2021 NFL Draft less than a month away, how does our latest 2021 First Round NFL Mock Draft shape up heading into April? Following the trades at th… [+8003 chars]"}, {"label": 5, "content": "The Cleveland Browns certainly would prefer to forget the Hue Jackson era, yet the front office apparently wasn't looking to put it behind them even in the midst of one of the worst seasons in NFL hi… [+1673 chars]"}, {"label": 5, "content": "GAINESVILLE, Fla. -- A fourth Florida basketball player has entered the NCAA transfer portal following a Round of 32 exit from the NCAA Tournament for the Gators.\r\nForward Omar Payne has joined three… [+3448 chars]"}, {"label": 5, "content": "Miami Heat guard Victor Oladipo was unable to play in the teams 98-88 win over the New York Knicks on Monday night, but he was still fired up when the team snapped its six-game losing streak.\r\nBig Ti… [+701 chars]"}, {"label": 5, "content": "Speculation has run rampant on who the San Francisco 49ers will select with the No. 3 overall pick in the 2021 NFL Draft, days after they traded up from No. 12 in the likely pursuit of a quarterback.… [+1996 chars]"}, {"label": 5, "content": "The Packers are re-signing DT Tyler Lancaster, a source said. He was a restricted free agent but wasnt originally tendered.\r\n— Rob Demovsky (@RobDemovsky) March 30, 2021\r\nThe Green Bay Packers are br… [+957 chars]"}, {"label": 5, "content": "The Red Sox announced a series of roster moves Tuesday as they get closer to solidifying their Opening Day squad. Boston reinstated outfielder Franchy Cordero from the Covid-19 injured list and desig… [+2851 chars]"}, {"label": 5, "content": "The Celtics lost to the Pelicans on Monday night, 115-109. Jayson Tatum led Boston with 34 points.\r\nThe Bruins face the Devils tonight at 7 p.m., looking to avenge Sundays 1-0 loss to New Jersey.\r\nAn… [+4872 chars]"}, {"label": 5, "content": "Karl-Anthony Towns of the Minnesota Timberwolves had an emotional night on Monday. Playing the Brooklyn Nets at the Barclays Center, his father came to see him play for the first time since the star'… [+2416 chars]"}, {"label": 5, "content": "COMMENTARY\r\nIts been quite the final week at Red Sox spring training, a year thats been about everyone on the planet dodging bullets concentrated to a Matrix-like, 96-hour limbo for Earths 22nd-best … [+6517 chars]"}, {"label": 5, "content": "The University of Miami had its pro day on Monday and it may not have gone so well for pass rusher Gregory Rousseau.\r\nThere were reports that Rousseau didnt have a great showing and it may hurt his d… [+598 chars]"}, {"label": 5, "content": "Nicolo Melli made his debut with the Dallas Mavericks Monday night against the Oklahoma City Thunder. He quickly endeared himself to the fans and his teammates. In 11 minutes of action, he looked lik… [+3692 chars]"}, {"label": 5, "content": "Ja’Marr Chase to the Cincinnati Bengals seems to be gaining some momentum.\r\nIt’s an idea that has started to pick up steam in the wake of the Bengals shoring up the offensive line in free agency with… [+1493 chars]"}, {"label": 5, "content": "The Boston Celtics had high expectations for Evan Fournier. They acquired him using the hefty trade exception gained in the Gordon Hayward sign-and-trade, essentially making him Hayward's replacement… [+1511 chars]"}, {"label": 5, "content": "The Philadelphia 76ers continue their extended road trip tonight in Colorado, where they will be hosted by the 28-18 Denver Nuggets at the Ball Arena.\r\nSo far, the Sixers are 3-1 on this road trip, d… [+2369 chars]"}, {"label": 5, "content": "NASCAR® and its marks are trademarks of the National Association for Stock Car Auto Racing, LLC. All other trademarks are the property of their respective owners.\r\nCopyright © 2021 NASCAR Digital Med… [+28 chars]"}, {"label": 5, "content": "USA TODAY Sports' Mark Medina breaks down the NBA trade deadline.\r\nUSA TODAY\r\nThe company behind NBA Top Shot has announced a $305 million funding round that features several high-profile investors l… [+3320 chars]"}, {"label": 5, "content": "The first rule* of Sunday Ball is to never speak publicly about Sunday Ball.\r\n*That’s actually not a real rule, but it can feel that way to the pickup basketball participants in Spokane, Wash., those… [+14731 chars]"}, {"label": 5, "content": "I've done mock draft after mock draft. I've landed on a plethora of guys I'd like at 15 if we don't trade up for a QB: corners Surtain of Alabama and Horn of South Carolina; the linebacker, Parsons, … [+3202 chars]"}, {"label": 5, "content": "Cornerback Cameron Sutton didn’t know what would happen with Mike Hilton or Steven Nelson when he decided to re-sign with the Steelers earlier this month, but he knew he was “coming in” to compete fo… [+1281 chars]"}, {"label": 5, "content": "Jeff Roberson/Associated Press\r\nOregon State men's basketball announcer Mike Parker said Sunday that he was attacked while walking through Indianapolis on Saturday prior to the Oregon State Beavers' … [+2164 chars]"}, {"label": 5, "content": "The Supreme Court of the United States will hear arguments on Wednesday about the financial limits placed on NCAA athletes in a case that could significantly shape the future of college sports.\r\nDuri… [+10042 chars]"}, {"label": 5, "content": "The Anthony Rizzo extension reporting has been discouraging – and Michael added another layer last night about various offers the Cubs have made – though the whole thing is a broader reminder that al… [+6572 chars]"}, {"label": 5, "content": "Chelsea star Mason Mount sat out England's outdoor training session on Tuesday morning, putting his participation in their World Cup qualifier against Poland in doubt.\r\nThe 22-year-old midfielder was… [+2718 chars]"}, {"label": 5, "content": "Syracuse, N.Y. The Syracuse basketball teams roster of today could look completely different by next fall.\r\nHeck, the Syracuse roster could look completely different by next week, judging by all the … [+5164 chars]"}, {"label": 5, "content": "Why will no decision be made on Wednesday?\r\nThe sticking point is not related to the proposed changes to the competition, although there is considerable disagreement in the wider football community a… [+2656 chars]"}, {"label": 5, "content": "Considering how Yankees spring training began and ended on the injury front, their six weeks in Florida werent that bad based on their 2019 and 2020 low standards for staying healthy.\r\nRight off the … [+6459 chars]"}, {"label": 5, "content": "Wesley Hitt/Getty Images\r\nSpeaking of Jones’ extension, when it was signed, Andy Reid made an interesting comment.\r\nHes done everything that hes needed to do to become a top defensive tackle in the N… [+1167 chars]"}, {"label": 5, "content": "Andre Drummonds shoulders fit nearly the entire camera frame, making it easy to imagine the Lakers new center hanging from the rim inside Staples Center, the team getting an easy bucket when injuries… [+4645 chars]"}, {"label": 5, "content": "The Miami Dolphins’ spectacular maneuvering up and down the draft board last Friday was a stunning display of aggressiveness from the Dolphins. Driving down the board to cash out on a premium pick on… [+2968 chars]"}, {"label": 5, "content": "The NBA's trade deadline is officially in the rearview mirror and most of the top players to hit the post-deadline buyout market have already landed with their new teams. That means the league's coll… [+7415 chars]"}, {"label": 5, "content": "Skip to main content\r\nMar. 30, 2021,\r\nat\r\n6:00 AM\r\nPHOTO ILLUSTRATION BY EMILY SCHERER / GETTY IMAGES\r\nOn the afternoon of Friday, March 12, few teams in men’s college basketball looked better than M… [+5474 chars]"}, {"label": 5, "content": "Here are your Pens Points for this Tuesday morning...\r\nThe Pittsburgh Penguins concluded their season series with the New York Islanders last night. The game comes with good news and bad news. Good n… [+1279 chars]"}, {"label": 5, "content": "The Braves have been aggressive in their pursuit of rotation depth this offseason, but they wont have to look very far for their latest addition, as Mike Soroka is expected to make his spring debut o… [+1849 chars]"}, {"label": 5, "content": "Another day, another round of trade rumors regarding New York Jets quarterback Sam Darnold. The latest comes from Sports Illustrateds Albert Breer:\r\nId keep an eye on Carolina and Pittsburgh. Darnold… [+1606 chars]"}, {"label": 0, "content": "Scientists have created new living robots that have memory and are able to assemble themselves.\r\nThe xenobots are an updated version of biological machines that were first unveiled last year.\r\nThose … [+4410 chars]"}, {"label": 0, "content": "This cartoon shows a subducting oceanic plate traveling like a conveyor belt from the surface down to the lower mantle. The white arrows show the comparatively well-established shallow recycling path… [+4750 chars]"}, {"label": 0, "content": "(CNN)Tiny particles recovered from the summit of a mountain in Antarctica are clues that a meteorite more than 100 yards wide exploded in the sky 430,000 years ago, sending a fireball of vaporized ex… [+4212 chars]"}, {"label": 0, "content": "Until now, researchers have believed that dark energy accounted for nearly 70 percent of the ever-accelerating, expanding universe.\r\nFor many years, this mechanism has been associated with the so-cal… [+3730 chars]"}, {"label": 0, "content": "A fluffle of wild rabbits\r\n has dug up priceless archaeological treasures on an island off the coast of Wales, in the United Kingdom.\r\nThe burrowing bunnies unearthed two artifacts a 9,000-year-old S… [+4361 chars]"}, {"label": 0, "content": "A Crew Dragon version tailored for tourists gets a better view\r\nThe Crew Dragon capsule poised to fly four civilian astronauts to space this year is getting an upgrade: a glass dome will be added at … [+3207 chars]"}, {"label": 0, "content": "image captionAn artist's impression of Llukalkan aliocranianus\r\nScientists in southern Argentina have found the skull of a large meat-eating dinosaur named \"one who causes fear\" in the local Mapuche … [+1890 chars]"}, {"label": 0, "content": "NASA's Perseverance rover may still be finding its footing in the Jezero Crater, but in the meantime, the Curiosity rover is having a blast taking selfies at a fascinating rock formation. \r\nSince 201… [+2651 chars]"}, {"label": 0, "content": "The first known interstellar comet to visit our solar system may be the most pristine ever found, never passing near a star until visiting our own, researchers say.\r\nIn 2019, scientists discovered th… [+6290 chars]"}, {"label": 0, "content": "A genetic treatment has been discovered which can regrow teeth, offering hope for the millions of people living with dentures.  \r\nSuppression of the gene USAG-1 with an antibody treatment was found t… [+3165 chars]"}, {"label": 0, "content": "Published: 12:01am, 31 Mar, 2021\r\nUpdated: 5:48pm, 31 Mar, 2021"}, {"label": 0, "content": "Nature's strongest material now has some stiff competition. For the first time, researchers have hard evidence that human-made hexagonal diamonds are stiffer than the common cubic diamonds found in n… [+4236 chars]"}, {"label": 0, "content": "People visiting a Christ sculpture at the Santa Maria Magdalena Church during the Holy Week in Granada, Spain. Álex Cámara/NurPhoto via Getty ImagesChurches around the world will be holding services … [+8002 chars]"}, {"label": 1, "content": "MOSCOW (AP) Imprisoned Russian opposition leader Alexei Navalny said Wednesday he has started a hunger strike to protest authorities failure to provide proper treatment for his back and leg pains.\r\nI… [+5438 chars]"}, {"label": 1, "content": "WASHINGTON (AP) Doggie doo in the White House? \r\nOne of President Joe Bidens dogs apparently deposited the pile of poo in the hallway outside the Diplomatic Reception Room, just off the South Lawn, o… [+1472 chars]"}, {"label": 1, "content": "Sharon Stone is opening up about her bond with Britney Spears.\r\nEarlier this week, Spears, 39, shared photos of several women on Instagram she says have \"inspired\" her over the years, including Stone… [+4008 chars]"}, {"label": 1, "content": "SEATTLE -- The Seahawks are giving wide receiver Tyler Lockett a four-year, $69.2 million contract extension that includes $37 million guaranteed, a source told ESPN's Adam Schefter on Wednesday.\r\nLo… [+2981 chars]"}, {"label": 1, "content": "George FloydChristopher Martin tells court this could have been avoided, on third day of testimony in former officer Derek Chauvins trial\r\nWed 31 Mar 2021 18.56 BST\r\nThe cashier who served George Flo… [+6383 chars]"}, {"label": 1, "content": "Amazon tractor trailers line up outside the Amazon Fulfillment Center in Staten Island, N.Y., in April 2020. The pandemic has been good for the company's bottom line.\r\nMark Lennihan/AP\r\nBallots are b… [+8913 chars]"}, {"label": 1, "content": "A24 has shared the first trailer for Zola, a movie that is based on a now-infamous 148-part Twitter thread from 2015 (via Variety). Penned by Aziah Zola King, the thread recounts a road trip she took… [+861 chars]"}, {"label": 1, "content": "New York is just the fourth state to pass recreational legalization through the Legislature. | Charles Rex Arbogast/AP Photo\r\nGov. Andrew Cuomo signed legislation Wednesday morning to legalize adult-… [+5824 chars]"}, {"label": 1, "content": "The Russian Embassy in Rome on Wednesda. Italy has ordered two Russian Embassy officials expelled and arrested an Italian Navy captain on spying charges after police caught the Italian allegedly givi… [+3870 chars]"}, {"label": 1, "content": "DES MOINES, Iowa —Iowa Gov. Kim Reynolds announced during her weekly news conference Wednesday that all Iowans will be eligible to receive COVID-19 vaccinations starting April 5.\r\nNext Monday, April … [+1352 chars]"}, {"label": 1, "content": "President Joe Biden on Wednesday will outline a massive infrastructure proposal to reshape the U.S. economy and build out clean energy infrastructure as part of a broader effort to curb climate chang… [+3796 chars]"}, {"label": 1, "content": "Michael Conroy/Associated Press\r\nThe Zags have faced teams of all stripes this season, and nobody has fazed them. All four of their tournament wins have come by at least 16 points, and none of them f… [+1628 chars]"}, {"label": 1, "content": "The ship was freed after dredgers vacuumed up sand and mud from its bow and 10 tugboats pushed and pulled the vessel for five days, managing to partially refloat it at dawn.\r\nVideo Elephant\r\nInvestig… [+3468 chars]"}, {"label": 1, "content": "Call it invisible ink.\r\nTravis Barker gamely let his 15-year-old daughter Alabama test out her makeup skills by using KVD Beauty foundation to cover his face tattoos.\r\nWhile finding his perfect shade… [+677 chars]"}, {"label": 1, "content": "Arguably the most controversial on the Street, penny stocks are a hot-button issue. Usually, there isnt a lot of middle-ground with respect to these tickers priced for less than $5 apiece. Dividing m… [+7343 chars]"}, {"label": 1, "content": "A man holds a sign at an Asian American anti-violence press conference on Tuesday, outside the building where a 65-year-old Asian woman was physically and verbally attacked in New York City. Police s… [+5434 chars]"}, {"label": 1, "content": "BASKING RIDGE, N.J. - Since you broke your phone, we broke the rules. Got an old, shattered or otherwise discarded phone on your hands? Then we've got a deal for you. Beginning tomorrow, April 1, and… [+3387 chars]"}, {"label": 1, "content": "A Crew Dragon version tailored for tourists gets a better view\r\nThe Crew Dragon capsule poised to fly four civilian astronauts to space this year is getting an upgrade: a glass dome will be added at … [+3207 chars]"}, {"label": 1, "content": "image captionAn artist's impression of Llukalkan aliocranianus\r\nScientists in southern Argentina have found the skull of a large meat-eating dinosaur named \"one who causes fear\" in the local Mapuche … [+1890 chars]"}, {"label": 1, "content": "For years, Facebook insisted that its algorithms were best placed to curate what people saw on their News Feed. It was like being told that the machine learning systems knew what you wanted better th… [+1706 chars]"}, {"label": 1, "content": "Congressman Matt Gaetz on Tuesday night denied he had an inappropriate sexual relationship with a 17-year-old girl and paid for her to travel with him after The New York Times reported that the Justi… [+2253 chars]"}, {"label": 1, "content": "Arizona House Bill 2005, a hotly contested piece of legislation that would have imposed developer-friendly changes to Apple and Googles mobile app stores, is now on deaths door. The bill, which would… [+8625 chars]"}, {"label": 1, "content": "Opening Day is tomorrow, and we are wrapping up our picks for the upcoming season. Up first is a look at who we think will win each division, the NL and AL pennants and the World Series. Let us know … [+17782 chars]"}, {"label": 1, "content": "Dow Jones futures fell slightly early Wednesday, while S&amp;P 500 futures edged higher and Nasdaq futures rose modestly as the stock market rally awaits President Biden's big infrastructure spending… [+13097 chars]"}, {"label": 1, "content": "Over 100 people in Washington state have tested positive for COVID-19 more than two weeks after becoming fully vaccinated against the disease, officials said.\r\nThe Washington State Department of Heal… [+2674 chars]"}, {"label": 1, "content": "NASA's Perseverance rover may still be finding its footing in the Jezero Crater, but in the meantime, the Curiosity rover is having a blast taking selfies at a fascinating rock formation. \r\nSince 201… [+2651 chars]"}, {"label": 1, "content": "Grunge. Wu-Tang Clan. Radiohead. Wonderwall. The music of the 90s was as exciting as it was diverse. But what does it say about the eraand why does it still matter? On our new show, 60 Songs That Exp… [+8804 chars]"}, {"label": 1, "content": "Pfizer announced Wednesday that its COVID-19 vaccine is safe and strongly protective in kids as young as 12, a step toward possibly beginning shots in this age group before they head back to school i… [+5902 chars]"}, {"label": 1, "content": "A Long Island woman tested positive for COVID-19 Tuesday more than a month after receiving her second dose of the Moderna vaccine meant to protect against the virus, a report said.\r\nMelanie Rosen, wh… [+1627 chars]"}, {"label": 1, "content": "Lets get to the Philadelphia Eagles links ...\r\nA packed Linc? NFL commissioner expects full stadiums in 2021 - NBCSPRemember the days when Lincoln Financial Field was packed to the gills? When the ro… [+7039 chars]"}, {"label": 1, "content": "China is readying itself for American and Japanese involvement in any Taiwan Strait conflict, with recent warplane exercises around the island aimed at displaying its ability to isolate Taiwan from p… [+3796 chars]"}, {"label": 1, "content": "Skip to main content\r\nMar. 31, 2021,\r\nat\r\n6:00 AM\r\nSyringes are prepared with doses of the Johnson &amp; Johnson COVID-19 vaccine in Charleston, West Virginia.Stephen Zenner / Bloomberg via Getty Ima… [+8113 chars]"}, {"label": 1, "content": "According to credible Apple analyst Ming-Chi Kuo, the iPhone 13 lineup, slated for launch in the second half of the year, will feature the same wide-angle lens as the current iPhone 12 series, offeri… [+2366 chars]"}, {"label": 1, "content": "He said that 250 to 300 children were entering the Donna facility each day and far fewer were departing. The remainder of the migrants housed at the camp a total of about 700 are adults and children … [+1317 chars]"}, {"label": 2, "content": "WellSpan Health said COVID-19 vaccination appointments are available for Phase 1A individuals at several sites across Adams, Franklin, Lancaster, Lebanon and York counties.\r\nPeople can register at My… [+287 chars]"}, {"label": 2, "content": "More than 400 Minnesota inpatient hospital beds are filled with COVID-19 cases for the first time since late January, reflecting the latest surge in pandemic activity despite vaccination progress.\r\nT… [+2865 chars]"}, {"label": 2, "content": "Beaumont Health said Wednesday it has the highest number of COVID-19 inpatients in Michigan with more than 500 on Tuesday and is expanding COVID-19 units at all its hospital sites.\r\nAlso, the health … [+7440 chars]"}, {"label": 2, "content": "Clinical trial results of Pfizer/BioNTech's Covid-19 vaccine showed its efficacy is 100% and it is well tolerated in youths ages 12 to 15, the companies said Wednesday. \r\nPfizer/BioNTech plan to subm… [+1975 chars]"}, {"label": 2, "content": "More than 40 people in Canada have reportedly contracted a mysterious brain illness — with symptoms resembling those in a rare and fatal illness, including memory loss, hallucinations and muscle atro… [+3015 chars]"}, {"label": 2, "content": "DES MOINES, Iowa —Iowa Gov. Kim Reynolds announced during her weekly news conference Wednesday that all Iowans will be eligible to receive COVID-19 vaccinations starting April 5.\r\nNext Monday, April … [+1352 chars]"}, {"label": 2, "content": "One hundred fully vaccinated Washington state residents have tested positive for COVID-19 and a New York resident says she contracted the virus a month after receiving her second Moderna dose when sh… [+5155 chars]"}, {"label": 2, "content": "SORRENTO, Australia — To Rob Courtney, it looked like a sunburn. But after a few days, the redness and inflammation got worse. Soon, the skin on his right foot was split open, the wound oozing. His d… [+7220 chars]"}, {"label": 2, "content": "Over 100 people in Washington state have tested positive for COVID-19 more than two weeks after becoming fully vaccinated against the disease, officials said.\r\nThe Washington State Department of Heal… [+2674 chars]"}, {"label": 2, "content": "ST. LOUIS (KMOV.com) -- A new study, published by the Centers for Disease Control, shows promising results regarding the effectiveness of the Moderna and Pfizer vaccines.\r\nAs opposed to a clinical tr… [+2060 chars]"}, {"label": 2, "content": "Officials in Canada are racing to find the cause of a mysterious brain disease that has afflicted more than 40 people in the New Brunswick province, according to news reports.\r\nSymptoms of the myster… [+2356 chars]"}, {"label": 2, "content": "Pfizer announced Wednesday that its COVID-19 vaccine is safe and strongly protective in kids as young as 12, a step toward possibly beginning shots in this age group before they head back to school i… [+5902 chars]"}, {"label": 2, "content": "A Long Island woman tested positive for COVID-19 Tuesday more than a month after receiving her second dose of the Moderna vaccine meant to protect against the virus, a report said.\r\nMelanie Rosen, wh… [+1627 chars]"}, {"label": 2, "content": "Skip to main content\r\nMar. 31, 2021,\r\nat\r\n6:00 AM\r\nSyringes are prepared with doses of the Johnson &amp; Johnson COVID-19 vaccine in Charleston, West Virginia.Stephen Zenner / Bloomberg via Getty Ima… [+8113 chars]"}, {"label": 2, "content": "New research suggests the same lifestyle habits people develop to promote heart health may also help curb cancer risk.\r\nThe leading cause of death in American adults is heart disease, followed closel… [+4880 chars]"}, {"label": 2, "content": "Everyone in both groups worked out three times a week at first, for about half an hour and under supervision. They then added sessions on their own, until after six months, they were completing about… [+2159 chars]"}, {"label": 2, "content": "Rishi Sunak, the UK's chancellor, has admitted he was against having a circuit-break lockdown in September, insisting there \"wasn't a clear-cut case\" for one.\r\nBack in September, cases in the UK were… [+1147 chars]"}, {"label": 2, "content": "(KHN)With a mix of relief and caution, older adults fully vaccinated against Covid-19 are moving out into the world and resuming activities put on hold during the pandemic.\r\nMany are making plans to … [+8417 chars]"}, {"label": 2, "content": "A Long Island woman tested positive for COVID-19 Tuesday more than a month after receiving her second dose of the Moderna vaccine meant to protect against the virus, a report said.\r\nMelanie Rosen, wh… [+1571 chars]"}, {"label": 2, "content": "The day has finally come. Scientists have finally created synthetic mucus molecules that exhibit the structure and function of the real deal.\r\nFar from being a slime crime, though, it's a discovery t… [+3751 chars]"}, {"label": 2, "content": "We know that depression is linked to variations in the way our brains are wired, but new research suggests that people who are going through a depressive episode actually see the world around them di… [+3351 chars]"}, {"label": 2, "content": "We're making this important information available without a subscription as a public service. But we depend on reader support to do this work. Please consider supporting independent journalism in Ala… [+3568 chars]"}, {"label": 2, "content": "In January, Britain made a change to its vaccine guidelines that shocked many health experts: If the second dose of one vaccine wasnt available, patients could be given a different one.\r\nThe new rule… [+10232 chars]"}, {"label": 2, "content": "Bay Area counties have a message for hundreds of thousands of patient 50- to 64-year-olds who become eligible for a COVID-19 vaccination as of Thursday: Stay patient.“We just don’t have the supply ri… [+7573 chars]"}, {"label": 3, "content": "U.S. farmers will plant lower corn and soybean acreage than the trade expected, according to the USDA.\r\nAs a result, the CME Groups corn market hit its daily limit up (25¢) trading prices. \r\nAt the c… [+3562 chars]"}, {"label": 3, "content": "Shares in Deliveroo slumped by as much as 30% as the U.K. food delivery company made its highly-anticipated stock market debut on the London Stock Exchange, dealing a blow to the citys efforts to att… [+4063 chars]"}, {"label": 3, "content": "Food delivery app DoorDash is seeking \"tens of million of dollars\" in damages from its partner, software company Olo, accusing it of breaching a contract and fraudulently overcharging it.\r\nOlo is a s… [+2191 chars]"}, {"label": 3, "content": "If their working conditions are as good as they claimed, they should welcome a union\r\nIllustration by Alex Castro / The Verge\r\nWhile some Alabama Amazon workers were submitting their votes to unioniz… [+5597 chars]"}, {"label": 3, "content": "Shares of education tech company Coursera opened at $39 apiece in its market debut Wednesday on the New York Stock Exchange.\r\nOn Tuesday, Coursera priced its 15.73 million shares at $33 apiece the hi… [+3450 chars]"}, {"label": 3, "content": "Amazon tractor trailers line up outside the Amazon Fulfillment Center in Staten Island, N.Y., in April 2020. The pandemic has been good for the company's bottom line.\r\nMark Lennihan/AP\r\nBallots are b… [+8913 chars]"}, {"label": 3, "content": "A surge of new coronavirus cases in Michigan is hitting a younger demographic than previous spikes which officials said is likely due to high vaccination rates among those ages 70 and above. At Spect… [+2435 chars]"}, {"label": 3, "content": "With covid-19 vaccination rates on the rise, the airline industry has a plan to help facilitate air travel with the launch of a digital travel pass app slated to arrive as soon as mid-April.\r\nIn an a… [+2435 chars]"}, {"label": 3, "content": "There are not enough homes for sale and, as a result, pending home sales plunged 10.6% in February, marking the second straight month of declines, according to the National Association of Realtors. F… [+3216 chars]"}, {"label": 3, "content": "Sign Up To Our Free Newsletter\r\nThanks for subscribing to our free newsletter!\r\nERROR\r\nResearch firm Roskill thinks that…\r\nIndonesia has set its sights…\r\nNew data shows that robots…\r\nBy Irina Slav - … [+1978 chars]"}, {"label": 3, "content": "Kimberly-Clark said Wednesday that it would hike prices on staples like Scott toilet paper and Huggies diapers, joining the growing list of consumer products companies that are raising prices.\r\nHighe… [+1858 chars]"}, {"label": 3, "content": "Honda is recalling more than 628,000 vehicles in the U.S. to replace fuel pumps that can fail, causing the engines to stall.\r\nThe recall covers much of the Honda and Acura model lineup from the 2018 … [+831 chars]"}, {"label": 3, "content": "LONDON (AP) German officials have decided to limit the use of AstraZenecas coronavirus vaccine in people under 60 after more unusual blood clots were reported in a small number of people who received… [+6104 chars]"}, {"label": 3, "content": "Delta Air Lines CEO Ed Bastian condemned Georgia's new election law as \"unacceptable\" in a memo circulated to staff on Wednesday, claiming that the \"entire rationale for this bill was based on a lie\"… [+1277 chars]"}, {"label": 3, "content": "I didn't ask any questions as I stood in line at Chicago's Wake-N-Bakery and accepted a free weed-infused Sour Patch Watermelon from a barista's gloved hands.\r\nAfter all, I wasn't completely sure how… [+5230 chars]"}, {"label": 3, "content": "President Joe Biden speaks as he meets with Senators from both parties in the White House on Feb. 11, 2021.\r\nPresident Joe Biden is prioritizing a national EV charging network under his $2 trillion i… [+7651 chars]"}, {"label": 3, "content": "Whether youre looking to make a larger investment or you just want to dabble in cryptocurrencies, you can purchase Bitcoin, Ethereum, Bitcoin Cash, and Litecoin through PayPal. And, soon, youll be ab… [+3818 chars]"}, {"label": 3, "content": "Arguably the most controversial on the Street, penny stocks are a hot-button issue. Usually, there isnt a lot of middle-ground with respect to these tickers priced for less than $5 apiece. Dividing m… [+7343 chars]"}, {"label": 3, "content": "There are lots of unanswered questions about one idea to get travel back to normal.\r\nUSA TODAY\r\nMake room for neighbors on your next Delta Air Lines flight.\r\nThe airline will end its yearlong practic… [+2549 chars]"}, {"label": 3, "content": "Brands are very, very excited about non-fungible tokens. Over the past month, some of Americas most recognizable brands have eagerly hopped onto the bandwagon, selling limited-edition Taco Bell crypt… [+9597 chars]"}, {"label": 3, "content": "BURLINGTON, Vt. (AP) Students who once shopped at a downtown mall in Burlington, Vermont, are now attending high school in the former Macys department store, with gleaming white tile floors and escal… [+3109 chars]"}, {"label": 3, "content": "With summer just around the corner and pandemic restrictions expected to ease in the coming months as more Americans receive the vaccine, travel is on many people's minds.\r\nWhether planning a vacatio… [+2184 chars]"}, {"label": 3, "content": "When the pandemic unfolded last year, demand for at-home fitness equipment skyrocketed, and Tonal was no exception. The maker of a smart home fitness trainer experienced an explosive increase in sale… [+3424 chars]"}, {"label": 3, "content": "BOSTON —A nationwide system outage affecting a vendor used by the Massachusetts Registry of Motor Vehicles means no vehicle inspections can be performed Wednesday, the last day of the month.\r\nAccordi… [+505 chars]"}, {"label": 3, "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+1661 chars]"}, {"label": 3, "content": "Sabra Dipping Company, LLC, is calling back a popular hummus product over concerns that it may be contaminated with salmonella. The recall, which impacts about 2,100 cases of 10-ounce Classic Hummus … [+1174 chars]"}, {"label": 3, "content": "After four years of working in an Amazon warehouse, I applied to be an Amazon delivery driver. \r\nI wanted to be a driver because I thought I would have a lot more freedom and wouldn't have to deal wi… [+6995 chars]"}, {"label": 3, "content": "Dow Jones futures fell slightly early Wednesday, while S&amp;P 500 futures edged higher and Nasdaq futures rose modestly as the stock market rally awaits President Biden's big infrastructure spending… [+13097 chars]"}, {"label": 3, "content": "Audacy\r\nThe parent company of seven Chicago radio stations including top-rated all-news WBBM 780-AM/WCFS 105.9-FM officially changed its name Tuesday from Entercom to “Audacy.”\r\n“It’s part ‘audio,’ i… [+2427 chars]"}, {"label": 3, "content": "When President \r\n Joe Biden\r\n  unveils his much-anticipated infrastructure plan in Pittsburgh on Wednesday, the advertised price tag of the proposals will be roughly $2 trillion. But that doesnt incl… [+4284 chars]"}, {"label": 3, "content": "The day we’ve all been waiting for is finally here. Today, March 31, marks the official entrance of Alaska Airlines into the Oneworld alliance. This is a major change for the Seattle-based carrier, w… [+10544 chars]"}, {"label": 3, "content": "Higher mortgage rates are hitting the refinance market hard and may finally be taking their toll on homebuyers. \r\nMortgage application volume fell 2.2% last week compared with the previous week, acco… [+1960 chars]"}, {"label": 3, "content": "CHICAGO (Reuters) - Pfizer PFE.N and BioNTech's BNTX.O COVID-19 vaccine is safe, effective and produces robust antibody responses in 12- to 15-year olds, the companies said on Wednesday, paving the w… [+4441 chars]"}, {"label": 3, "content": "The COVID-19 pandemic has brought about a rapid shift to digitization, accelerating the demand for various products and devices dependent on chips for their functioning. As people were forced to stay… [+5521 chars]"}, {"label": 3, "content": "Lexus has unveiled a new electric SUV concept, the “LF-Z Electrified,” but it’s not something it plans to bring to production. Rather, the automaker says that it is “symbolic” of its next-generation … [+4177 chars]"}, {"label": 3, "content": "Independent music distribution platform and tool factory UnitedMasters has raised a $50M series B round led by Apple. A16z and Alphabet are participating again in this raise. United Masters is also e… [+5526 chars]"}, {"label": 3, "content": "© Stephen Zenner/SOPA Images/LightRocket via Getty Images\r\n A nurse loading a syringe with a dose of Johnson &amp; Johnson's COVID-19 vaccine in Athens, Ohio. Stephen Zenner/SOPA Images/LightRocket v… [+3167 chars]"}, {"label": 3, "content": "European Central Bank President Christine Lagarde said her institution could launch a digital currency around the middle of this decade if her fellow policy makers give the project the green light th… [+1373 chars]"}, {"label": 3, "content": "Volkswagen of Americas purported name change to Voltswagen was an April Fools joke gone bad.\r\nOn Monday, the automaker briefly posted, then removed, a draft press release on its website supposedly an… [+3016 chars]"}, {"label": 3, "content": "Not that it said much. There were no explicit references to cotton, Xinjiang or forced labor. However, the statement said that H&amp;M wanted to be a responsible buyer, in China and elsewhere and was… [+792 chars]"}, {"label": 3, "content": "Firefox Focus, DuckDuckGo and Brave are all similar, but with some important differences.\r\nFirefox Focus, available only for mobile devices like iPhones and Android smartphones, is bare-bones. You pu… [+2013 chars]"}, {"label": 3, "content": "Over the past five decades, computer scientists have built increasingly intuitive programming languages, making it easier and easier for people to create software for desktops, laptops, smartphones, … [+1019 chars]"}, {"label": 3, "content": "GUANGZHOU, China Huawei's revenue growth slowed dramatically last year as the impact of U.S. sanctions and the economic fallout from the coronavirus weighed on the Chinese technology giant.\r\nRevenue … [+3081 chars]"}, {"label": 3, "content": "Oil prices rose on the eve of meeting between OPEC and its allies, as investors were betting the producers would largely agree to extend their supply curbs into May.\r\nOPEC+ has raised concerns that r… [+2943 chars]"}, {"label": 3, "content": "Cathie Woods Ark Investment Management sends out an email every night listing the stocks that were bought or sold by the firm's ETFs that day. In recent months, the emails have known to cause certain… [+8741 chars]"}, {"label": 3, "content": "Practically full circle\r\nPhoto by Lorenzo Di Cola/NurPhoto via Getty Images\r\nIt feels like just about every big tech company is working on a Clubhouse-like social audio feature Twitters Spaces featur… [+1466 chars]"}, {"label": 4, "content": "Sharon Stone is opening up about her bond with Britney Spears.\r\nEarlier this week, Spears, 39, shared photos of several women on Instagram she says have \"inspired\" her over the years, including Stone… [+4008 chars]"}, {"label": 4, "content": "Though youre a child of deaf adults, youre also a hearing person. Is there a case to be made that Joe should have been played by someone who is deaf or hard of hearing?\r\nThats an argument that some w… [+1500 chars]"}, {"label": 4, "content": "Katherine Schwarzenegger and Chris Pratt are protective about their daughter's privacy and want to keep her childhood as normal as possible.\r\nThe 31-year-old author revealed on the \"TODAY\" show Tuesd… [+1733 chars]"}, {"label": 4, "content": "Gwyneth Paltrow isn't on screen as much these days, and she explained why during a recent interview on SiriusXM.\r\nUSA TODAY\r\nGwyneth Paltrow is taking some heat for the way she applied SPF in a recen… [+4275 chars]"}, {"label": 4, "content": "Jimmy Fallon and Addison Rae caught backlash after performing dances on \"The Tonight Show\" without crediting the Black creators that came up with the routines. \r\nThe TikTok star appeared on the late-… [+2971 chars]"}, {"label": 4, "content": "[Ed. note: Spoilers ahead for episodes 1 and 2 of The Falcon and the Winter Soldier. All quotes have been edited for concision and clarity.]\r\nThe premiere episode of the new Marvel Cinematic Universe… [+4506 chars]"}, {"label": 4, "content": "Billy Joel performing at Bonnaroo 2015.\r\nJason Merritt/TERM/Getty Images\r\nMusic festival season seems ready to go on in 2021. The Bonnaroo Music &amp; Arts Festival has posted its lineup, scheduled t… [+1546 chars]"}, {"label": 4, "content": "A24 has shared the first trailer for Zola, a movie that is based on a now-infamous 148-part Twitter thread from 2015 (via Variety). Penned by Aziah Zola King, the thread recounts a road trip she took… [+861 chars]"}, {"label": 4, "content": "Those comments represented a break from the norm of studios publicly ignoring unsavory elements within fan bases even as they seek to find new ways to monetize those audiences. In years past, Sony wa… [+8127 chars]"}, {"label": 4, "content": "Paris Jackson, the daughter of the late Michael Jackson, recently opened up on some of the lessons her father taught her.\r\nSpeaking Tuesday with Naomi Campbell on the supermodel's No FilterYouTube se… [+1840 chars]"}, {"label": 4, "content": "Jehnny Beth and Primal Scream frontman Bobby Gillespie have announced a collaborative album. Utopian Ashes arrives July 2 via Third Man. Today, Beth and Gillespie have shared a Douglas Hartdirected m… [+1489 chars]"}, {"label": 4, "content": "BLACKPINKs Rosé is returning with her second solo music video!\r\nOn April 1 at midnight KST, Rosé officially announced that she would be releasing the music video for GONE, the B-side from her first s… [+399 chars]"}, {"label": 4, "content": "Hollywood scion Chet Hanks ended up with a gushing head wound after a fight with his ex-girlfriend, in which she swung a pot at his head, according to shocking new video of the incident.\r\nIn the mome… [+2947 chars]"}, {"label": 4, "content": "Laika is expanding into the world of live-action filmmaking for the first time, with an adaptation of John Brownlow’s upcoming debut novel, Seventeen.\r\nKnown for its groundbreaking work in stop-motio… [+3016 chars]"}, {"label": 4, "content": "Just family bonding things!"}, {"label": 4, "content": "Domino are immensely proud to announce the signing of my bloody valentine, with the bands seminal catalogue being made available digitally in full for the first time ever as of today. New physical ed… [+3620 chars]"}, {"label": 4, "content": "Katharine McPhee is proudly showing off her new curvy body after giving birth just five weeks ago.\r\nThe 37-year-old singer posted a new selfie on her Instagram Stories in a brown two-piece swimsuit. … [+1849 chars]"}, {"label": 4, "content": "Call it invisible ink.\r\nTravis Barker gamely let his 15-year-old daughter Alabama test out her makeup skills by using KVD Beauty foundation to cover his face tattoos.\r\nWhile finding his perfect shade… [+677 chars]"}, {"label": 4, "content": "Demi Lovato: Dancing With the Devil opens in a state of disbelief. Although Lovatos friends and family have gathered to set the record straight about Lovatos rehab and recovery since the 2018 overdos… [+9171 chars]"}, {"label": 4, "content": "Death on the Nile has faced more stalls than most other star-studded sequels of its caliber first getting lost in the Fox-Disney reshuffle before the coronavirus (COVID-19) pandemic put a stop to 202… [+2989 chars]"}, {"label": 4, "content": "London — Wednesday marked exactly a year since Prince Harry and Meghan, the Duke and Duchess of Sussex, made their departure as \"working\" members of Britain's royal family official. Since the couple'… [+5778 chars]"}, {"label": 4, "content": "A virus-themed \"SpongeBob SquarePants\" episode has stopped airing amid the coronavirus pandemic, while another was taken off the air because the storyline was not appropriate for children, a Nickelod… [+2159 chars]"}, {"label": 4, "content": "Luke Bryan on upcoming album, equal gender play in country music\r\nAP Entertainment\r\nLuke Bryan is \"Hooked on It.\" Literally.\r\nThe country singer posted a video to Instagram Tuesday of a bait and hook… [+2114 chars]"}, {"label": 4, "content": "Adam Wingard’s “Godzilla vs. Kong” has already proven to be the biggest box office success of the current pandemic era. For the 38-year-old filmmaker, it’s a radical new chapter after his initial for… [+9827 chars]"}, {"label": 4, "content": "Top songwriters for artists including Dua Lipa, Lady Gaga and Ariana Grande have written an open letter calling for an end to artists claiming royalties for songs they had no hand in writing.\r\nAs new… [+2143 chars]"}, {"label": 4, "content": "The Disney Parks Blog has announced that the EPCOT International Food &amp; Wine Festival is set to begin on July 15th at Walt Disney World!\r\nThis years event will include the return of many guest fa… [+954 chars]"}, {"label": 4, "content": "Aaron Rodgers and Shailene Woodley’s post-engagement celebrations continue. \r\nEarlier this week, the couple enjoyed a cozy meal at the Best Cafe and Bar in Hot Springs, Arkansas, according to an Inst… [+2130 chars]"}, {"label": 4, "content": "NXT returns tonight (Mar. 31) from the Capitol Wrestling Center (CWC) in Orlando, Florida.\r\nAdvertised for the show: \r\n<ul><li>Dexter Lumis, Austin Theory, Bronson Reed, Leon Ruff, Roderick Strong, L… [+4115 chars]"}, {"label": 4, "content": "Stars pay tribute to Cloris Leachman; Michael Strahan tests positive for COVID-19; Bernie Sanders' mittens, memes help raise $1.8M for charity. (Jan. 28)\r\nAP Entertainment\r\nDid Michael Strahan really… [+2306 chars]"}, {"label": 4, "content": "She may now be a superstar, but Chrissy Teigen is still the same refreshingly honest and disarmingly funny woman who shared hilarious tales and mouth-watering recipes via her food blog, So Delushious… [+4633 chars]"}, {"label": 4, "content": "During a girls’ day out with her mom, Beyonce, Blue Ivy Carter looked so stylish with her chic outfit and straight hair!\r\nBeyonce enjoyed some one-on-one time with her oldest daughter, Blue Ivy Carte… [+2046 chars]"}, {"label": 4, "content": "Sharon Stone has revealed she paid Leonardo DiCaprio’s salary in 1995 on The Quick and the Dead.\r\nIn her new memoir, of which IndieWire shared an extract, Stone recalled working as a producer on the … [+1163 chars]"}, {"label": 4, "content": "Grunge. Wu-Tang Clan. Radiohead. Wonderwall. The music of the 90s was as exciting as it was diverse. But what does it say about the eraand why does it still matter? On our new show, 60 Songs That Exp… [+8804 chars]"}, {"label": 4, "content": "WWE filmed the Hall of Fame ceremony for the Class of 2020 earlier today, and photos and other details of the taped show have already surfaced on the internet.\r\nThe Bella Twins are officially WWE Hal… [+2307 chars]"}, {"label": 4, "content": "BBC Two will air a new documentary, Amy Winehouse: 10 Years On, to mark a decade since Amy Winehouse’s death. The documentary, commissioned by BBC Two and BBC Music, will be told primarily from the p… [+1468 chars]"}, {"label": 4, "content": "Starting today, all free and premium Spotify users will be able access three new personalized mixes inspired by Daily Mix. The music streaming service already creates custom Daily Mixes for you by co… [+1329 chars]"}, {"label": 4, "content": "Hazel heaves open a sewer lid in the middle of the desert and hurls herself out of the ground. Soaking wet and gasping for breath, she nurses the bloody wound on the back of her head. The escapees vi… [+8261 chars]"}, {"label": 4, "content": "They have had to tackle motherhood from all angles, including being 'step moms' to their significant others' children from past relationships.\r\nAnd Gwyneth Paltrow spoke candidly about the daunting n… [+3607 chars]"}, {"label": 4, "content": "Pooch Perfect premiered Tuesday night, and while many enjoyed the dog grooming competition show, there was a large backlash from viewers on Twitter who thought it was abusive. The new series is produ… [+1597 chars]"}, {"label": 4, "content": "They went Instagram official at the beginning of this year with a gorgeous couples vacation selfie.\r\nAnd on Tuesday, Brian Austin Green and his girlfriend Sharna Burgess took things to the next level… [+3967 chars]"}, {"label": 4, "content": "Speculating on the rumors surrounding pro wrestling is a favored pastime of many fans, perhaps second only to actually watching the matches. In this daily column, we take a look at the latest rumors … [+1474 chars]"}, {"label": 4, "content": "YouTube has declined to remove YGs 2014 song Meet the Flockers after the companys staffers called for the video to be pulled due to lyrics about targeting Chinese neighborhoods during burglary attemp… [+1788 chars]"}, {"label": 4, "content": "Gwen Stefani and Blake Shelton shouldnt expect a friends and family rate from Adam Levine if they want the Maroon 5 frontman to perform at their upcoming wedding.\r\nLevine, 44, told SiriusXM's \"The Mo… [+2070 chars]"}, {"label": 4, "content": "Keep up with the latest daily buzz with the BuzzFeed Daily newsletter!"}, {"label": 4, "content": "The Irwin family has found another way to honor the legacy of the late patriarch and \"Crocodile Hunter\" star Steve Irwin.\r\nSteves son, Robert, took to social media on Tuesday to share the exciting ne… [+2124 chars]"}, {"label": 4, "content": "Kirsten Dunst announced her pregnancy in grand style this week, on the cover of W Magazine.\r\nNo one who saw the latest issue could miss Dunsts baby bump.\r\nDirector Sofia Coppola, who has worked with … [+2834 chars]"}, {"label": 5, "content": "12:30pm: The Cubs announced that they have indeed signed Wolters to a one-year, Major League contract.\r\n9:00am: Veteran catcher Tony Wolters, who recently opted out of a minor league contract with th… [+1853 chars]"}, {"label": 5, "content": "The Royals announced Wednesday that shortstop Adalberto Mondesi has been placed on the 10-day injured list due to a right oblique strain. The move is retroactive to March 30. Fellow infielder Nicky L… [+1970 chars]"}, {"label": 5, "content": "The Eagles made the biggest move of the NFL draft process, moving down from No. 6 overall, to No. 12, after swapping picks with the Miami Dolphins.\r\nPhiladelphia acquired extra draft capital by makin… [+1679 chars]"}, {"label": 5, "content": "Ron Darling doesn’t expect any new team or new town jitters. He doesn’t believe it will take Francisco Lindor time to adjust to his new surroundings. The former Mets pitcher and SNY analyst sees an M… [+1326 chars]"}, {"label": 5, "content": "Pro days are just one part of a larger overall process of prospect evaluation and are often used as a double-check to what scouts see in a players game film. That being said, when top-rated players h… [+2823 chars]"}, {"label": 5, "content": "SEATTLE -- The Seahawks are giving wide receiver Tyler Lockett a four-year, $69.2 million contract extension that includes $37 million guaranteed, a source told ESPN's Adam Schefter on Wednesday.\r\nLo… [+2981 chars]"}, {"label": 5, "content": "Actor Michael Rapaport posted screenshots of a private conversation between him and Brooklyn Nets star Kevin Durant on Tuesday, and now KD is apologizing for his action. In the exchange, Durant utter… [+1636 chars]"}, {"label": 5, "content": "Linebacker Tyrell Adams went on a visit with the Bills this week and apparently it went well.\r\nAccording to Aaron Wilson of the Houston Chronicle, Buffalo is signing the linebacker to a deal.\r\nAdams … [+466 chars]"}, {"label": 5, "content": "Jon Jones has started negotiations with the UFC in hopes that a deal can be brokered for a showdown with new heavyweight champion Francis Ngannou.\r\nThe longtime light heavyweight king took to Twitter… [+5973 chars]"}, {"label": 5, "content": "We are officially less than a month away from the 2021 NFL Draft, and the speculation will continue to build around who the San Francisco 49ers will take with the third pick. \r\nGeneral manager John L… [+3491 chars]"}, {"label": 5, "content": "The last two times Allen had an opening for a head football coach it turned to familiar faces. This time, the biggest school in Texas decided to make an outside hire and a big one.\r\nChad Morris, the … [+4878 chars]"}, {"label": 5, "content": "Russell Westbrook took the high road. Instead of firing back at Stephen A. Smith’s criticism, he spoke in broad terms about his play, and finding happiness in life.\r\nThe ESPN hot-take artist said the… [+1317 chars]"}, {"label": 5, "content": "The Denver Broncos have a big, pivotal, absolutely momentous decision to make. Stick it out with Drew Lock one last year in hopes that his 18 starts and second-straight year in Pat Shurmur's offense … [+3605 chars]"}, {"label": 5, "content": "The Milwaukee Bucks may not be facing the Los Angeles Lakers A-squad in this one, but they could use a chance to get right after a relatively slow teardown by the Clippers in the Staples Center on Mo… [+3101 chars]"}, {"label": 5, "content": "The dust has settled from the 2021 NBA trade deadline, with the Celtics adding three new faces into the fold while also sending three out the door. Bostons short-term priorities became clear last wee… [+6633 chars]"}, {"label": 5, "content": "The choice facing the Miami Dolphins next month with what to do with the No. 6 overall pick in the 2021 NFL Draft will not be an easy one. But the good news for Miami is that their choice is only dif… [+2254 chars]"}, {"label": 5, "content": "GAINESVILLE, Fla. -- Florida held its annual Pro Day in its indoor practice facility on Wednesday, affording 19 athletes the chance to showcase their skills in front of NFL scouts.\r\nFive NFL head coa… [+3193 chars]"}, {"label": 5, "content": "CLEVELAND, Ohio -- New Browns defensive tackle Malik Jackson hopes that Jadeveon Clowney joins him on this train possibly bound for the Super Bowl.\r\nI dont think I have to [recruit him] he said on a … [+3429 chars]"}, {"label": 5, "content": "Eric Gay/Associated Press\r\nUConn star Paige Bueckers responded emotionally to being named the 2021 Associated Press women's basketball player of the year: \r\nAP Top 25@AP_Top25BREAKING: @paigebueckers… [+864 chars]"}, {"label": 5, "content": "Syracuse, N.Y. -- Symir Torrence is coming home.\r\nThe Syracuse native, who played two seasons at Marquette, will transfer to Syracuse University, where he will have three seasons of eligibility left.… [+5224 chars]"}, {"label": 5, "content": "NCAA president Mark Emmert on Wednesday continued to apologize for the inequities between the men's and women's basketball tournaments that were exposed earlier this month, conceding, \"we let them do… [+5950 chars]"}, {"label": 5, "content": "UConn Huskies sophomore guard James Bouknight is entering the 2021 NBA draft and plans to hire an agent, Bouknight told ESPN.\r\nBouknight, a 6-foot-5 guard ranked No. 18 in ESPN's Top 100 of available… [+1284 chars]"}, {"label": 5, "content": "Division I student athletes looked poised for victory in their Supreme Court battle against the National Collegiate Athletic Association over whether the organization may impose restraints on compens… [+5007 chars]"}, {"label": 5, "content": "CLEVELAND, Ohio Cleveland Indians fans will not be able to paint their faces in Native American fashion or wear headdresses to games at Progressive Field this season, according to a new team policy.\r… [+3532 chars]"}, {"label": 5, "content": "Two contenders in their respective conferences went at it when the Denver Nuggets hosted the Philadelphia 76ers on Tuesday night. The game was the second of two meetings between the teams on the seas… [+4370 chars]"}, {"label": 5, "content": "Michael Conroy/Associated Press\r\nThe Zags have faced teams of all stripes this season, and nobody has fazed them. All four of their tournament wins have come by at least 16 points, and none of them f… [+1628 chars]"}, {"label": 5, "content": "The excitement is palpable around the Los Angeles Lakers as they landed Andre Drummond after he agreed to a buyout with the Cleveland Cavaliers.\r\nDrummond had several suitors after his buyout was com… [+2244 chars]"}, {"label": 5, "content": "Quarterback Tom Brady won his seventh Super Bowl in February, leading the Tampa Bay Buccaneers to a 31-9 victory at home over the Kansas City Chiefs in his first year with his new team. After the cha… [+1273 chars]"}, {"label": 5, "content": "Indiana associate head coach Kenya Hunter is expected to be retained by Mike Woodson, Inside the Hall has learned.Hunter, who joined the Indiana program last fall under Archie Miller, is known as an … [+3496 chars]"}, {"label": 5, "content": "HOUSTON -- Two more lawsuits alleging sexual assault and inappropriate behavior were filed against Deshaun Watson on Tuesday evening, including one that states the Houston Texans quarterback has \"uns… [+3273 chars]"}, {"label": 5, "content": "The Bruins rallied from a 3-1 deficit to defeat the Devils in a shootout on Tuesday, 5-4. David Pastrnak scored the winner:\r\nCapping the comeback. @pastrnak96's shootout winner is your @JagermeisterU… [+5605 chars]"}, {"label": 5, "content": "Germany and Real Madid midfielder Toni Kroos has issued scathing criticism of 2022 World Cup host nation Qatar, speaking out about working conditions for migrant laborers and the persecution of homos… [+2566 chars]"}, {"label": 5, "content": "It is no secret that the Philadelphia Flyers are where they are because of goaltending. With the worst goaltending by save percentage in the entire league by more than a whole percentage point, this … [+2776 chars]"}, {"label": 5, "content": "THE DAILY SPONGIE SPECIAL\r\nBEARRRSSSS\r\nNFL owners approve 17th game for 2021; Bears-Raiders matchup likely as teams additional game - Chicago Sun-Times - Bears will play the Raiders in Las Vegas in t… [+4312 chars]"}, {"label": 5, "content": "Wasn’t Godzilla always waaaaay bigger than King Kong? I know nothing about the new movie, and I understand the two historic monsters have faced each other in other flicks over the years. But am I cra… [+4207 chars]"}, {"label": 5, "content": "The Black Mamba's daughter is now a cardinal and gold Trojan ... Natalia Bryant just got accepted into USC on Tuesday -- and Vanessa says Kobe would've been \"so proud!\"\r\nVanessa shared the amazing ne… [+1719 chars]"}, {"label": 5, "content": "After two full days off, the Portland Trail Blazers finish their four-game road trip with a game against the lowly Detroit Pistons. The Pistons currently sit bottom of the Eastern Conference, and whi… [+2954 chars]"}, {"label": 5, "content": "After finishing 7-9 in 2020, the Patriots have been the big spenders of free agency, with the club signing several high-profile players.\r\nTeam owner Robert Kraft said recently that New England “alway… [+1015 chars]"}, {"label": 5, "content": "<table><tr><td>DE</td><td>Brian Burns</td><td>Marquis Haynes</td><td></td><td></td><td></td></tr><tr><td>DT</td><td>Morgan Fox</td><td>Bravvion Roy</td><td></td><td></td><td></td></tr><tr><td>DT</td>… [+2258 chars]"}, {"label": 5, "content": "The NCAA Womens Final Four will feature two Black female coaches for the first time in history.\r\nSouth Carolinas Dawn Staley and Arizonas Adia Barnes both led their teams to the national semifinals a… [+1946 chars]"}, {"label": 5, "content": "DETROIT -- Most of the players who made up last years Opening Day roster are still in the Detroit Tigers organization, although a good chunk of them are no longer in the big leagues.\r\nThats probably … [+4800 chars]"}, {"label": 5, "content": "With Iowa football getting back to spring practice this week, we took a way too early look at what to expect from the Hawkeyes this fall. If were going to be looking ahead, we figured why not REALLY … [+12425 chars]"}, {"label": 5, "content": "Opening Day is tomorrow, and we are wrapping up our picks for the upcoming season. Up first is a look at who we think will win each division, the NL and AL pennants and the World Series. Let us know … [+17782 chars]"}, {"label": 5, "content": "The Post’s Joel Sherman previews the AL East.\r\n1. New York Yankees\r\nO/U wins: 95.5\r\nKey player: Gerrit Cole. Behind the ace, the Yankees have such rotation uncertainty concerning health and six-month… [+8950 chars]"}, {"label": 5, "content": "Lets not beat around the bush: the Denver Nuggets have what it takes to win their first ever NBA championship this season. No joke, this team is really good and might be the most talented team in the… [+5157 chars]"}, {"label": 5, "content": "Gabe Jackson spent his entire career with the Raiders, first in Oakland, then in Las Vegas. Throughout his seven years, Jackson has enjoyed just one winning season.\r\nAfter his trade to the Seattle Se… [+1973 chars]"}, {"label": 5, "content": "AP Photo/Stephen Brashear\r\nA lot of Blythe’s technique has been influenced by his background in wrestling. Blythe is known as one of the most dominant high school wrestlers in the state of Iowa, earn… [+738 chars]"}, {"label": 5, "content": "Good morning Birdland,\r\nThe Orioles have done it yet again. They have made me excited to watch them play 162 games this summer despite there being plenty of evidence to suggest that they will, in fac… [+3941 chars]"}, {"label": 5, "content": "The Buffalo Sabres are 0-15-3 since Feb. 25. They own the record for the longest winless streak of the shootout era (since 2005-06) and have tied the 2003-04 Pittsburgh Penguins for the most consecut… [+8242 chars]"}, {"label": 0, "content": "MEDLI2 was one of the crucial technologies onboard the rover’s protective aeroshell that helped document the entry, descent, and landing of the spacecraft.\r\n“Tango Delta, touchdown confirmed, Perseve… [+6405 chars]"}, {"label": 0, "content": "The magnitude 3.3 and 3.1 temblors originated in a region called Cerberus Fossae, further supporting the idea that this location is seismically active.\r\nNASA’s InSight lander has detected two strong,… [+5642 chars]"}, {"label": 0, "content": "23 with 13 posters participating\r\nBetween 125,000 and 70,000 years ago, people began to do some very modern things: collecting small objects for no practical reason, decorating things with pigments, … [+4880 chars]"}, {"label": 0, "content": "US and European scientists have called off a controversial balloon test flight that was to take place in Sweden's far north in June, part of a disputed solar geoengineering experiment to artificially… [+2052 chars]"}, {"label": 0, "content": "Scientists have found evidence that some face masks that are on sale and being used by members of the general public are laced with toxic chemicals. \r\nPreliminary tests have revealed traces of a vari… [+13520 chars]"}, {"label": 0, "content": "Ben Penaflor is computer systems manager at General Atomics, which operates the DIII-D National Fusion Facility in San Diego, California, for the US Department of Energy. This post is part of a serie… [+7955 chars]"}, {"label": 0, "content": "Dark matter, the mysterious substance that exerts gravitational pull but emits no light, might really consist of vast concentrations of ancient black holes created at the very start of the universe, … [+4900 chars]"}, {"label": 0, "content": "In an Iron Age cemetery in what is now Sweden, two warriors who died during the seventh century A.D. were lavishly buried in boats with an unexpectedly luxurious touch: soft bedding stuffed with feat… [+4792 chars]"}, {"label": 0, "content": "One hundred years ago\r\n, it was easy to tell when something was a machine. Machines were hard and clanky, metallic, and pretty heavy, as developmental biologist Michael Levin tells Inverse.\r\nBut late… [+8073 chars]"}, {"label": 0, "content": "It is well known that climate-induced sea level rise is a major threat. New research has found that previous ice loss events could have caused sea-level rise at rates of around 3.6 meters per century… [+4006 chars]"}, {"label": 0, "content": "The tree of animal life had to begin somewhere. Finding that original branch amongst such a tangled canopy is harder than it sounds, though.\r\nA new analysis of genomic data suggests that one phylum i… [+5450 chars]"}, {"label": 1, "content": "Senate Minority Leader Mitch McConnell turns to an aide as the Senate Rules Committee holds a hearing at the Capitol in Washington, Wednesday, March 24, 2021. | AP Photo/J. Scott Applewhite\r\nMitch Mc… [+734 chars]"}, {"label": 1, "content": "Britney Spears' father has requested the pop star's estate cover the steep costs of his legal fees.\r\nIn a declaration recently filed by Jamie Spears' attorneys, the 39-year-old \"Toxic\" singer's fathe… [+2915 chars]"}, {"label": 1, "content": "Its a playground for imposters\r\nImage: Innersloth\r\nAmong Us huge Airship map finally arrived on Wednesday, offering new tasks for crewmates, new ways to get around, and new ways to plot against your … [+2449 chars]"}, {"label": 1, "content": "Vice President Harris and second gentleman Doug EmhoffDoug EmhoffThe Hill's Morning Report - GOP pounces on Biden's infrastructure planThe Hill's Morning Report - Biden seeks expanded government, tax… [+2128 chars]"}, {"label": 1, "content": "Officials offered an update about the Los Angeles-area mass shooting that left four people, including a child, dead Wednesday night.\r\nAuthorities provided some answers about the bloodbath at a two-st… [+1895 chars]"}, {"label": 1, "content": "Baseball this season should look and sound more like the sport you grew up with. Fans will be back -- to some extent -- in the stands. Pitchers will bat in the National League. And teams are slated t… [+14296 chars]"}, {"label": 1, "content": "Semiconductor equipment stocks surged higher on Thursday after the world's leading chip foundry, Taiwan Semiconductor Manufacturing Co. (TSM), announced plans to ramp up factory investments. Several … [+3075 chars]"}, {"label": 1, "content": "MEDLI2 was one of the crucial technologies onboard the rover’s protective aeroshell that helped document the entry, descent, and landing of the spacecraft.\r\n“Tango Delta, touchdown confirmed, Perseve… [+6405 chars]"}, {"label": 1, "content": "Michigan has identified its first case of the P.1 variant of COVID-19, which was first found in Brazil and is believed to be more contagious, like other variants of the virus.\r\nThe Michigan Departmen… [+1815 chars]"}, {"label": 1, "content": "Stocks rose early Thursday as the Dow Jones Industrial Average rallied more than 100 points and the S&amp;P 500 topped the 4,000 level for the first time.\r\nXThe Nasdaq rallied 1.5%, the S&amp;P 500 r… [+5950 chars]"}, {"label": 1, "content": "The magnitude 3.3 and 3.1 temblors originated in a region called Cerberus Fossae, further supporting the idea that this location is seismically active.\r\nNASA’s InSight lander has detected two strong,… [+5642 chars]"}, {"label": 1, "content": "Shipments coming into the EU could be affected for months, even with the ship freed from the Suez Canal blockage.\r\nVideo Elephant\r\nThe cost of blocking shipping for almost a week through one of the m… [+4373 chars]"}, {"label": 1, "content": "It says the shoes critique extreme collab culture\r\nImage: MSCHF\r\nInternet collective MSCHF says its not infringing on Nikes trademark with a pair of exclusive, blood-infused Satan Shoes, setting the … [+2212 chars]"}, {"label": 1, "content": "The NFL's competition committee has endorsed six potential rule changes for the 2021 season, including a proposal that would expand the scope of information that replay officials could provide to on-… [+3121 chars]"}, {"label": 1, "content": "TOKYO Last summer, Halmat Rozi, a Uyghur Muslim living in Japan, received a video call from his brother in Chinas western Xinjiang region. His brother said he had someone he wanted Mr. Rozi to meet: … [+876 chars]"}, {"label": 1, "content": "In a virtual kickoff event Thursday morning, Vice President Harris and Surgeon General Vivek H. Murthy introduced a grass-roots network of local leaders and prominent figures billed as the Covid-19 C… [+3683 chars]"}, {"label": 1, "content": "A measure of U.S. manufacturing activity soared to its highest level in more than 37 years in March, driven by strong growth in new orders, the clearest sign yet that a much anticipated economic boom… [+2680 chars]"}, {"label": 1, "content": "Details surrounding the claim by Rep. Matt Gaetz, R-Fla., that he is the victim of an extortion plot involving allegations of a sexual relationship with a 17-year-old now portend to connect it to a s… [+2487 chars]"}, {"label": 1, "content": "The Texas Senate in the early morning hours Thursday passed a package of election bills that would put new restrictions on voting in the state.\r\nThe final version of the Senate Bill 7 is not yet onli… [+2918 chars]"}, {"label": 1, "content": "NEW YORK (AP) Can I still spread the coronavirus after Im vaccinated?\r\nIts possible. Experts say the risk is low, but are still studying how well the shots blunt the spread of the virus.\r\nThe current… [+1812 chars]"}, {"label": 1, "content": "The home run is a bolt of lightning. Over before you know it.\r\nThe strikeout is a vacuum. The absence of something.\r\nThe rally is what we love most. We wear our hats askew, seek divine intervention a… [+8546 chars]"}, {"label": 1, "content": "All told, 3.8 million people were collecting traditional state benefits during the week ending March 20. If you include federal programs that are meant to help the unemployed through the health crisi… [+2757 chars]"}, {"label": 1, "content": "Matt Lorion, a 17-year-old TikTok influencer known for promoting cryptocurrencies online, has released a new video apologizing for a Star Wars-themed scam he promoted. Last week, Lorion sang the prai… [+3407 chars]"}, {"label": 1, "content": "Shortly after a group of Black business executives called on corporate America to do more in pushing back against restrictive voting bills making their way through state legislatures, a handful of Ge… [+3756 chars]"}, {"label": 1, "content": "The COVID-19 pandemic pushed total U.S. deaths last year beyond 3.3 million, the nations highest annual death toll, the government reported Wednesday.\r\nThe coronavirus caused approximately 375,000 de… [+2491 chars]"}, {"label": 1, "content": "Despite its tussle over civil liberties at home, Apple has had to cave to government orders from autocratic states overseas. Last month, it agreed to show Russian users a prompt to preinstall select … [+1527 chars]"}, {"label": 1, "content": "MINNEAPOLIS The woman who was in a relationship with George Floyd for three years took the witness stand Thursday morning, recounting their first kiss, first date and final phone call to jurors in th… [+11436 chars]"}, {"label": 1, "content": "A U.N. special envoy warned the 15-nation Security Council on Wednesday that \"a bloodbath is imminent\" in Myanmar if it does not act to curb the violent military crackdown against protesters, accordi… [+4607 chars]"}, {"label": 1, "content": "Your Android phone's camera can rid you of receipt clutter.\r\nAndrew Hoyle/CNET\r\nGone are the days of trying to find a scanner, or even worse, cluttering up your desk with one of those printer/scanner… [+4610 chars]"}, {"label": 2, "content": "AUGUSTA, Maine —Gov. Janet Mills announced Thursday that all Mainers 16 and older will be eligible for a COVID-19 vaccine beginning April 7.\r\nMills said the state is accelerating its vaccine due to a… [+1483 chars]"}, {"label": 2, "content": "Genomic study finds cancer-linked variants in Bernese mountain dogs, Rottweilers, and retrievers.\r\nSix genetic variants add up to determine the risk of several blood cancers in pre-disposed dog breed… [+3368 chars]"}, {"label": 2, "content": "US newsUS has tallied on average 63,000 new cases daily over the past week while only five states have seen declines in new infections\r\nThe US could be in the early stages of a fourth wave of the Cov… [+4507 chars]"}, {"label": 2, "content": "SIOUX FALLS, S.D. (KELO) Active cases and current hospitalizations are down in South Dakota, as three new deaths were announced by the state department of health on Thursday.\r\nAccording to the latest… [+1651 chars]"}, {"label": 2, "content": "Michigan has identified its first case of the P.1 variant of COVID-19, which was first found in Brazil and is believed to be more contagious, like other variants of the virus.\r\nThe Michigan Departmen… [+1815 chars]"}, {"label": 2, "content": "Scientists at Harvard University say they might have figured out how stress can cause us to lose our hair. In mice, they found evidence that a major hormone linked to stress made it harder for hair f… [+3757 chars]"}, {"label": 2, "content": "Public health specialists offer a wide range of estimates when suggesting the target number of people who must be protected from COVID-19 for herd immunity to stamp out the virus, rangingfrom 60 to 9… [+6837 chars]"}, {"label": 2, "content": "Did you have luck finding an appointment today? Tell us how you did it by emailing agraff@sfgate.com.California opened up vaccine eligibility to individuals 50 and over today. In addition, everyone 1… [+4300 chars]"}, {"label": 2, "content": "A big question among parents and teachers as more schools reopen is when their kids will be vaccinated against COVID-19. Some have wondered whether the vaccine is even necessary for children. There i… [+6414 chars]"}, {"label": 2, "content": "Its just a matter of time before the highly contagious UK COVID-19 variant wreaking havoc around the world surges in the US, a leading epidemiologist warned Thursday.\r\nThis B.1.1.7 surge is going to … [+1909 chars]"}, {"label": 2, "content": "NEW YORK (AP) Can I still spread the coronavirus after Im vaccinated?\r\nIts possible. Experts say the risk is low, but are still studying how well the shots blunt the spread of the virus.\r\nThe current… [+1812 chars]"}, {"label": 2, "content": "ANTWERP, Belgium (AP) One year into the pandemic, just about everyones travel experience has changed. \r\nSo its not surprising that someone came up with this: Instead of a cabin on a Mediterranean cru… [+1388 chars]"}, {"label": 2, "content": "Scientists have found evidence that some face masks that are on sale and being used by members of the general public are laced with toxic chemicals. \r\nPreliminary tests have revealed traces of a vari… [+13520 chars]"}, {"label": 2, "content": "COVID-19 is unpredictable. When you contract the virus, it can seem like a dice roll whether you'll have only minor symptoms or develop a serious case and need to be hospitalized. People of every age… [+3897 chars]"}, {"label": 2, "content": "As the beginning of this years pollen season coincides with yet another troubling increase in new coronavirus infections, weve compiled answers to some of the most commonly asked questions about alle… [+10563 chars]"}, {"label": 2, "content": "The COVID-19 pandemic pushed total U.S. deaths last year beyond 3.3 million, the nations highest annual death toll, the government reported Wednesday.\r\nThe coronavirus caused approximately 375,000 de… [+2491 chars]"}, {"label": 2, "content": "Most of us probably think of salads as part of a healthy diet, while regarding sugary snacks as something to be enjoyed in moderation because they're bad for our body. If you've got a sweet tooth, ta… [+3303 chars]"}, {"label": 2, "content": "Administration officials said their research showed that vaccine messaging from medical professionals and community leaders, rather than from celebrities or the president, was often more persuasive.\r… [+1586 chars]"}, {"label": 2, "content": "RIO DE JANEIRO (AP) The Rev. Celio Ricardo has spent nearly two decades helping drug addicts get off crack cocaine. Now hes trying to bring spiritual support to victims of another scourge afflicting … [+2011 chars]"}, {"label": 2, "content": "Finding an appointment for a COVID-19 vaccine could be a bit tricky, especially since some counties have different ways of allowing sign-ups compared to others.\r\n<ul><li>But there is one interesting … [+1562 chars]"}, {"label": 2, "content": "SAN FRANCISCO, Calif. (KRON) — Getting the COVID-19 vaccine is often quick, once you have an appointment — but getting that appointment can be difficult. There are several ways to look.\r\nFirst, check… [+1258 chars]"}, {"label": 2, "content": "TAMPA, Fla. (WFLA) – With Spring in full bloom, so too are seasonal allergies. \r\nFrom the sneezing, the itchy eyes, scratchy throat and coughing. \r\nExperts say it’s a tough time of the year for many … [+1922 chars]"}, {"label": 2, "content": "The Downtown San Luis Obispo Farmers' Market will return on Thursday, May 6th with fewer vendors and a smaller footprint.\r\nAfter a year without operation, the Farmers' Market will open in phases befo… [+2286 chars]"}, {"label": 2, "content": "Everyone age 50 and older can sign up for COVID-19 vaccine appointments in Santa Barbara County as of Tuesday, and eligibility will finally open up to all Californians 16 and up on April 15.\r\nTens of… [+5969 chars]"}, {"label": 2, "content": "What happened\r\nShares of Moderna (NASDAQ:MRNA) surged 10.5% Wednesday after the National Institutes of Health (NIH) began testing the drugmaker's experimental COVID-19 variant vaccine. \r\nSo what\r\nMod… [+1620 chars]"}, {"label": 2, "content": "Four out of five eligible Angelenos could be vaccinated against COVID-19 by the end of June, assuming a sufficient number of doses flows into Los Angeles County, a top health official said this week.… [+3161 chars]"}, {"label": 3, "content": "United Airlines on Thursday told staff it will soon begin hiring hundreds of pilots a process the airline was forced to halt when coronavirus pandemic devastated travel demand last year, according to… [+1042 chars]"}, {"label": 3, "content": "President Joe Biden has requested that Education Secretary Miguel Cardona prepare a report on the president's legal authority to cancel up to $50,000 in student debt per borrower, White House chief o… [+3472 chars]"}, {"label": 3, "content": "The time is ripe to pounce on Amazon's stock, argues Guggenheim analyst Robert Drbul. \r\n\"Over the past six months, Amazon shares have declined ~2% vs. a 19% increase for the S&amp;P 500. While the co… [+3012 chars]"}, {"label": 3, "content": "In late 2018, Microsoft struck a $480 million deal with the U.S. Army to deliver augmented reality headset prototypes based on its HoloLens system. Well, it appears the military is a fan because its … [+4245 chars]"}, {"label": 3, "content": "Definition would capture virtually all modern cellphones\r\nPhoto by Amelia Holowaty Krales\r\nThe Supreme Court has unanimously decided that Facebook text message alerts dont violate laws against unwant… [+1514 chars]"}, {"label": 3, "content": "OPEC and an alliance of other top oil producers agreed to boost their collective production over the next three months, according to people familiar with the discussions, betting on a return of deman… [+1068 chars]"}, {"label": 3, "content": "Semiconductor equipment stocks surged higher on Thursday after the world's leading chip foundry, Taiwan Semiconductor Manufacturing Co. (TSM), announced plans to ramp up factory investments. Several … [+3075 chars]"}, {"label": 3, "content": "The future of the suburban shopping mall could look something like a mini community, with far fewer places to shop.\r\nThe U.S. mall owner Macerich announced Thursday it's sold a majority stake in Para… [+2949 chars]"}, {"label": 3, "content": "Stocks rose early Thursday as the Dow Jones Industrial Average rallied more than 100 points and the S&amp;P 500 topped the 4,000 level for the first time.\r\nXThe Nasdaq rallied 1.5%, the S&amp;P 500 r… [+5950 chars]"}, {"label": 3, "content": "Apple(NASDAQ:AAPL) is building a massive battery storage project at its California solar-panel farm using Tesla's (NASDAQ:TSLA) utility-scale Megapack batteries as its storage system.\r\nTechnology new… [+1636 chars]"}, {"label": 3, "content": "An Emergent BioSolutions facility on Thursday in Baltimore.\r\nTasos Katopodis/Getty Images\r\nJohnson &amp; Johnson is reporting a setback in its effort to produce tens of millions of COVID-19 vaccine d… [+3806 chars]"}, {"label": 3, "content": "(Bloomberg) -- The corporate tax-cut party President Donald Trump kicked off will soon be over if his successor proves able to enact proposals to roll back half of the 2017 domestic income-tax reduct… [+7124 chars]"}, {"label": 3, "content": "The COVID-19vaccine developed by Pfizer and partnering biotechnology company BioNTech has proven \"highly effective\" against the coronavirus including variants for at least six months after full inocu… [+1618 chars]"}, {"label": 3, "content": "A San Diego businesswoman whose Ponzi scheme bilked hundreds of people out of nearly $400 million was sentenced Wednesday to 15 years in federal prison.\r\nGina Champion-Cain, 57, received more than th… [+2689 chars]"}, {"label": 3, "content": "Volkswagen, in an apologetic move due to all the frenzy created by its fake name change, has decided to make right by using the Voltswattsen name globally.\r\nFirst off, rumors swirled regarding the na… [+3642 chars]"}, {"label": 3, "content": "Shares of AMC Entertainment fell as much as 5% on Thursday after the company's CEO updated CNBC on its plans to seek shareholder approval to authorize an additional 500 million shares.\r\nAMC has navig… [+2375 chars]"}, {"label": 3, "content": "With Alaska Airlines having just joined the oneworld alliance, there’s an exciting development when it comes to redeeming British Airways Avios for travel on the Seattle-based airline.\r\nRedeem Avios … [+2782 chars]"}, {"label": 3, "content": "LONDON Tens of thousands of amateur investors have been left wondering whether they were right to snap up the stock of food delivery app Deliveroo.\r\nShares of British start-up Deliveroo on Wednesday … [+6969 chars]"}, {"label": 3, "content": "Several over-the-counter Covid-19 tests were authorized Thursday by the Food and Drug Administration for use without a prescription, offering a way for schools, workplaces and other groups to conduct… [+2308 chars]"}, {"label": 3, "content": "SACRAMENTO, Calif. —Starting Thursday, all Californians 50 and older are now eligible for the COVID-19 vaccine. \r\nEveryone ages 16 or older will be eligible on April 15. What remains an issue in the … [+4148 chars]"}, {"label": 3, "content": "Warren Buffett and Elon Musk.\r\nAlex Wong/Getty, REUTERS/Rebecca Cook\r\n<ul><li>Elon Musk slated Warren Buffett's Texas power plan as \"crazy.\"</li><li>He called for the state to use Tesla Megapacks to … [+2374 chars]"}, {"label": 3, "content": "A measure of U.S. manufacturing activity soared to its highest level in more than 37 years in March, driven by strong growth in new orders, the clearest sign yet that a much anticipated economic boom… [+2680 chars]"}, {"label": 3, "content": "Cryptocurrency markets have matured in the past 12 months, with macroeconomics and blockchain-technology developments influencing prices more than ever and new Wall Street firms buying in seemingly e… [+2473 chars]"}, {"label": 3, "content": "Hyundai and Kia are back to setting sales records, CarMax is buying Edmunds, the chip shortage is really bad news for Ford and the F-150, and Tesla. All that and more in The Morning Shift for April 1… [+8898 chars]"}, {"label": 3, "content": "Shares of collectible toymaker and pop culture company Funko Inc (NASDAQ:FNKO) are trading higher after unveiling a plan for NFTs.\r\nWhat Happened: Less than a month after confirming the company was w… [+1956 chars]"}, {"label": 3, "content": "All told, 3.8 million people were collecting traditional state benefits during the week ending March 20. If you include federal programs that are meant to help the unemployed through the health crisi… [+2757 chars]"}, {"label": 3, "content": "Here at The Motley Fool, April 1 might just be our favorite day of the year. And virtually every year since our company launched in 1993 we've run a joke for April Fool's. \r\nOur very first April Fool… [+4410 chars]"}, {"label": 3, "content": "My mother never cared for cheap Easter candy, but she loved to eat the dyed eggs. As a child, this shocked and perplexed me, and not just because I preferred chocolate. It simply did not seem sanitar… [+1557 chars]"}, {"label": 3, "content": "It turns out that children who attend schools with mask requirements are likely just as safe from COVID-19 sitting just 3 feet from each other and not the 6 feet previously recommended by the Centers… [+10568 chars]"}, {"label": 3, "content": "Based on data compiled by Credible Operations, Inc., NMLS Number 1681276, current mortgage refinance rates remain stable compared to yesterday’s — with the exception of 10-year rates which have dropp… [+4800 chars]"}, {"label": 3, "content": "Its all treats and no tricks at Chipotle on April 1.\r\nThe popular chain is giving away $100,000 in free burritos and $100,000 in Bitcoin to celebrate National Burrito Day, which happens to fall on Ap… [+1207 chars]"}, {"label": 3, "content": "Frontier Airlines raised $570 million in an initial public offering, the latest U.S. carrier to take that route as the industry starts to see signs of a recovery, the company said late Wednesday.\r\nTh… [+290 chars]"}, {"label": 3, "content": "Establishing an intelligent clinical development program pathway from the start is vital for clarity around the complex processes required to achieve product registration.\r\nThe Drug Development Plan … [+536 chars]"}, {"label": 3, "content": "Investors are always on the lookout for the next big thing, the next industry that will bring the great returns. Predicting what stock sector will blast off is an inexact science, at best; but like p… [+10945 chars]"}, {"label": 3, "content": "<ul><li>\r\n</li><li>\r\n</li><li>\r\n</li><li>\r\n</li></ul>\r\nRating Action: Moody's upgrades Paysafe to B1; stable outlookGlobal Credit Research - 01 Apr 2021London, 01 April 2021 -- Moody's Investors Serv… [+23059 chars]"}, {"label": 3, "content": "Because of the coronavirus pandemic, 2020 may be a tax year like no other. Here are answers to some of your top questions.\r\nUSA TODAY\r\nHow much do Americans pay to Uncle Sam in taxes in their lifetim… [+1362 chars]"}, {"label": 3, "content": "Michael Corkery contributed reporting.\r\nThe Daily is made by Theo Balcomb, Lisa Tobin, Rachel Quester, Lynsea Garrison, Annie Brown, Clare Toeniskoetter, Paige Cowett, Michael Simon Johnson, Brad Fis… [+703 chars]"}, {"label": 3, "content": "(Newser)\r\nMore than a year into the pandemic, toilet paper prices are going up—not because people are still hoarding it, but because commodity prices are rising, according to Kimberley-Clark Corporat… [+479 chars]"}, {"label": 3, "content": "Boardrooms still aren't taking cybersecurity seriously, leaving organisations vulnerable to cyberattacks with executives only paying attention after things have gone bad, according to the new Nationa… [+2835 chars]"}, {"label": 3, "content": "U.S. Treasury yields fell on Thursday morning, with the 10-year yield dropping below 1.7% to start the month of April. \r\nThe yield on the benchmark 10-year Treasury note dipped to 1.679% at around 3:… [+2254 chars]"}, {"label": 3, "content": "Cathie Woods Ark Investment Management sends out an email every night listing the stocks that were bought or sold by the firm's ETFs that day. In recent months, the emails have known to cause certain… [+4523 chars]"}, {"label": 3, "content": "Ford Motor Co said on Wednesday, while announcing the latest North American production cuts at seven assembly plants due to the global chip shortage, that it would provide an update on April 28 to th… [+3423 chars]"}, {"label": 3, "content": "LONDON European stocks advanced on Thursday amid a raft of data releases from the region.\r\nThe pan-European Stoxx 600 was up 0.4% during afternoon trade, with tech stocks climbing 1.6% to lead gains,… [+1863 chars]"}, {"label": 3, "content": "CHICAGO (WLS) -- As the number of reported cases of COVID-19 continues to rise in Chicago, Mayor Lori Lightfoot warned that any further reopening plans are in jeopardy if that trend does not change.T… [+2554 chars]"}, {"label": 3, "content": "The Multnomah County District Attorney's Office on Wednesday announced that 35-year-old Dereck Conant pleaded guilty to one count of unlawful use of a motor vehicle for stealing the catalytic convert… [+2538 chars]"}, {"label": 3, "content": "Workers cross in front of the Spheres on the Amazon campus in downtown Seattle, before the pandemic forced employees to work from home. (GeekWire Photo / Kurt Schlosser)\r\nAs GeekWire reported earlier… [+3920 chars]"}, {"label": 4, "content": "Lee MacMillan, an influencer known for documenting her travels around the world in a van, has died by suicide.\r\nAccording to local ABC and FOX news affiliate KEYT, Lee was 28 years old and was found … [+2190 chars]"}, {"label": 4, "content": "Britney Spears' father has requested the pop star's estate cover the steep costs of his legal fees.\r\nIn a declaration recently filed by Jamie Spears' attorneys, the 39-year-old \"Toxic\" singer's fathe… [+2915 chars]"}, {"label": 4, "content": "Keeping Up With The Kardashians 20 seasons has shown the ups and the downs of Kourtney Kardashian and Scott Disick's rocky romance.\r\nAnd during the latest teaser for the final season of the series, K… [+4340 chars]"}, {"label": 4, "content": "Downton Abbey vet Dan Stevens is plugging a big hole in Gaslit, signing on to replace embattled actor Armie Hammer in Starz’ forthcoming Julia Roberts-Sean Penn drama series.\r\nGaslit, which hails fro… [+1440 chars]"}, {"label": 4, "content": "Amy Winehouses mother has come forward to share her late daughters story.\r\nOn Wednesday, the BBC announced that Janis Winehouse will be releasing a documentary about the singer titled \"Amy Winehouse:… [+2302 chars]"}, {"label": 4, "content": "Last October marked the 20th anniversary of CSI: Crime Scene Investigation, an occasion that CBS apparently didnt even realize was coming up until somebody at Jerry Bruckheimers production company ge… [+1618 chars]"}, {"label": 4, "content": "NFL phenom Patrick Mahomes may still be only 25 years old, but even his youthful healthy self will have to alter how he trains to make it successfully through the NFL's new 17 game regular season. \r\n… [+2946 chars]"}, {"label": 4, "content": "Mia Farrow took to Twitter on Wednesday to address \"vicious rumors\" regarding the deaths of three of her 14 children.\r\n\"Few families are perfect, and any family who has suffered the loss of a child k… [+3648 chars]"}, {"label": 4, "content": "Just in time for Easter, The Unholy offers up satanic counter-programming to sate the appetites of the religious horror faithful. Almost a decade after getting drawn into a dybbuk haunting in The Pos… [+6655 chars]"}, {"label": 4, "content": "When Wyatt Russell was cast as the new Captain America, it wasnt without caveats. For one, hes not really Captain America, depending on who in The Falcon And The Winter Soldier you ask. That role was… [+6734 chars]"}, {"label": 4, "content": "It says the shoes critique extreme collab culture\r\nImage: MSCHF\r\nInternet collective MSCHF says its not infringing on Nikes trademark with a pair of exclusive, blood-infused Satan Shoes, setting the … [+2212 chars]"}, {"label": 4, "content": "The American bishop who presided over the 2018 marriage of Prince Harry and Meghan, Duchess of Sussex, has given his take on the couple's bombshell interview with Oprah Winfrey last month.\r\nThe Most … [+2244 chars]"}, {"label": 4, "content": "Sofia Vergara's ex Nick Loeb on Monday lost his final appeal in Los Angeles to gaining custody of frozen pre-embryos the former couple created while they dated.\r\nVergara, 48, and Loeb, 45, ended thei… [+2694 chars]"}, {"label": 4, "content": "The show Justin Bieber put on for a group of SoCal inmates was less about song and dance, and more about sitting and listening ... as photos of his recent prison visit reveal.\r\nTMZ's obtained pics sh… [+1049 chars]"}, {"label": 4, "content": "“Godzilla vs. Kong” debuted in U.S. cinemas on Wednesday and nabbed a sizable $9.6 million, marking the best opening day total of the coronavirus era.\r\nThe monster mashup — from Warner Bros. and Lege… [+3116 chars]"}, {"label": 4, "content": "It may be April 1, but we're still in the middle of Aries season, astrologically speaking! (Don't worry, no pranks here!)\r\nThe fiery Aries energy continues to ramp up throughout the start of the mont… [+1003 chars]"}, {"label": 4, "content": "That means he needs as many of those fans as possible to get vaccinated. In a CBS News poll published in March, 33% of Republican voters surveyed said they had no intention of getting a shot, compare… [+3009 chars]"}, {"label": 4, "content": "Hilary Duff knows that family always comes first.\r\nAnd the 33-year-old actress enjoyed a nice day outdoors with her youngest children and husband Matthew Koma on Wednesday afternoon.\r\nThe former musi… [+4678 chars]"}, {"label": 4, "content": "In lieu of official numbers, we’ve looked at the best data available on Zack Snyder’s Justice League’s ratings on HBO Max. HBO Max\r\nNever before in the history of cinema has a second take on a box of… [+13485 chars]"}, {"label": 4, "content": "An Emmy-winning production designer who was known to be a hoarder has been found dead under a pile of garbage in her New York City home.\r\nEvelyn Sakash, 66, was found Tuesday lying on her kitchen flo… [+792 chars]"}, {"label": 4, "content": "Very cheeky.\r\nBella Hadid and Irina Shayk walked the runway in a virtual Mugler show this week, rocking peekaboo thong jeans with illusion Lycra panels.\r\nThe models kicked butt for the French fashion… [+1646 chars]"}, {"label": 4, "content": "Migos rapper Quavo can be seen pushing his former girlfriend Saweetie in viral leaked footage from an elevator security camera. The video, obtained by TMZ, is from an apartment complex in North Holly… [+1449 chars]"}, {"label": 4, "content": "Netflix reportedly dropped big money to acquire two sequels to Rain Johnson's Oscar-nominated 2019 mystery film \"Knives Out.\" \r\nDetective Benoit Blanc's next cases will therefore drop exclusively on … [+2311 chars]"}, {"label": 4, "content": "Kylie Jenner is helping to improve the lives of teens fighting cancer.\r\nThe 23-year-old Kylie Cosmetics founder donated $500,000 to Teen Cancer America that has helped launch a new lounge for teen ca… [+2530 chars]"}, {"label": 4, "content": "An abolitionist lithograph of the slave trade in Washington, D.C., with the U.S. Capitol in the background. Library of CongressThe summer of 2020 was not the first time America saw protests and viole… [+7174 chars]"}, {"label": 4, "content": "In the spring of 2015, two years before Krista Vernoff took the reins at Grey's Anatomy, she was hard at work on a pilot for Fox that veered dangerously close to her own story.\r\nStudio City, as the s… [+22564 chars]"}, {"label": 4, "content": "When modern readers lambast the American literary canon, theyre probably complaining at least partially about Ernest Hemingway. The Hemingway clichés are easy to rattle off: a thrill seeker who fetis… [+8487 chars]"}, {"label": 4, "content": "The trailer of Madhavan’s much-awaited film Rocketry is out and it looks like an intense biopic. Rocketry is an important milestone in his film career as it marks his debut as a director. In addition… [+1864 chars]"}, {"label": 4, "content": "Sharon Stone had to cross state lines into Ohio to get an abortion at 18 years old.\r\nThe “Basic Instinct” star, who grew up in Pennsylvania and went to high school and college in the Keystone State, … [+1602 chars]"}, {"label": 4, "content": "Kobe Bryant’s former Irvine, California, home is back on the market for $2.6 million less than six months after it first sold. \r\nAnd the home has definitely received a makeover. \r\nThe three-bedroom, … [+2552 chars]"}, {"label": 4, "content": "Not long after revealing the layout of the proposed expansion and remodeling of the Disney Village at Disneyland Paris, OutsideEars is at it again, this time showing us concept art for the long overd… [+1165 chars]"}, {"label": 4, "content": "Nike is waging an all-out war with the devil. The apparel company has successfully blocked the sale of Lil Nas X's \"Satan Shoes\" — at least for now.\r\nOn Wednesday, a U.S. District Court approved Nike… [+3490 chars]"}, {"label": 4, "content": "\"Wheel of Fortune\" fans are upset after a technicality cost yet another contestant a win. \r\nA rule that was introduced in 2016 along with the long-running game shows crossword puzzle format has been … [+2956 chars]"}, {"label": 4, "content": "Calling all poets even and especially if you don't call yourself one. Use #NPRpoetry to send us your mini poems and we'll feature some of your submissions each week of April.\r\nbortonia/Getty Images\r\n… [+1199 chars]"}, {"label": 4, "content": "Bindi Irwin and her husband, Chandler Powell, are totally smitten with their newborn daughter, Grace Warrior!\r\nThe proud parents took to Instagram on Thursday morning to celebrate the first week of t… [+1257 chars]"}, {"label": 4, "content": "She's an established actress in her own right, but Isla Fisher said she's often confused for Amy Adams. \r\nIn an interview with The Project on Thursday, the 45-year-old actress said she's learnt to la… [+3173 chars]"}, {"label": 4, "content": "Adult Swim kicked off this year's April Fools shenanigans with a preview of Rick and Morty Babies, a kid-friendly version of the network's animated sci-fi sitcom.Rick and Morty Babies played peek-a-b… [+1816 chars]"}, {"label": 4, "content": "Every month, tons of new movies and TV shows become available to stream for free for U.S. subscribers to Netflix, HBO Max, Amazon Prime, and Hulu. With so many different streaming services, it can be… [+12399 chars]"}, {"label": 4, "content": "When I admit 30 seconds into my Zoom call with Gail Simmons that I have just finished bingeing all 17 seasons of Top Chef in preparation for this weeks highly anticipated 18th season premiere, she is… [+17532 chars]"}, {"label": 4, "content": "By Mark SavageBBC music reporter\r\nimage captionPaul Simon, pictured at the 2011 Glastonbury Festival, announced his retirement from touring in 2018\r\nPaul Simon has sold his entire song catalogue to S… [+2620 chars]"}, {"label": 4, "content": "I would never even remotely compare myself to Joaquin Phoenix.\""}, {"label": 4, "content": "Image via Getty/Mike Marsland/Mike Marsland/WireImage\r\nAs he prepares to begin production for Black Panther 2, director Ryan Coogler opened up about the long-awaited sequel and the decision to move f… [+2066 chars]"}, {"label": 4, "content": "Actor Chet Hanks and his ex-girlfriend Kiana Parker have taken legal action against one another following a violent altercation between the two at their Texas home in January.\r\nA judge in Fort Bend C… [+2435 chars]"}, {"label": 4, "content": "A virus-themed episode of Nickelodeon’s animated series SpongeBob SquarePants has been pulled in the wake of the coronavirus pandemic, as NBC News reports.\r\nThe episode, “Kwarantined Crab,” will not … [+1358 chars]"}, {"label": 4, "content": "The Turtle, Night Angel and Frog faced off for \"The Masked Singer\" crown.\r\nUSA TODAY\r\nSpoiler alert! The following contains details from the March 31 episode of \"The Masked Singer,\" including the ide… [+6702 chars]"}, {"label": 4, "content": "Americas sweetheartRandall Park is set to make his directorial debut with a film adaptation of Adrian Tomines graphic novel Shortcomings. Tomine is penning the screenplay in addition to executive-pro… [+635 chars]"}, {"label": 4, "content": "USA TODAY spoke to star Christian Serratos about the new Netflix series \"Selena: The Series\" about the late Tejano singer Selena Quintanilla-Perez.\r\nUSA TODAY\r\nSelena Quintanilla-Pérez's widower, Chr… [+3557 chars]"}, {"label": 5, "content": "MILWAUKEE -- After working through a COVID scare on the eve of Opening Day, the Brewers set an initial 26-man roster on Thursday with no last-minute surprises.\r\nInfielder Luis Urías and reliever Drew… [+6562 chars]"}, {"label": 5, "content": "The Ravens are tireless and creative in their pursuit of improvement, and that also extends to the NFL's rules.\r\nThe NFL released the full list of rule proposals to be reviewed and voted on at this y… [+1736 chars]"}, {"label": 5, "content": "DETROIT -- Miguel Cabrera could join baseballs prestigious 500-homer club this season. On Thursday, he added a Snow-pening Day homer to his career milestones.\r\nIt might also be the first home run dur… [+1893 chars]"}, {"label": 5, "content": "Robert Kraft did not pull many punches in his latest media availability.\r\nThe longtime Patriots owner didn’t hide from his disappointment about New England’s poor 2020 season and spoke rather candidl… [+1858 chars]"}, {"label": 5, "content": "In an attempt to force the sale of the Chargers, a sister of controlling owner Dean Spanos filed a petition in Los Angeles County Superior Court on Thursday arguing that mounting debt has imperiled t… [+6020 chars]"}, {"label": 5, "content": "Why arent you wearing your [Aaron] Judge shirt, was the first full sentence my husband uttered to me this morning before I had a chance to finish my morning coffee or compose any real thought other t… [+3679 chars]"}, {"label": 5, "content": "Baseball this season should look and sound more like the sport you grew up with. Fans will be back -- to some extent -- in the stands. Pitchers will bat in the National League. And teams are slated t… [+14296 chars]"}, {"label": 5, "content": "Todd McShay doesn’t believe the Patriots will wait around on Day 1 of the 2021 NFL Draft and hope their next franchise quarterback falls in their lap.\r\nNew England enters this month’s draft with a ne… [+1903 chars]"}, {"label": 5, "content": "TAMPA, Fla. -- Tampa Bay Buccaneers general manager Jason Licht said Thursday that quarterback Tom Brady is progressing \"very well\" in his recovery from offseason knee surgery, described as a \"minor … [+978 chars]"}, {"label": 5, "content": "Toss a helmet? Tossed from the game.\r\nAvalanche star Nathan Mackinnon was promptly ejected from Wednesdays game against the Coyotes when he threw Conor Garlands own helmet right back at him during a … [+579 chars]"}, {"label": 5, "content": "A trio of college basketball players met with NCAA president Mark Emmert on Thursday and asked the association to adopt a temporary blanket waiver that would allow all athletes to make money from end… [+3812 chars]"}, {"label": 5, "content": "The question that all Cincinnati Bengals fans want answered is, who are the Bengals expecting to take on NFL Draft night?\r\nMost of the talk has been the potential of Joe Burrow and JaMarr Chase reuni… [+1370 chars]"}, {"label": 5, "content": "Deshaun Watsons lawyer Rusty Harden took a shot at Tony Buzbee, the attorney for the women who have filed sexual misconduct lawsuits against the NFL star, over him failing to submit evidence to Houst… [+2675 chars]"}, {"label": 5, "content": "The Cincinnati Reds waited until Thursday morning to announce their Opening Day roster because they wanted to make sure Joey Votto was ready to play in regular-season games after a quick ramp-up in t… [+1500 chars]"}, {"label": 5, "content": "Georgia Governor Brian Kemp slammed President Joe Biden's suggestion that the MLB All-Star Game should be pulled out of Georgia as a \"distraction\" from his administration's handling of the crisis at … [+1659 chars]"}, {"label": 5, "content": "The Reds announced this morning that they’ve selected the contract of infielder Jonathan India and cleared a spot on the 40-man roster by designating right-hander Edgar Garcia for assignment. Cincinn… [+1187 chars]"}, {"label": 5, "content": "Roy Williams, who has led North Carolina to three NCAA titles in his 33 seasons as a college basketball head coach, is retiring, the school announced Thursday.\r\nThe 70-year-old Williams, after a 48-y… [+6232 chars]"}, {"label": 5, "content": "Cade Cunningham used to see superstars when he watched NBA players.\r\nNow, he sees opponents. They soon will see him, too.\r\nCunningham announced Thursday that he will enter the NBA draft after a dynam… [+2974 chars]"}, {"label": 5, "content": "The start of the Mets 2021 season is in limbo after Major League Baseball postponed Thursdays Opening Night due to COVID-related issues among the Nationals and announced that, out of an abundance of … [+731 chars]"}, {"label": 5, "content": "Prior to Wednesday night, Marc Gasol had started in all 38 games hed played since joining the Los Angeles Lakers on a two-year deal over the summer. Against the Milwaukee Bucks, that changed, as new … [+4922 chars]"}, {"label": 5, "content": "BOSTON —The Red Sox home opener that was scheduled for Thursday has been postponed to Friday due to rain. \r\nThe decision to postpone our first game of the season was not made lightly, Red Sox Preside… [+3195 chars]"}, {"label": 5, "content": "Texas is hiring Texas Tech coach Chris Beard to the same position for the Longhorns, according to CBS Sports' Matt Norlander. Beard will succeed Shaka Smart as the Texas coach after Smart left to tak… [+1720 chars]"}, {"label": 5, "content": "BOSTON -- The Red Sox and Orioles will have to wait one more day to start the 2021 season at Fenway Park.\r\nRather than have fans sit in rainy weather for what was supposed to be Opening Day on Thursd… [+1993 chars]"}, {"label": 5, "content": "There is no worse day on the Internet than April 1st, where people take time out of their day to prank hapless sports fans on this day known as April Fool’s Day. And there’s no NFL franchise that’s e… [+1113 chars]"}, {"label": 5, "content": "The San Francisco 49ers continue to be the focus of the NFLs rumor mill after trading up to acquire the No. 3 overall pick in the 2021 NFL Draft from the Miami Dolphins.\r\nNot only are the talks focus… [+3048 chars]"}, {"label": 5, "content": "Detroit Tigers manager AJ Hinch discusses Wednesday, March 31, 2021, the expectations for his team entering the season.\r\nDetroit Free Press\r\nTwo years ago, Detroit Tigers outfielder Christin Stewart … [+3962 chars]"}, {"label": 5, "content": "T.Y. Hilton had strong chemistry with retired Colts quarterback Andrew Luck. The two were a part of the same 2012 draft class, and their performances helped lead Indianapolis to four playoff appearan… [+1128 chars]"}, {"label": 5, "content": "The Tampa Bay Buccaneers have made an offer to wide receiver Antonio Brown. The issue, however, is that the two sides aren't close in terms of compensation. \r\nOn NFL Network's 'Good Morning Football,… [+1471 chars]"}, {"label": 5, "content": "Back in January, two Democratic senators introduced federal legislation called the College Athlete Bill of Rights.\r\nAmong a long list of reforms, there was one item that jumped out as a potential gam… [+5484 chars]"}, {"label": 5, "content": "Phillies manager Joe Girardi has posted his opening day lineup for todays 3 p.m. start against the Atlanta Braves.\r\nThe lineup is about as expected. Girardi answered the only real mystery by giving A… [+1270 chars]"}, {"label": 5, "content": "CLEVELAND, Ohio Former Browns coach Hue Jackson made headlines earlier this week after he said in a radio interview that he was lied to by Browns owner Jimmy Haslam.\r\nJackson said Haslam gave him a c… [+1216 chars]"}, {"label": 5, "content": "Detectives with the Los Angeles County Sheriff's Department have determined the cause of Tiger Woods' Feb. 23 car crash but those findings will not be revealed to the public.\r\nSheriff Alex Villanueva… [+1755 chars]"}, {"label": 5, "content": "Borussia Dortmund<ul><li>Manchester City and Chelsea strong contenders to sign striker</li><li>Dortmund want at least 150m for striker this summer</li></ul>\r\nErling Braut Haalands agent, Mino Raiola,… [+2116 chars]"}, {"label": 5, "content": "It may be cold outside and Anthony Rizzo may not have an extension in place but gosh darn it, it’s Opening Day, the Cubs are playing, and fans are returning to Wrigley Field for a full 162-game seaso… [+2807 chars]"}, {"label": 5, "content": "Minnesota Vikings defensive lineman Stephen Weatherly Photo: Brad Rempel/USA TODAY Sports\r\nOdenigbo was set to be a restricted free agent this offseason. Minnesota did not tender Odenigbo and he ende… [+978 chars]"}, {"label": 5, "content": "The Detroit Lions continue their search to improve their thin secondary. According to NFL Networks Ian Rapoport, the Lions are hosting free agent cornerback Corn Elder for a visit on Thursday morning… [+1262 chars]"}, {"label": 5, "content": "Last SlideNext Slide\r\nThe New York Yankees open the 2021 season at home on Thursday afternoon against the Toronto Blue Jays.\r\nFirst pitch is slated for 1:05 p.m. at Yankee Stadium. The game will be b… [+1214 chars]"}, {"label": 5, "content": "The field has been set for the 2022 Maui Invitational and Arkansas is far from the only big name headlining the multi-team event. The tournament takes place over November 21-23, 2022 in the Lahaina C… [+785 chars]"}, {"label": 5, "content": "The 2021 NCAA women's basketball tournament began with the better-seeded team winning every game on the first day, only to have the most teams outside the top-four seeds reach the Sweet 16 since 2013… [+11904 chars]"}, {"label": 5, "content": "Nicolas Claxton has burst onto the scene, becoming a valuable piece in the Nets success. His success as a second-year player has put Steve Nash and the Nets in an uncommon situation. \r\nWhile it doesn… [+9736 chars]"}, {"label": 5, "content": "According to NFL Networks Tom Pelissero, the Indianapolis Colts are signing former Carolina Panthers offensive guard Chris Reed to a one-year deal: \r\nThe #Colts are signing former #Panthers guard Chr… [+1364 chars]"}, {"label": 5, "content": "Marcio Jose Sanchez/Associated Press\r\nThe Lakers have one open roster spot and are hoping to fill it with a three-and-D wing, per Jovan Buha and Jared Weiss of The Athletic.\r\nThat might prove impossi… [+845 chars]"}, {"label": 5, "content": "Notre Dame linebacker Jeremiah Owusu-Koramoah says hes a perfect fit for the Eagles.\r\nAnd all you have to do is listen to him talk to agree.\r\nOwusu-Koramoah, projected as a mid-to-late 1st-round pick… [+1988 chars]"}, {"label": 5, "content": "With Ezekiel Elliott, Tony Pollard, and Rico Dowdle currently under contract it seems pretty unlikely the Dallas Cowboys invest any draft capital into the position in the 2021 NFL Draft. But, if they… [+2913 chars]"}, {"label": 5, "content": "Royals Rumblings - News for April 1, 2021\r\nAnne Rogers writes that Adalberto Mondesi felt something minor in his game on Monday, and the team sidelined him out of caution.\r\nGoing in and talking to hi… [+6135 chars]"}, {"label": 5, "content": "With the help of Doug Pederson and the tanking Philadelphia Eagles, the Washington Football Team won the NFC East in 2020 with a 7-9 record. Woohoo! Then, as everyone expected, they were quickly elim… [+11187 chars]"}, {"label": 5, "content": "While you were sleeping, Francisco Lindor got paid. Big time.\r\nThe 27-year-old shortstop and the New York Mets agreed overnight to a 10-year, $341 million contract.\r\nAccording to pair of Mets legends… [+2829 chars]"}, {"label": 5, "content": "Lets get to the Philadelphia Eagles links ...\r\nEagles mailbag: Andre Dillards trade market, and why move from 6 to 12 now? - PhillyVoiceI do think the Eagles would like to salvage some kind of draft … [+9055 chars]"}, {"label": 5, "content": "It is a challenge to stay up to date on the general feelings about each NFL Draft prospect to truly parse who deserves the “sleeper” label. But none of the below players have well-known names or rece… [+522 chars]"}, {"label": 0, "content": "For the first time, scientists have discovered X-rays emitting from the enigmatic planet Uranus.\r\nThe study published in the Journal of Geophysical Research on Wednesday examined two visuals of the p… [+1690 chars]"}, {"label": 0, "content": "Diamonds may be the strongest known natural material, but researchers have just created some stiff competition.\r\nBy firing a dime-sized graphite disk at a wall at 15,000 mph (24,100 km/h), scientists… [+3206 chars]"}, {"label": 0, "content": "Data from NASA's Juno spacecraft revealed faint aurora features likely triggered by charged particles coming from the edge of Jupiter's massive magnetosphere.  (Image credit: NASA/SWRI/JPL-Caltech/Sw… [+3666 chars]"}, {"label": 0, "content": "This mind-bending picture of the moon with inverted colours shows where it once flowed with magma - and what it would look like with 'superhuman vision'.\r\nAstrophotographer Andrew McCarthy, known as … [+3499 chars]"}, {"label": 0, "content": "We know of only two interstellar visitors – that is, visitors from other star systems – to our solar system. They are 1I/’Oumuamua and 2I/Borisov. ‘Oumuamua gets a lot of press as a strangely-shaped … [+5824 chars]"}, {"label": 0, "content": "Chance finds of prehistoric stone tools and fragments of pottery, picked up from a rabbit hole by the wardens of Skokholm Island, have surprised experts and hint at new chapters in the prehistory of … [+4530 chars]"}, {"label": 0, "content": "China's Tianwen-1 spacecraft has captured stunning images of Mars as a bright red sunlit crescent in deep space.\r\nThe photographs were separately taken over the northern and southern hemispheres of M… [+1969 chars]"}, {"label": 0, "content": "Enlarge/ SN11 nears apogee on March 30, 2021 over SpaceX's South Texas launch site.\r\n76 with 42 posters participating\r\nWelcome to Edition 3.39 of the Rocket Report! This week, we have another explodi… [+12434 chars]"}, {"label": 0, "content": "Researchers have confirmed for the first time that Pine Island Glacier in West Antarctica could cross tipping points, leading to a rapid and irreversible retreat which would have significant conseque… [+4558 chars]"}, {"label": 0, "content": "At first glance at this image, you'd be forgiven for mistaking it as a still from the latest science fiction blockbuster.\r\nBut the photo is very much real, and was snapped by NASA's Curiosity Mars ro… [+5522 chars]"}, {"label": 0, "content": "NASA’s Europa Clipper, depicted in this illustration that was updated in December 2020, will swoop around Jupiter on an elliptical path, dipping close to its moon Europa on each flyby to collect data… [+11921 chars]"}, {"label": 0, "content": "Proposed by researchers at Harvard University, the Stratospheric Controlled Perturbation Experiment, or SCoPEx, ultimately planned to release a cloud of calcium carbonate – more commonly known as cha… [+3935 chars]"}, {"label": 1, "content": "The Biden administration is reportedly set to have indirect negotiations about rejoining the Iran nuclear deal next week, prompting a wave of backlash from critics.\r\nAgreed to under former President … [+4122 chars]"}, {"label": 1, "content": "MINNEAPOLIS — Kneeling on the neck of someone who is handcuffed and in the prone position is top-tier, deadly force and should not be used, the head of the Minneapolis Police Departments homicide div… [+4828 chars]"}, {"label": 1, "content": "ORANGE, Calif. (KABC) -- The suspect in a mass shooting at a business park in Orange, in which a 9-year-old boy and three other adults were killed, has been charged with murder, prosecutors announced… [+2829 chars]"}, {"label": 1, "content": "With Congress in recess, most lawmakers were not on Capitol Hill, and President Biden had left Washington earlier in the day for Camp David. But many aides were in and around the Capitol working or r… [+633 chars]"}, {"label": 1, "content": "Rep. Matt Gaetz delivers remarks during a House Judiciary Committee markup. | Kevin Dietsch/Getty Images\r\nTALLAHASSEE Embattled Rep. Matt Gaetz and his close friend, now-indicted former Seminole Coun… [+7764 chars]"}, {"label": 1, "content": "After five and half years guiding Waymo, Alphabet's subsidiary developing autonomous-drive technology, John Krafcik has decided it's time for someone else to run the company. Actually, it will be a p… [+2761 chars]"}, {"label": 1, "content": "Blake Griffin took a buyout from the Pistons to sign with the Nets. LaMarcus Aldridge took a buyout from the Spurs to sign with the Nets. Andre Drummond took a buyout from the Cavaliers to sign with … [+938 chars]"}, {"label": 1, "content": "Demi Lovato depicted scenes before and after her near-fatal overdose in July 2018 in a new music for her single,\"Dancing with the Devil.\"\r\nThe video comes after amid the release of her YouTube docume… [+3232 chars]"}, {"label": 1, "content": "People who are fully vaccinated against COVID-19 can safely travel within the United States and abroad as long as they continue to take precautions like wearing a mask in public, according to new gui… [+2066 chars]"}, {"label": 1, "content": "Here's a Bridgerton surprise: breakout leading man Regé-Jean Page will not be back for season two of the Netflix hit.\r\nSources say Page had only a one-season deal and completed his contractual obliga… [+2683 chars]"}, {"label": 1, "content": "The unaccompanied children and teenagers detained at the border nearly doubled in March compared with the previous month, according to documents obtained by The New York Times. \r\nAltogether, border o… [+984 chars]"}, {"label": 1, "content": "Minneapolis' most senior police officer testified Friday during the Derek Chauvin murder trial that Derek Chauvin putting his knee on a handcuffed George Floyd's neck during his arrest last spring wa… [+10095 chars]"}, {"label": 1, "content": "NFL mock drafts are always difficult to create with accuracy, especially when there are likely to be draft day trades that few see coming. One of the reasons I do one mock draft a year is for the fun… [+970 chars]"}, {"label": 1, "content": "The crisis in the Suez Canal last month turned the worlds attention on a single challenge few had ever considered: how to refloat a 200,000-ton mass of steel, as long as the Empire State Building is … [+5080 chars]"}, {"label": 1, "content": "SEATTLE At least six people in Washington state are among more than a dozen people who have become sick due to a salmonella outbreak linked to wild songbirds.\r\nThe Centers for Disease Control and Pre… [+1813 chars]"}, {"label": 1, "content": "Apple has announced an expansion for its subscription gaming service Apple Arcade. In addition to exclusive game releases, the company is adding two new categories Timeless Classics and App Store Gre… [+2359 chars]"}, {"label": 1, "content": "Tesla delivered a great bit of news Friday. The electric vehicle pioneer posted a healthy quarterly increase in deliveries, a number more than double 2020s first-quarter total. Investors had been war… [+2030 chars]"}, {"label": 1, "content": "Diamonds may be the strongest known natural material, but researchers have just created some stiff competition.\r\nBy firing a dime-sized graphite disk at a wall at 15,000 mph (24,100 km/h), scientists… [+3206 chars]"}, {"label": 1, "content": "JERUSALEM (AP) Christians in the Holy Land are marking Good Friday this year amid signs the coronavirus crisis is winding down, with religious sites open to limited numbers of faithful but none of th… [+5400 chars]"}, {"label": 1, "content": "Hall of Fame coach Larry Brown expressed his desire for one person to decide North Carolina's next men's basketball coach: Roy Williams, who retired from the position Thursday.\r\nBrown, a North Caroli… [+2767 chars]"}, {"label": 1, "content": "New York City mayoral candidate Andrew Yang was hospitalized Friday after experiencing abdominal pains, his campaign said.\r\n\"After experiencing abdominal pain this morning, Andrew Yang visited an eme… [+1680 chars]"}, {"label": 1, "content": "U.S. stock-index futures traded higher Friday morning after a blockbuster March jobs report, though cash trading in equities - and most other markets - are closed due to the Good Friday. The U.S. add… [+934 chars]"}, {"label": 1, "content": "A section of a train that derailed inside a tunnel in the mountains of Hualien in eastern Taiwan on Friday.\r\nSam Yeh/AFP via Getty Images\r\nAn express passenger train partially derailed Friday inside … [+3660 chars]"}, {"label": 1, "content": "A sleeping student on a Powhatan County, Virginia, school bus got a frightening surprise on April Fools Day. Surveillance video shows a deer flying through the vehicle’s windshield and landing briefl… [+812 chars]"}, {"label": 1, "content": "We know of only two interstellar visitors – that is, visitors from other star systems – to our solar system. They are 1I/’Oumuamua and 2I/Borisov. ‘Oumuamua gets a lot of press as a strangely-shaped … [+5824 chars]"}, {"label": 1, "content": "(CNN) Considered by biologists to be some of the most intelligent invertebrates, octopuses are normally playful and inquisitive. \r\nBut an Australian geologist saw another side to the marine creatures… [+2795 chars]"}, {"label": 1, "content": "According to a recent report, Nvidia is increasing the supply of GTX 1650 cards to the desktop consumer market after having prioritized the GPU for notebooks. This is good news. The GPU market is so … [+7459 chars]"}, {"label": 1, "content": "Enlarge/ SN11 nears apogee on March 30, 2021 over SpaceX's South Texas launch site.\r\n76 with 42 posters participating\r\nWelcome to Edition 3.39 of the Rocket Report! This week, we have another explodi… [+12434 chars]"}, {"label": 1, "content": "As federal officials warn of a potential fourth wave of COVID-19 infections, Michigan has emerged as one of the most pressing hotspots, with average daily infections now five times what they were six… [+5213 chars]"}, {"label": 1, "content": "Exosonic was handed a contract by the Presidential and Executive Airlift Directorate (PE) after impressing the military with its concept for a low-boom supersonic Mach 1.8 twinjet. \r\nNow CNN Travel h… [+3510 chars]"}, {"label": 1, "content": "Skip to main content\r\nApr. 2, 2021,\r\nat\r\n6:00 AM\r\nPHOTO ILLUSTRATION BY EMILY SCHERER / GETTY IMAGES\r\nThe level of star power in this year’s NCAA women’s Final Four is astonishing to behold. Not just… [+6998 chars]"}, {"label": 1, "content": "Scientists have found that several viruses which belong to the Coronaviridae family can infect a wide range of hosts, including birds, humans, and other mammals. These viruses are single-stranded, po… [+6041 chars]"}, {"label": 1, "content": "At first glance at this image, you'd be forgiven for mistaking it as a still from the latest science fiction blockbuster.\r\nBut the photo is very much real, and was snapped by NASA's Curiosity Mars ro… [+5522 chars]"}, {"label": 2, "content": "The covid-19 pandemic drove a horrifying surge in U.S. deaths last year, new research published Friday has shown. According to the study, over half a million more people died than would have been exp… [+3310 chars]"}, {"label": 2, "content": "SEATTLE At least six people in Washington state are among more than a dozen people who have become sick due to a salmonella outbreak linked to wild songbirds.\r\nThe Centers for Disease Control and Pre… [+1813 chars]"}, {"label": 2, "content": "A sign requiring face masks and COVID-19 protocols is displayed at a restaurant in Plymouth, Mich., on March 21. Coronavirus cases in Michigan are skyrocketing after months of steep declines, one sig… [+7210 chars]"}, {"label": 2, "content": "ALBUQUERQUE, N.M. —Researchers at the University of New Mexico say they will participate in the national clinical trial testing the Moderna vaccine in children. \r\nAccording to a news release, the tri… [+1382 chars]"}, {"label": 2, "content": "GRANTSVILLE Meghan McCormick said one day her son was fine, and then the very next day he had a high fever, was exhausted and sick with a syndrome that is caused by COVID-19 except no one knew he had… [+2735 chars]"}, {"label": 2, "content": "Abstract\r\nThe coronavirus disease (COVID-19) caused by SARS-CoV-2 is creating tremendous human suffering. To date, no effective drug is available to directly treat the disease. In a search for a drug… [+23254 chars]"}, {"label": 2, "content": "But this week, hope gave way, yet again, to concern. The rate of coronavirus infections is rising again in Rhode Island and across the nation. It is clouding the success of the U.S. vaccination progr… [+8111 chars]"}, {"label": 2, "content": "The Maine Center for Disease Control and Prevention reported 401 new cases of COVID-19 on Friday, a significant increase in new infections even as the Mills administration prepares to expand vaccine … [+2415 chars]"}, {"label": 2, "content": "This story will be updated.\r\nFor the second day in a row, Maine saw the highest single-day increase in new coronavirus cases since the winter surge in virus transmission rolled back, with 401 new cas… [+3686 chars]"}, {"label": 2, "content": "As federal officials warn of a potential fourth wave of COVID-19 infections, Michigan has emerged as one of the most pressing hotspots, with average daily infections now five times what they were six… [+5213 chars]"}, {"label": 2, "content": "MONTPELIER, Vt. (WCAX) - Vermont health officials Friday said surging COVID case counts over the past week are the highest they have been since the start of the pandemic and pleaded with residents to… [+2585 chars]"}, {"label": 2, "content": "Scientists have found that several viruses which belong to the Coronaviridae family can infect a wide range of hosts, including birds, humans, and other mammals. These viruses are single-stranded, po… [+6041 chars]"}, {"label": 2, "content": "A boy in Iraq who was born with three penises is the first child ever proven to have the strange deformity, doctors have claimed.\r\nDoctors in the north of the country, near Mosul, believe they are th… [+3270 chars]"}, {"label": 2, "content": "INDIANAPOLIS Whichever COVID vaccine you choose, you could be looking at some side effects in the day or two after getting your shot. \r\nDoctors say thats a likely sign your immune system is doing wha… [+1491 chars]"}, {"label": 2, "content": "As COVID-19 case counts in Alaska begin to climb again, health officials say getting the state vaccinated is the best way to tamp down spread but the pace of vaccination is slowing.\r\n This is the cru… [+5017 chars]"}, {"label": 2, "content": "California on Thursday lifted the statewide advisory that asked leisure travelers to stay within 120 miles of home to curb the spread of COVID-19, according to a news release. However, the California… [+1779 chars]"}, {"label": 2, "content": "Michigan Medicine is restricting visitors at its locations to minimize the spread of COVID-19 as cases and hospitalizations rise across the state, the hospital system announced Thursday.\r\nBeginning F… [+3115 chars]"}, {"label": 2, "content": "EUGENE, Ore. -- The number of new COVID-19 cases among school-aged children in Lane County has doubled during the past week, according to local health officials.\r\nLane County Public Health cited one … [+2273 chars]"}, {"label": 2, "content": "COLUMBIA, S.C. (WIS) - Millions of South Carolinians have now received their first dose of the COVID-19 vaccine, as well as a little piece of paper to document the vaccination. \r\nHowever, many South … [+2520 chars]"}, {"label": 2, "content": "The Oregon Health Authority reported 521 new cases of COVID-19 on Thursday and two new deaths as the number of patients actively hospitalized due to the virus reached its highest level since late Feb… [+2546 chars]"}, {"label": 3, "content": "After five and half years guiding Waymo, Alphabet's subsidiary developing autonomous-drive technology, John Krafcik has decided it's time for someone else to run the company. Actually, it will be a p… [+2761 chars]"}, {"label": 3, "content": "A limited number of spectators are set to return to sporting events in the UK, with pilot events being planned at Londons Wembley Stadium, beginning with the FA Cup Semi-Final fixture between Leicest… [+1706 chars]"}, {"label": 3, "content": "People who are fully vaccinated against COVID-19 can safely travel within the United States and abroad as long as they continue to take precautions like wearing a mask in public, according to new gui… [+2066 chars]"}, {"label": 3, "content": "Costco on Friday opened up appointments for Johnson &amp; Johnson’s single-dose COVID-19 vaccine at nearly two dozen stores across the Bay Area, substantially expanding the superstore chain’s vaccina… [+1461 chars]"}, {"label": 3, "content": "Over the years, weve defined wines most often by appellation, occasionally by grape and, once in a while, by popularity.\r\nBut many readers have suggested that we look at wines by price. Essentially, … [+813 chars]"}, {"label": 3, "content": "Daniella Levine Cava, the mayor of Floridas Miami-Dade County, says shes \"encouraged\" by a recent call with officials at the Centers for Disease Control and Prevention (CDC) about next steps for the … [+2384 chars]"}, {"label": 3, "content": "The U.S. Food and Drug Administration (FDA) this week approved two rapid, over-the-counter coronavirus tests that will soon hit drugstore shelves for easy, at-home testing capabilities. \r\nThe FDA in … [+2843 chars]"}, {"label": 3, "content": "Donald Trumploves him some McDonald's, but ain't so keen on paying for it ... at least according to a former bodyguard who claims he's still $130 in the red, thanks to DT.\r\nKevin McKay says he worked… [+1042 chars]"}, {"label": 3, "content": "TSMC this week has announced plans to spend $100 billion on new production facilities as well as R&amp;D over the next three years. The world's largest contract maker of chips says that its fabs are … [+4799 chars]"}, {"label": 3, "content": "The U.S. Securities and Exchange Commission (SEC) has greenlighted Coinbase’s initial public offering via a direct listing on Nasdaq, the company has confirmed. Coinbase’s IPO is set to debut in two … [+2286 chars]"}, {"label": 3, "content": "Last fall, after some of the restrictions had eased in Germany, Trivago, a travel company based in Düsseldorf, let employees work remotely three weeks of the month and then spend one week in the offi… [+1816 chars]"}, {"label": 3, "content": "More UK residents who received the AstraZeneca vaccine developed blood clots than initially believed, officials said, as German officials recommend avoiding the brand when it comes to booster shots.\r… [+2241 chars]"}, {"label": 3, "content": "Tesla delivered a great bit of news Friday. The electric vehicle pioneer posted a healthy quarterly increase in deliveries, a number more than double 2020s first-quarter total. Investors had been war… [+2030 chars]"}, {"label": 3, "content": "U.S. government-bond yields ticked higher after new data showed a big jump in hiring in March, giving investors further cause for optimism about the economic outlook.\r\nThe yield on the benchmark U.S.… [+947 chars]"}, {"label": 3, "content": "By Timothy Aeppel\r\n(Reuters) - Matt Arnold just spent $5,000 to run help-wanted ads for his company's five trailer factories scattered from Pennsylvania to Utah.\r\n\"We hired two from the ads,\" said Ar… [+4711 chars]"}, {"label": 3, "content": "A previous version of this report provided an inaccurate date for the expansion of vaccine eligibility in the commonwealth of Virginia. All Virginians aged 16 and over become eligible on April 18. Th… [+10346 chars]"}, {"label": 3, "content": "The FDA announced two revisions to the emergency use authorization (EUA) granted to Modernas COVID-19vaccine in the hopes that it will help expedite the rollout. The updates, announced Thursday, clar… [+2186 chars]"}, {"label": 3, "content": "U.S. stock-index futures traded higher Friday morning after a blockbuster March jobs report, though cash trading in equities - and most other markets - are closed due to the Good Friday. The U.S. add… [+934 chars]"}, {"label": 3, "content": "(Bloomberg) -- No matter how dim a view is taken on valuations, or the untethered exuberance of its retail devotees, or even its actual age, the bull market in stocks keeps managing to deliver goods … [+5635 chars]"}, {"label": 3, "content": "Rich Paul, the sports agent best known for representing NBA star LeBron James, has joined former Nike executives to start a minority-owned marketing and creative agency named Adopt.\r\nThe firm aims to… [+936 chars]"}, {"label": 3, "content": "A store in Miami displays a \"We are hiring\" sign on March 5. U.S. employers added 916,000 jobs in March, the biggest number since August, amid an improving pandemic outlook and trillions of dollars i… [+4952 chars]"}, {"label": 3, "content": "MILFORD, CT (WFSB) - A man faces bigotry charges after going out of his way to yell \"go back to China\" at a man in Milford.\r\nJoseph Rohrig, 38, faces second-degree harassment and third-degree intimid… [+774 chars]"}, {"label": 3, "content": "TAMPA, Fla. (WFLA) Have you had your shot already? \r\nWorld of Beer Bar &amp; Kitchen is offering anyone with proof of a COVID-19 vaccine one of the restaurant’s new Black n Blue Burger for free. \r\nOn… [+955 chars]"}, {"label": 3, "content": "Weakness in semiconductor supply chains is affecting everything from automobile to consumer electronics manufacturing. (March 5)\r\nVideo Elephant\r\nSAN RAMON, Calif. As the U.S. economy rebounds from i… [+7446 chars]"}, {"label": 3, "content": "Tesla Inc. is recruiting for its Gigafactory in Austin, Texas and a high school diploma will do just fine.\r\nEarlier this week, CEO Elon Musk told his 50 million Twitter followers that Giga Texas is l… [+2724 chars]"}, {"label": 3, "content": "Three adults and two children are hospitalized following a head-on crash in Northeast D.C. on Thursday night. One of the cars was involved in the earlier attempted robbery of a Taco Bell in Seat Plea… [+1027 chars]"}, {"label": 3, "content": "CONCORD, N.C. (WBTV) - A person was taken into custody after police say a vehicle was driven into a Walmart in Concord Friday morning.\r\nThe incident happened around 6:30 a.m. at the Walmart on Thunde… [+788 chars]"}, {"label": 3, "content": "Manhattans residential real-estate market, dormant for months after many New Yorkers fled near the start of the Covid-19 pandemic, closed the first quarter by posting its strongest sales in years.\r\nI… [+1148 chars]"}, {"label": 3, "content": "CIUDAD JUÁREZ, Mexico The children tumbled out of a white van, dazed and tired, rubbing sleep from their eyes. They had been on their way north, traveling without their parents, hoping to cross the b… [+7803 chars]"}, {"label": 3, "content": "London (CNN Business)At first glance, Deliveroo's stock market debut should have been a runaway success. The food delivery startup was a darling of the UK tech scene, and growing fast thanks to surgi… [+7040 chars]"}, {"label": 3, "content": "The Institute on Taxation and Economic Policy has been issuing a form of its report on corporate taxes for decades. During the 2020 presidential campaign, its findings grabbed center stage, with Demo… [+1378 chars]"}, {"label": 3, "content": "Until a few weeks ago, lenders thought Archegos Capital Management was safe. Last week, they were holding a financial fire sale for its assets.\r\nThe simplest explanation is the banks didnt hold enoug… [+922 chars]"}, {"label": 3, "content": "Bitcoin (BTC) briefly hit $60,000 on April 2 in the latest installment of its slow grind back to all-time highs.\r\nBTC/USD 1-hour candle chart (Bitstamp). Source: Tradingview\r\nBTC price taps $60,000\r\n… [+1999 chars]"}, {"label": 3, "content": "The mighty US dollar continues to reign supreme in global markets. But the greenbacks dominance may well be more fragile than it appears, because expected future changes in Chinas exchange-rate regim… [+5550 chars]"}, {"label": 3, "content": "A man counts 100 renminbi notes with the Chinese flag in the background.\r\nGUANGZHOU, China Interest in China's digital yuan project could in part be driven by the surging price of bitcoin, China's ce… [+2351 chars]"}, {"label": 3, "content": "San Antonio-based hamburger chain Whataburger has awarded more than $90 million in bonuses to its employees as a thank you for their service during the coronavirus pandemic and severe winter weather … [+1270 chars]"}, {"label": 3, "content": "The Internal Revenue Service (IRS) can move forward with its efforts to unmask high-value customers at Circle Internet Financial, a federal judge ruled Thursday.\r\nThe judge authorized a request from … [+1563 chars]"}, {"label": 3, "content": "It might be April Fools' Day for a few more hours, but this is no joke. \r\nSpaceX CEO Elon Musk tweeted on Thursday (April 1) he would put \"a literal Dogecoin\" (pronounced \"dohj coin\") on the \"literal… [+2671 chars]"}, {"label": 3, "content": "DALLAS--(BUSINESS WIRE)--Pioneer Natural Resources Company (NYSE:PXD) (\"Pioneer\" or \"the Company\") today announced that it has entered into a definitive purchase agreement to acquire the leasehold in… [+10370 chars]"}, {"label": 3, "content": "On Thursday, the Los Angeles Timesreported that the public is likely never to know the amount of jobs that were actually saved by the Paycheck Protection Program, the flagship federal relief program … [+1546 chars]"}, {"label": 4, "content": "Rappers Quavo and Saweetie are speaking out after security footage surfaced earlier this week appearing to show a physical dispute between the former couple in an elevator.\r\nBoth said they have moved… [+2615 chars]"}, {"label": 4, "content": "Good storytelling involves using tropes, and one trope I always appreciate in action movies is you can always tell when a plan is going to work. Plans fail when you see characters discuss them before… [+6895 chars]"}, {"label": 4, "content": "Jen Shah has pleaded not guilty to the charges in her telemarketing scam case ... and it seems she prepped for it by getting her hair done.\r\n\"The Real Housewives of Salt Lake City\" star appeared in a… [+993 chars]"}, {"label": 4, "content": "Demi Lovato depicted scenes before and after her near-fatal overdose in July 2018 in a new music for her single,\"Dancing with the Devil.\"\r\nThe video comes after amid the release of her YouTube docume… [+3232 chars]"}, {"label": 4, "content": "After months of deal speculation, Scooter Braun has sold his media company, Ithaca Holdings, to South Korea’s HYBE.\r\nFormerly known as Big Hit Entertainment, HYBE is home to K-pop bands like the mega… [+2615 chars]"}, {"label": 4, "content": "The Friends reunion special, one of the most high-profile TV casualties of the Covid-19 pandemic, is set to finally start shooting.\r\nSources have confirmed that HBO Max’s unscripted special will begi… [+1376 chars]"}, {"label": 4, "content": "At the beginning of March, images of a Nike\r\nAir Force 1 Experimental that seemed to draw obvious inspiration from the U.S. Postal Service’s familiar Priority Mail shipping boxes and envelopes with i… [+2349 chars]"}, {"label": 4, "content": "Nike is waging an all-out war with the devil. The apparel company has successfully blocked the sale of Lil Nas X's \"Satan Shoes\" — at least for now.\r\nOn Wednesday, a U.S. District Court in New York a… [+5627 chars]"}, {"label": 4, "content": "Here's a Bridgerton surprise: breakout leading man Regé-Jean Page will not be back for season two of the Netflix hit.\r\nSources say Page had only a one-season deal and completed his contractual obliga… [+2683 chars]"}, {"label": 4, "content": "Ever since Kurt Cobain’s death in 1994, Nirvana fans have hypothesized about the music he would have made had he lived. But other than “You Know You’re Right,” the scabrous, throat-shredding meditati… [+10154 chars]"}, {"label": 4, "content": "The plot weirdens.\r\nOn Wednesday, Page Six reported that in the wake of the contentious new “Allen vs. Farrow” documentary, Woody Allen backers had unearthed a photo that revealed that his ex Mia Far… [+1163 chars]"}, {"label": 4, "content": "TelevisionAfter starring in Will &amp; Grace and American Horror Story, his life took a twist in lockdown and he became an Instagram superstar at 65. He discusses fame, fun and sharing a cell with Ro… [+12507 chars]"}, {"label": 4, "content": "Geralt and Ciri may finally be coming back soon"}, {"label": 4, "content": "Jeannie Mai and her fiancé, Jeezy, are the latest celebrities to take action against the growing incidents of racism against the Asian community.\r\nUSA TODAY\r\n\"Teen Wolf\" actress Arden Cho is sharing … [+2982 chars]"}, {"label": 4, "content": "Katharine McPhee is suiting up to support her stepdaughter’s latest project.\r\nThe “Smash” star snapped an Instagram Stories selfie in a pastel swimsuit from Sara Foster’s new collection for Summersal… [+1808 chars]"}, {"label": 4, "content": "Merediths beach of consciousness is starting to get as crowded as Tulum. On Thursdays episode of Greys Anatomy, Meredith Grey (Ellen Pompeo) was joined by surprise guest star Mark Sloan (Eric Dane), … [+1225 chars]"}, {"label": 4, "content": "The conservatorship of Britney Spears, the college admissions fraud scandal, the accusation of sexual abuse against Woody Allen all of these stories came back atop headlines in recent weeks after new… [+4081 chars]"}, {"label": 4, "content": "Jordan Peele is hard at work on another horror film and may have a classic Walking Dead actor along for the ride. Looney Tunes are having some fun with us hyping the new Space Jam trailer. Plus updat… [+2309 chars]"}, {"label": 4, "content": "Jed Rothstein sacrifices depth for speed\r\nPhoto by Michael Kovac/Getty Images for WeWork\r\nThe problem of making a documentary about a showman is that its hard not to be ensnared by him. WeWork: Or th… [+7557 chars]"}, {"label": 4, "content": "Bhad Bhabie claims she made more than $1 million in just six hours after launching her OnlyFans account.\r\nBhabie a.k.a. the “Cash Me Outside” girl, whose real name is Danielle Bregoli posted a video … [+1429 chars]"}, {"label": 4, "content": "Buckle up! Because this Olivia Rodrigo and Joshua Bassett drama just took another turn.\r\nOn April 1, the 18-year-old singer and actress debuted her new single \"deja vu.\" The song is about watching an… [+989 chars]"}, {"label": 4, "content": "James Charles, known best as a personality on YouTube, has addressed allegations he was inappropriately messaging teenage boys in a recent video.\r\nThe 21-year-old uploaded a new video on the platform… [+2493 chars]"}, {"label": 4, "content": "Happy April, party people! No this is no April fools joke (that was yesterday anyways), it is the first weekend of a brand-new month. And by now you know the drill: the start of a new month ushers in… [+6396 chars]"}, {"label": 4, "content": "Not even a pandemic can keep Queen Elizabeth II from completing her royal duties.\r\nThe monarch traditionally hands out silver coins called \"Maundy Gift\" each year on the Thursday before Easter as an … [+2170 chars]"}, {"label": 4, "content": "Amelia Gray Hamlin is giving off steamy island vibes in her latest social media snaps.\r\nThe youngest daughter of Harry Hamlin and \"Real Housewives\" star Lisa Rinna shared a series of sultry bikini sh… [+2369 chars]"}, {"label": 4, "content": "Meghan Markle appeared to lead a 'normal life' during her time as a royal - despite the bombshell revelations she made during the tell-all Oprah Winfrey interview, Princess Diana's biographer claimed… [+12080 chars]"}, {"label": 4, "content": "There is nothing that tugs at our heartstrings like watching Bindi Irwin, the beloved daughter of Crocodile Hunter star Steve Irwin, who died in 2006, start her life with her beautiful new family. He… [+2404 chars]"}, {"label": 4, "content": "In the 1970s, as the golden age of serial murder began to take hold in the U.S. with killers like Ted Bundy and John Wayne Gacy, another predator had begun to terrorize travelers abroad. Charles Sobh… [+7491 chars]"}, {"label": 4, "content": "Movie: Wild DogRating: 2.75/5Banner: Matinee EntertainmentCast: Akkineni Nagarjuna, Dia Mirza, Saiyami Kher, Ali Reza, Mayank Parakh, Prakash Sudarshan, Pradeep, Bilal, Atul Kulkarni, Anish Kuruvilla… [+3463 chars]"}, {"label": 4, "content": "Bam Margera insists he tried everything he could to appease \"Jackass 4\" producers and stay on the project, but claims what they wanted almost killed him ... and he has no choice but to take legal act… [+1560 chars]"}, {"label": 4, "content": "One of the TikTok dance creators who didn't get credit last week in a controversial 'Tonight Show' bit has mixed feelings about what went down ... and her mom does too.\r\nMya Johnson tells TMZ ... she… [+1123 chars]"}, {"label": 4, "content": "This article is republished here with permission from The Associated Press. This content is shared here because the topic may interest Snopes readers; it does not, however, represent the work of Snop… [+891 chars]"}, {"label": 4, "content": "BROCKHAMPTON have shared another new song from their forthcoming album ROADRUNNER: NEW LIGHT, NEW MACHINE. Its called COUNT ON ME and it features vocals from Shawn Mendes and Ryan Beatty. A$AP Rocky … [+797 chars]"}, {"label": 4, "content": "Well be honest: The new trailer for James Gunns The Suicide Squad released earlier todayless than a week after the first full trailer for the August-set supervillain spectacularhas less new footage t… [+1456 chars]"}, {"label": 4, "content": "Fox has cancelled animated comedy Bless the Harts, which is currently airing its second season. The series, created by Emily Spivey, stars Kristin Wiig, Maya Rudolph, Jillian Bell, Ike Barinholtz, an… [+539 chars]"}, {"label": 4, "content": "Later this week, two-time Oscar nominee Daniel Kaluuya will host Saturday Night Live for the first time, with St. Vincent joining him as musical guest.\r\nIn a promo for this week’s episode, cast membe… [+890 chars]"}, {"label": 4, "content": "[A request to Rolling Stone for comment on this piece sent two days ago received no reply by press time. We will update if and when we receive one.]\r\nRolling Stone magazine was once a shining beacon … [+3856 chars]"}, {"label": 4, "content": "Chrissy Teigen is struggling with the idea that she'll never be pregnant again.\r\nThe 35-year-old cookbook author shares two children with husband John Legend: Luna, 4, and Miles, 2.\r\nThey were set to… [+2677 chars]"}, {"label": 4, "content": "Netflix has released a teaser trailer for their upcoming anime series, Yasuke. The series premieres on April 29th.\r\nCreated, directed and executive produced by LeSean Thomas along with Japanese anima… [+891 chars]"}, {"label": 4, "content": "It's been 30 years since we fell in love with the cast of \"Saved by the Bell' including Mario Lopez, Tiffani Thiessen and Mark-Paul Gosselaar.\r\nUSA TODAY\r\nMark-Paul Gosselaar is reflecting on a racia… [+3293 chars]"}, {"label": 4, "content": "The gap is back—or, more precisely, it never even left.\r\nTwo days after telling the world he was having a dental procedure to close the gap between his two front teeth, Strahan revealed on Thursday w… [+965 chars]"}, {"label": 4, "content": "Imprisonment, in many senses of the word, is at the center of each of the five nominees for this year's live-action short film Oscar, which is not to say they're a homogenous bunch: Though all have p… [+3885 chars]"}, {"label": 4, "content": "Twitter has lost another celebrity soul. \r\nAdd Hailey Baldwin to the list as the model and wife of Justin Bieber just revealed why she chose to remove her presence from the popular social media app.\r… [+2926 chars]"}, {"label": 5, "content": "The opening weekend series between the Mets and Nationals has been postponed after four Washington players tested positive for COVID-19. Initially, just Thursday night's Opening Day matchup in Washin… [+2189 chars]"}, {"label": 5, "content": "The Philadelphia Eagles are entering the 2021 season with a new No. 1 quarterback, and he has changed his jersey number to reflect that. On Friday, the Eagles announced new numbers for some of their … [+1479 chars]"}, {"label": 5, "content": "Indiana sophomore Trayce Jackson-Davis will return to Indiana for his junior season, he announced on Friday afternoon.\r\n“Indiana basketball is something that I have been blessed to be a part of. Afte… [+1433 chars]"}, {"label": 5, "content": "With Mitchell Robinson out for the year with a broken foot, the Knicks front court depth is very clearly thin. Gone are the days when the Knicks have a glut of bigger forwards. They may actually be w… [+1434 chars]"}, {"label": 5, "content": "There’s an unwritten rule among network colleagues to not call coworkers out publicly. (Some in the business would say that this also applies to employees at competing networks.) Recently, ESPN’s Kir… [+4773 chars]"}, {"label": 5, "content": "Blake Griffin took a buyout from the Pistons to sign with the Nets. LaMarcus Aldridge took a buyout from the Spurs to sign with the Nets. Andre Drummond took a buyout from the Cavaliers to sign with … [+938 chars]"}, {"label": 5, "content": "The San Francisco 49ers still have roughly a month before they have to decide on which quarterback to take with the recently acquired No. 3 pick in the 2021 NFL Draft, and according to two separate r… [+2960 chars]"}, {"label": 5, "content": "Chris Beard has agreed to a seven-year, $35 million contract as the new basketball coach of the Texas Longhorns, a source close to the situation told Horns247.\r\nThe contract calls for Beard to earn a… [+4334 chars]"}, {"label": 5, "content": "The Pittsburgh Steelers have one compensatory draft pick in upcoming the 2021 NFL draft. Due to the departure of Javon Hargrave during the 2020 offseason, the Steelers have an additional fourth-round… [+5021 chars]"}, {"label": 5, "content": "For the 2021 Red Sox, the weight of expectations will not be a problem. Heading into the new season, Boston is listed at 50:1 odds to win the World Series.\r\nClearly, experts are not eyeing the curren… [+4229 chars]"}, {"label": 5, "content": "The Trail Blazers deadline deal to acquire Norman Powell from the Raptors is a natural fit and his arrival has boosted Portlands profile in short order. The departure of promising third-year guard Ga… [+2615 chars]"}, {"label": 5, "content": "Here's the good news, Chicago Bears fans, it's April and your team already has its starting quarterback. Here's the bad news: That quarterback is Andy Dalton.\r\nBears general manager Ryan Pace confirm… [+3257 chars]"}, {"label": 5, "content": "Baseball this season should look and sound more like the sport you grew up with. Fans are back -- to some extent -- in the stands. Pitchers will bat in the National League. And teams are slated to pl… [+14119 chars]"}, {"label": 5, "content": "Eloy Jimenez was on the mind of Chicago White Sox players as they took the field Thursday for their opening day game against the Los Angeles Angels.\r\nThe odd tribute to the outfielder, who is set to … [+1285 chars]"}, {"label": 5, "content": "How did Aaron Rodgers prepare for his two-week run as \"Jeopardy!\" guest host?\r\nExactly how you would expect the Green Bay Packers quarterback to do it: like he was preparing for the Tampa Bay Buccane… [+4393 chars]"}, {"label": 5, "content": "The NFL draft is less than a month away and the anticipation is at an all-time high in North Texas. The Dallas Cowboys, due to a disappointing 6-10 campaign in 2020, are in a position to add plenty o… [+3226 chars]"}, {"label": 5, "content": "The article in the Los Angeles Times regarding the sudden and unexpected dysfunction within Chargers ownership makes a claim that has gained significant traction. That claim, however, is not factuall… [+4454 chars]"}, {"label": 5, "content": "NFL mock drafts are always difficult to create with accuracy, especially when there are likely to be draft day trades that few see coming. One of the reasons I do one mock draft a year is for the fun… [+970 chars]"}, {"label": 5, "content": "What’s been most interesting about the Celtics this season is how distinct they feel inside the Brad Stevens era, in mostly frustrating ways. The commonalities are people, not style or aesthetic. An … [+12322 chars]"}, {"label": 5, "content": "Dustin Johnson's 2020 Masters performance may only be surpassed by the meal he's put together for the 2021 champions dinner. Next Tuesday, D.J. will host all the former champions who can be in attend… [+2002 chars]"}, {"label": 5, "content": "Skip to main contentclock\r\nmenu\r\nmore-arrow\r\nno\r\nyes"}, {"label": 5, "content": "LAWRENCE, Kan. — The University of Kansas announced today that hall of fame mens basketball head coach Bill Self has signed a lifetime contract with the Jayhawks. His current contract, which was set … [+2122 chars]"}, {"label": 5, "content": "This college basketball season has been unusual for lots of reasons, most notably because it's been played during a global pandemic and largely without fans, but also because two of the biggest brand… [+8071 chars]"}, {"label": 5, "content": "Michael Owens/Getty Images\r\nLos Angeles Lakers star LeBron James is expected to have a voice in the running of Liverpool.\r\nIn an interview with Joe Vardon, Simon Hughes and James Pearce of The Athlet… [+1322 chars]"}, {"label": 5, "content": "Hall of Fame coach Larry Brown expressed his desire for one person to decide North Carolina's next men's basketball coach: Roy Williams, who retired from the position Thursday.\r\nBrown, a North Caroli… [+2767 chars]"}, {"label": 5, "content": "The East Tennessee State (ETSU) mens basketball team was embroiled in controversy during the season when players knelt for the national anthem. The move sparked a fervent reaction that went all the w… [+3365 chars]"}, {"label": 5, "content": "Welcome to the annual Opening Day Overreactions -- I would've said something like the third or fourth annual, but I frankly can't remember how many times I've done this; getting old is not cool -- wh… [+10208 chars]"}, {"label": 5, "content": "It wasn’t lost on Duane Underwood when he was acquired by the Pittsburgh Pirates that they opened the season against the Chicago Cubs at Wrigley Field, or that he could pitch against his former team.… [+8277 chars]"}, {"label": 5, "content": "Skip to contentThe Undefeated"}, {"label": 5, "content": "For some Michigan basketball players, returning for the 2021-22 season doesn’t make a lot of sense. Guys like Franz Wagner and Isaiah Livers, maybe even Hunter Dickinson could have pro careers to thi… [+1679 chars]"}, {"label": 5, "content": "Auburn freshman Sharife Cooper will declare for the 2021 NBA draft and forgo his remaining college eligibility by hiring an agent, he told ESPN.\r\n\"This season was a roller coaster filled with many up… [+3098 chars]"}, {"label": 5, "content": "The Jets possess a massive decision at No. 2 overall. Is Zach Wilson headed to Florham Park? Is Sam Darnold staying?\r\nAccording to legendary 49ers quarterback and current ESPN analyst Steve Young, Ga… [+2130 chars]"}, {"label": 5, "content": "LOS ANGELES — If the Los Angeles Clippers are going to make a run at an NBA championship, they’re going to need a healthy Paul George. Right now, that’s looking like a major roadblock for the team.\r\n… [+3074 chars]"}, {"label": 5, "content": "The heir to the Gonzaga’s men’s basketball kingdom actually turned down his first coaching gig—an offer from the Bulldogs, no less, way back in 1999. Instead, Tommy Lloyd decided to backpack around t… [+20021 chars]"}, {"label": 5, "content": "We saw that this spring.\r\nI'd guess Knizner gets 30 or fewer starts if Molina is healthy.\r\nTough spot, but better than killing time in the majors.\r\nKnizner has things he can work on and learn as a ba… [+1344 chars]"}, {"label": 5, "content": "It doesn’t matter how long I obsess about the Cubs, I have to adjust every year: when the Cubs lose a frustrating game, I have to work to make sure it doesn’t impact how I behave around family, frien… [+5824 chars]"}, {"label": 5, "content": "As Matthew Stafford gears up for his first season in Los Angeles, the quarterback is cleaning up some old wounds. The veteran signal-caller underwent a procedure on the thumb of his throwing hand las… [+2098 chars]"}, {"label": 5, "content": "After signing center Andre Drummond, the Los Angeles Lakers have one open roster spot remaining, presumably to be filled with a second addition from the buyout market (unless they buyout Marc Gasol, … [+7616 chars]"}, {"label": 5, "content": "Were going to do a little nitpicking here dissecting the Opening Day showing from the Yankees youngest player. Yes, Gleyber Torres still holds that title as a 24-year-old who has been in the big leag… [+2743 chars]"}, {"label": 5, "content": "Are you as ready as I am to see a team go 162-0? Because Im pretty sure that is what has been foretold after what went down yesterday. The Phillies (can we call them plucky yet?) showed that the NL E… [+3741 chars]"}, {"label": 5, "content": "Former NFL offensive lineman Orlando Franklin has taken followers with him through his weight loss journey and the latest update is pretty remarkable.\r\nFranklin played seven seasons in the NFL with t… [+1148 chars]"}, {"label": 5, "content": "Zac Taylor to be at Oregons pro dayMost of the Bengals brass will be watching Sewell go through his workout.\r\nMock Draft Round Up: Who Will The Cincinnati Bengals take at No. 5 overall in the 2021 NF… [+2166 chars]"}, {"label": 5, "content": "Opening Day dominated the baseball news and that was pretty much covered in the game threads and recap, but lets see what else I can scrape up.\r\nHow about a collection of fun/goofy Opening Day tweets… [+8367 chars]"}, {"label": 5, "content": "The UCLA Bruins are the first team in NCAA men's basketball tournament history to reach the Final Four after entering the tourney on a four-game losing streak, according to Elias Sports Bureau resear… [+6196 chars]"}, {"label": 5, "content": "SAN ANTONIO - The restaurant patios and hangouts offering live music and specialty margaritas along the famed River Walk were in full swing on a pleasant midweek evening. A man wearing a UConn T-shir… [+9896 chars]"}, {"label": 5, "content": "The Miami Dolphins made a post-free agency splash last week, sending the No. 3 pick in the 2021 NFL Draft to the San Francisco 49ers for No. 12, a 2021 third-rounder and first-round picks in 2022 and… [+9536 chars]"}, {"label": 5, "content": "Welcome to the first installment of The Opener, where every weekday morning you’ll get a fresh, topical column to start your day from one of SI.com’s MLB writers.\r\nAt a time when fewer balls are put … [+6393 chars]"}, {"label": 5, "content": "The 2021 NHL trade deadline arrives on April 12 at 3 p.m. ET. There will be teams seeking to trade players who are no longer in their rebuilding plans. There will be teams seeking to add players to c… [+3472 chars]"}, {"label": 5, "content": "Kevin Durant talked about the messages which were put out on social media from actor and comedian Michael Rapaport earlier in the week.\r\nDurants messages between him and Rapaport were described as ho… [+1564 chars]"}, {"label": 5, "content": "All of a sudden the Pittsburgh Penguins find themselves in a tie for first place in the East Division alongside the Washington Capitals and New York Islanders. That is how the standings look after th… [+3988 chars]"}, {"label": 0, "content": "In a hardscrabble crater on Mars, a tiny helicopter with a smartphone brain is now days away from attempting the first powered flight on another world. NASA hopes its spindly robot copter, named Inge… [+1453 chars]"}, {"label": 0, "content": "A single “super photon” made up of many thousands of individual light particles: About ten years ago, researchers at the University of Bonn produced such an extreme aggregate state for the first time… [+5340 chars]"}, {"label": 0, "content": "Video: Investigating the asteroid that killed the dinosaurs\r\nThe fiery crash is thought to have generated massive heat, triggered tidal waves and clouded over the sky. In the aftermath, as much as 75… [+1656 chars]"}, {"label": 0, "content": "A trio of young bonobos play under the watchful eyes of their caregivers..\r\nLey Uwera for NPR\r\nAt an animal sanctuary in the Congo, several dozen Congolese schoolchildren are getting a crash course i… [+4167 chars]"}, {"label": 0, "content": "From our vantage point on Earth, the moon looks small. But if you were to hop in a spaceship, don a spacesuit and go on an epic lunar hike, how long would it take to walk all the way around it? \r\nThe… [+7130 chars]"}, {"label": 0, "content": "A piece of burning rocket debris seen streaking across the Pacific Northwest sky last week crashed on a farm in eastern Washington state, authorities said.\r\nAfter the March 25 event, a farmer discove… [+1701 chars]"}, {"label": 1, "content": "SAN ANTONIO -- Arizona Wildcats women's basketball coach Adia Barnes said Saturday that she has nothing to apologize for after she used a middle finger and an expletive in a postgame huddle with her … [+1832 chars]"}, {"label": 1, "content": "Lori Loughlin's husband, Mossimo Giannulli, has been sprung from prison early as the dust settles on the college admission scandal -- the only question now ... is he at home, or is he holed up in a h… [+2183 chars]"}, {"label": 1, "content": "DMX is reportedly hospitalized after suffering a drug overdose.\r\nSources told TMZ that the 50-year-old rapper, whose real name is Earl Simmons, suffered an overdose at around 11 p.m. Friday, also tri… [+1769 chars]"}, {"label": 1, "content": "Amazon has issued an apology for a pair of tweets from its corporate news account attacking Rep. Mark Pocan (D-Calif.) for criticizing the companys workplace environment amid a big unionization push … [+4330 chars]"}, {"label": 1, "content": "Republican Sen. Marco Rubio, R-Fla., and Rep. Dan Crenshaw, R-Texas, hit President Biden and Major League Baseball for the league's decision to boycott Georgia over its election law -- and asking if … [+3448 chars]"}, {"label": 1, "content": "They gathered at a temporary support center that had been set up under tents outside a funeral home in Hualien, a city south of the crash site. They took turns entering a morgue where bodies were bei… [+1184 chars]"}, {"label": 1, "content": "Tributes are flooding in for William \"Billy\" Evans, the 18-year veteran of the U.S. Capitol Police who was killed in Friday's attack at a Capitol checkpoint. Evans is being mourned by lawmakers as a … [+6936 chars]"}, {"label": 1, "content": "In a hardscrabble crater on Mars, a tiny helicopter with a smartphone brain is now days away from attempting the first powered flight on another world. NASA hopes its spindly robot copter, named Inge… [+1453 chars]"}, {"label": 1, "content": "Christian Pulisic injury news is something both Chelsea and USMNT fans are, sadly, way too familiar with.\r\nIt sounds like Pulisic has suffered another setback during Chelsea’s shocking 5-2 home defea… [+2827 chars]"}, {"label": 1, "content": "Godzilla vs. Kong continued to score the best opening numbers of the pandemic at the North American box office, grossing another $11.6 million on Friday for a three-day total of $27.9 million.\r\nThat … [+1778 chars]"}, {"label": 1, "content": "CAIRO Some are blaming the \"curse of the pharaohs\" for a string of unfortunate incidents in Egypt in recent weeks, including the giant ship that blocked the Suez Canal for about a week until it was f… [+3344 chars]"}, {"label": 1, "content": "Verifying absentee ballots: To verify the identity of voters, 30 states match their signatures on absentee ballots with signatures already on file. Six other states require signatures but do not veri… [+3146 chars]"}, {"label": 1, "content": "First Four: Beat 11-seed Michigan State, 86-80 (OT)\r\nFirst round: Beat 6-seed BYU, 73-62\r\nSecond round: Beat 14-seed Abilene Christian, 67-47 \r\nSweet 16: Beat 2-seed Alabama, 88-78 (OT)\r\nElite Eight:… [+27 chars]"}, {"label": 1, "content": "Luis Tovar lived for his family.\r\nAn avid outdoorsman, the 50-year-old frequently loaded them up in his fifth-wheel for camping trips to Arizona. He sat them on the back of his Harley-Davidson motorc… [+6165 chars]"}, {"label": 1, "content": "The Florida Republican congressman Matt Gaetz appears increasingly politically isolated amid a spiralling scandal over a federal sex-trafficking investigation. Even for Donald Trump, one Republican p… [+4416 chars]"}, {"label": 1, "content": "Just good deals you can actually get\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nPhoto by Vjeran Pavic / The Verge\r\nThis story is part of a gr… [+2728 chars]"}, {"label": 1, "content": "After months of hoping to receive a COVID-19 immunization and then weeks of fighting the illness after one never came, Air Force veteran Diane Drewes was down to her last few breaths at a hospice cen… [+4664 chars]"}, {"label": 1, "content": "Three people were killed and four others shot when a house party in Wilmington, NC, went bad Friday night.\r\nWilmington Police Chief Donny Williams offered few details about the incident, which happen… [+396 chars]"}, {"label": 1, "content": "After months of hoping to receive a COVID-19 immunization and then weeks of fighting the illness after one never came, Air Force veteran Diane Drewes was down to her last few breaths at a hospice cen… [+4668 chars]"}, {"label": 1, "content": "Wrights family listened that summer as prosecutors denounced a vigilante who chased after a Skittles-toting 17-year-old in a hoodie. They listened as the other side argued self-defense, and they hear… [+10872 chars]"}, {"label": 1, "content": "WASHINGTON (WJW) — The IRS has begun issuing “plus-up payments” along with the third round of stimulus checks.\r\nThe IRS announced Thursday that more than 130 million stimulus payments had been issued… [+1036 chars]"}, {"label": 1, "content": "SportsPulse: Scott Gleeson picked Virginia to win it all in 2019. He called Loyola-Chicago as a Cinderella in 2018. Now he's ready to give you his guarantees for the Final Four.\r\nUSA TODAY\r\nIn a flas… [+6791 chars]"}, {"label": 1, "content": "An 8-year-old boy accidentally received a COVID-19 vaccine dose in Texas, thanks to \"human error,\" a report said.\r\nThe child was recently inoculated at a Dallas County drive-up vaccine facility opera… [+3840 chars]"}, {"label": 1, "content": "A trio of young bonobos play under the watchful eyes of their caregivers..\r\nLey Uwera for NPR\r\nAt an animal sanctuary in the Congo, several dozen Congolese schoolchildren are getting a crash course i… [+4167 chars]"}, {"label": 1, "content": "From our vantage point on Earth, the moon looks small. But if you were to hop in a spaceship, don a spacesuit and go on an epic lunar hike, how long would it take to walk all the way around it? \r\nThe… [+7130 chars]"}, {"label": 1, "content": "WASHINGTON, D.C. — The suspect in Friday’s U.S. Capitol attack has ties to West Virginia and recently submitted a request to change his name in an Indiana court.\r\nNoah GreenPhoto/CNU\r\nAccording to va… [+1278 chars]"}, {"label": 1, "content": "WASHINGTON On the campaign trail last year, President Donald Trump warned that Joe Biden would \"abolish the suburbs\" by forcing them to change housing regulations. Instead, as part of his $2 trillion… [+5890 chars]"}, {"label": 1, "content": "A piece of burning rocket debris seen streaking across the Pacific Northwest sky last week crashed on a farm in eastern Washington state, authorities said.\r\nAfter the March 25 event, a farmer discove… [+1701 chars]"}, {"label": 1, "content": "The trouble started at 5:17am. Ever Given, an Ultra Large Container Vessel (ULCV) loaded with 20,000 containers, had set off up the Suez canal a quarter of an hour earlier from the south, in the bay … [+10934 chars]"}, {"label": 1, "content": "From the Marvel Cinematic Universe to a galaxy far, far away? Sebastian Stan says he hasn't had talks about succeeding Star Wars icon Mark Hamill as Luke Skywalker, but the Falcon and the Winter Sold… [+2922 chars]"}, {"label": 2, "content": "After months of hoping to receive a COVID-19 immunization and then weeks of fighting the illness after one never came, Air Force veteran Diane Drewes was down to her last few breaths at a hospice cen… [+4664 chars]"}, {"label": 2, "content": "As the pandemic surges toward an unsettling fourth wave, all eyes are on COVID case countsso it's no surprise that smaller-scale public health warnings have flown under the radar lately. On April 1, … [+2838 chars]"}, {"label": 2, "content": "From Woman's Day\r\nAfter the egg hunt is complete and your holiday brunch has ended, round the family up for some more festive fun with this mind-boggling Easter-themed brain teaser.\r\nCreated by flori… [+551 chars]"}, {"label": 2, "content": "When fast-food chain Subway decided to remove the rotisserie chicken sandwich and the roast beef sandwich from its menu last year, customers and even operators were baffled by the decision. According… [+27844 chars]"}, {"label": 2, "content": "But this week, hope gave way, yet again, to concern. The number of coronavirus infections is rising again in Rhode Island and across the nation. It is clouding the success of the U.S. vaccination pro… [+9227 chars]"}, {"label": 3, "content": "Amazon has issued an apology for a pair of tweets from its corporate news account attacking Rep. Mark Pocan (D-Calif.) for criticizing the companys workplace environment amid a big unionization push … [+4330 chars]"}, {"label": 3, "content": "Uber has been ordered to pay $1.1 million to a blind passenger after an independent arbitrator ruled that the company's drivers discriminated against her after refusing her rides on 14 separate occas… [+1951 chars]"}, {"label": 3, "content": "After five and half years leading Waymo, John Krafcik announced Friday he is stepping down from his role, leaving the company to two co-CEOs Tekedra Mawakana and Dmitri Dolgov.\r\nKrafcik has overseen … [+5339 chars]"}, {"label": 3, "content": "A user in a low level hacking forum has published the phone numbers and personal data of hundreds of millions of Facebook users for free online.\r\nThe exposed data includes personal information of ove… [+3074 chars]"}, {"label": 3, "content": "Washington (CNN)When Dr. Rochelle Walensky, the director of the US Centers for Disease Control and Prevention, ditched her prepared remarks this week to voice a feeling of \"impending doom\" about risi… [+11821 chars]"}, {"label": 3, "content": "TEXAS -- Fire department officials in Texas concede that an 8-year-old boy was recently vaccinated by mistake.The colossal error occurred at a COVID-19 vaccine site in Grand Prairie.\r\nDallas County r… [+587 chars]"}, {"label": 3, "content": "Under federal guidance, Michigan will begin vaccinating all Michigan residents age 16 and up beginning Monday, April 5.\r\nEligibility for Michiganders age 16 and up with disabilities or medical condit… [+4936 chars]"}, {"label": 3, "content": "With the Easter holiday right around the corner, you may be wondering what stores are open and what's closed on Easter Sunday this year? Many large stores will be closing their doors to give their fr… [+816 chars]"}, {"label": 3, "content": "Tech companies like Google have been putting their technology in cars for years, but a new collaboration marks the first time drivers will be able to motor around in an actual Google-branded car.\r\nFi… [+3355 chars]"}, {"label": 3, "content": "WASHINGTON (WJW) — The IRS has begun issuing “plus-up payments” along with the third round of stimulus checks.\r\nThe IRS announced Thursday that more than 130 million stimulus payments had been issued… [+1036 chars]"}, {"label": 3, "content": "Which California EV startup abruptly changed its business plan?\r\nWhich automaker created a separate plug-in hybrid system for performance cars?\r\nThis is our look back at the Week In Reverseright here… [+9178 chars]"}, {"label": 3, "content": "The Netherlands has stopped administering Oxford-AstraZeneca COVID-19 vaccinations until April 7.\r\nOn Friday, the Dutch health ministry said it would temporarily stop inoculations for people below th… [+2330 chars]"}, {"label": 3, "content": "An 8-year-old boy accidentally received a COVID-19 vaccine dose in Texas, thanks to \"human error,\" a report said.\r\nThe child was recently inoculated at a Dallas County drive-up vaccine facility opera… [+3840 chars]"}, {"label": 3, "content": "The stores online appointment portals usually dont make explicit how the companies will use the information customers are providing. Privacy watchdog groups and some members of Congress have expresse… [+7701 chars]"}, {"label": 3, "content": "PITTSBURGH (KDKA) – The CDC has updated travel guidance for people who are fully vaccinated against COVID-19.\r\nIn an updated posting on its website, the agency says fully vaccinated people can travel… [+2689 chars]"}, {"label": 3, "content": "Few industries stand to experience as much change as the healthcare industry over the next 10 years. By 2030, every baby boomer will be more than 65 years old, making one 1 of every 5 Americans past … [+5650 chars]"}, {"label": 3, "content": "RICHMOND, Va. (AP/WAVY) Thomas Farrell II, who led Dominion Energy for more than a decade and was a powerful force in Virginia business and politics, has died. \r\nHis passing Friday occurred one day a… [+4118 chars]"}, {"label": 3, "content": "MENOMONEE FALLS, Wis. —Menomonee Falls police and the Waukesha County Sheriff's Department raided a CBD store in Menomonee Falls on Tuesday. \r\nIn a release, the Sheriff's Department said it started i… [+2458 chars]"}, {"label": 3, "content": "With the Oakland Coliseum mass vaccination site scheduled to close just days before California opens eligibility to everyone 16 years and older, state and county officials are begging for more time a… [+4302 chars]"}, {"label": 3, "content": "HONOLULU, Hawaii (HawaiiNewsNow) - More than year into the pandemic, the CDC took a significant step toward normalcy on Friday, announcing that fully vaccinated people can travel safely in the US.\r\nD… [+2453 chars]"}, {"label": 3, "content": "ATLANTA — Major League Baseball has announced that the All-Star game and MLB Draft is being pulled out of Atlanta.\r\nOver the last week, we have engaged in thoughtful conversations with Clubs, former … [+12253 chars]"}, {"label": 3, "content": "Going at it madly and not stopping, Kaley took to her caption, saying: \"STARTING OUT MY DAY WITH THE @versaclimber it's a love hate relationship.\"\r\nThe interviews aren't regular, either, with Kaley a… [+282 chars]"}, {"label": 3, "content": "CEDAR RAPIDS, Iowa (KCRG) - On Friday, officials with the Iowa Department of Public Health clarified how its prioritizing who gets the single-dose Johnson and Johnson COVID-19 vaccine. This comes aft… [+1874 chars]"}, {"label": 4, "content": "Lori Loughlin's husband, Mossimo Giannulli, has been sprung from prison early as the dust settles on the college admission scandal -- the only question now ... is he at home, or is he holed up in a h… [+2183 chars]"}, {"label": 4, "content": "DMX is reportedly hospitalized after suffering a drug overdose.\r\nSources told TMZ that the 50-year-old rapper, whose real name is Earl Simmons, suffered an overdose at around 11 p.m. Friday, also tri… [+1769 chars]"}, {"label": 4, "content": "The final trailer also takes us back to Natashas childhood"}, {"label": 4, "content": "A Walt Disney World guest was arrested and charged with trespassing after refusing to get his temperature screened, according to the Orange County Sheriff's Office.\r\nWhile handcuffed, the Louisiana t… [+1882 chars]"}, {"label": 4, "content": "Prince Harry and Meghan Markle clashed with palace advisers a year before leaving their royal duties, contradicting a recent bombshell interview that they had no plan in place in the lead up to Megxi… [+1884 chars]"}, {"label": 4, "content": "The play was nominated for three Tonys. Ms. Cummings won the Tony and Drama Desk awards for best actress and an Obie for her performance.\r\nMr. Kopit discovered his gift for writing plays almost by ac… [+1585 chars]"}, {"label": 4, "content": "Godzilla vs. Kong continued to score the best opening numbers of the pandemic at the North American box office, grossing another $11.6 million on Friday for a three-day total of $27.9 million.\r\nThat … [+1778 chars]"}, {"label": 4, "content": "Filmmaker James Gunn reported on Twitter that the first red band trailer for his upcoming The Suicide Squad movie hit a first week record with over 150M views.\r\nThat number beats the 116M first week … [+1372 chars]"}, {"label": 4, "content": "In a vast desert of unfunny and ineffective and not credible April Fool’s Day jokes, Hall of Fame defensive end Michael Strahan provided the lone oasis for 2021.\r\nStrahan, executing a multi-day con, … [+715 chars]"}, {"label": 4, "content": "Linda Torres, known for appearing on the reality series \"Big Ang,\" has died.\r\nThe reality star passed away Thursday at Staten Island University Hospital after being diagnosed with COVID-19, Janine De… [+1100 chars]"}, {"label": 4, "content": "Not only is the SAG Awards best ensemble award worth watching in its own right, but the list of nominated films in that category can help predict who will take home the individual acting awards. Acto… [+516 chars]"}, {"label": 4, "content": "Jerry Seinfeld looked like a man who was cooped up for a year Friday night as he christened the coming-out-of-the-pandemic Gotham Comedy Club in NYC, and the audience \"exploded!'\r\nJerry stopped to ta… [+1178 chars]"}, {"label": 4, "content": "Demi Lovato is no longer hiding her truth. Last month the singer and actress, who has struggled with addiction for years, revealed that she considers herself \"California sober\" — meaning not fully ab… [+7434 chars]"}, {"label": 4, "content": "HONG KONG (AP) Sophia is a robot of many talents she speaks, jokes, sings and even makes art. In March, she caused a stir in the art world when a digital work she created as part of a collaboration w… [+3393 chars]"}, {"label": 4, "content": "They recently began filming for the Sky Original drama, The Colour Room. \r\nAnd Phoebe Dynevor and Matthew Goode looked almost unrecognisable as they chatted between takes, a day after Bridgerton co-s… [+6865 chars]"}, {"label": 4, "content": "Alyssa Milano and former castmate Holly Marie Combs defended their former show \"Charmed\" this week after one of the shows ex-producers claimed she quit because she was worried the series was becoming… [+1637 chars]"}, {"label": 4, "content": "Lil Wayne's in luck if he ever needs to borrow a cup of sugar from his neighbor, because he just dropped a fortune on a mansion right by Kylie Jenner's crib.\r\nThe rapper dropped $15.4 mil for the hom… [+703 chars]"}, {"label": 4, "content": "The father is Hollywoods consummate nice guy Tom Hanks who has played everyone from Mr. Rogers to Walt Disney.\r\nThe son is a tattooed aspiring rapper who declared in an Instagram video that 2021 will… [+2643 chars]"}, {"label": 4, "content": "After teasing with the announcements, director Sukumar and makers of Mythri have finally unveiled the most awaited Prelude of Pushpa Raj, the central character of action thriller Pushpa played by All… [+987 chars]"}, {"label": 4, "content": "In the merger between BTS’ label HYBE and Scooter Braun’s Ithaca Holdings, Braun’s SB Projects (SBP) roster of clients — among them Justin Bieber, Ariana Grande, J Balvin and Demi Lovato — are set to… [+4293 chars]"}, {"label": 4, "content": "SEOUL, South Korea -- An art piece by an American graffiti artist showcased in South Korea was damaged by a couple in their 20s who thought the sets of paint and brushes laid in front of the artwork … [+2706 chars]"}, {"label": 4, "content": "The first song of Kangana Ranaut led Thalaivi, a film based on the life of former Tamil Nadu Chief Minister and actor J Jayalalithaa is out. Titled “Chali Chali”, the song captures the ‘golden era of… [+2629 chars]"}, {"label": 4, "content": "After months of delays, HBO Max's \"Friends\" reunion special is on the horizon.\r\nDavid Schwimmer, who played Ross Geller on the iconic sitcom, appeared on \"The Graham Norton Show\" on Friday and reveal… [+2143 chars]"}, {"label": 4, "content": "Credit: WWE.com\r\nApollo Crews cut a promo, officially challenging Big E to a Nigerian Drum Match for the Intercontinental Championship at WrestleMania. There was no further explanation of what said m… [+2202 chars]"}, {"label": 4, "content": "Ladies, weve almost made it. Were deep in the dénouement of season 13 and nothing can stop us from crawling over that finish line to the grand finale. No, not even Colin Jost. While this weeks acting… [+6847 chars]"}, {"label": 5, "content": "SAN ANTONIO -- Arizona Wildcats women's basketball coach Adia Barnes said Saturday that she has nothing to apologize for after she used a middle finger and an expletive in a postgame huddle with her … [+1832 chars]"}, {"label": 5, "content": "The 49ers shook up the NFL world when they traded the No. 12 overall pick and two future first-round picks to the Miami Dolphins to acquire the No. 3 overall selection in the 2021 NFL Draft to find t… [+3813 chars]"}, {"label": 5, "content": "Republican Sen. Marco Rubio, R-Fla., and Rep. Dan Crenshaw, R-Texas, hit President Biden and Major League Baseball for the league's decision to boycott Georgia over its election law -- and asking if … [+3448 chars]"}, {"label": 5, "content": "Grant Hill helped the U.S. win Olympic gold in 1996. He would have been on the team again in 2000 if not for injury. And he was among the college kids who famously beat the first \"Dream Team\" in a sc… [+4546 chars]"}, {"label": 5, "content": "Oklahoma has hired Loyola Chicago coach Porter Moser to the same position at its program to end a formal coaching search that lasted only a week after the retirement of legendary Sooners coach Lon Kr… [+3870 chars]"}, {"label": 5, "content": "The dust is beginning to settle from yet another wild NFL free agency period, and with that comes free agency grades. The time where we all discuss and rate each team’s offseason moves, without seein… [+1680 chars]"}, {"label": 5, "content": "Today we have one of the rarest events in MMA: a Saturday without a UFC event. But despite the lack of a fight card from the biggest promotion in the world, that doesnt mean we have nothing to talk a… [+14686 chars]"}, {"label": 5, "content": "Michael Rapaport is trying to put the genie back in the bottle with regards to his social-media feud with Kevin Durant, but it’s way too late for the Nets star.\r\n“I feel bad about it, Rapaport said F… [+2453 chars]"}, {"label": 5, "content": "Will Augusta be the next battleground over Georgia's election law? (Jamie Squire/Getty Images)\r\nThe eyes of the nation are squarely on the state of Georgia and its new election law, right at the exac… [+2535 chars]"}, {"label": 5, "content": "On Saturday, before the Braves take the field for the second game of the 2021 season against the Phillies, the team made a roster move in response to infielder Ehire Adrianza being away from the team… [+1426 chars]"}, {"label": 5, "content": "Hank Aarons grandson had some harsh words for Greater Georgia Chairwoman Kelly Loeffler after she released a statement criticizing Major League Baseball for pulling the All-Star Game in response to G… [+2582 chars]"}, {"label": 5, "content": "Maryland mens basketball has landed its first transfer of the offseason, with Georgetown center Qudus Wahab announcing his commitment Saturday.\r\nThe 6-foot-11 sophomore averaged 12.7 points, 8.2 rebo… [+1367 chars]"}, {"label": 5, "content": "Christian Pulisic injury news is something both Chelsea and USMNT fans are, sadly, way too familiar with.\r\nIt sounds like Pulisic has suffered another setback during Chelsea’s shocking 5-2 home defea… [+2827 chars]"}, {"label": 5, "content": "The Pittsburgh Steelers are a team in transition, and no one really knows what to expect from them in 2021. Sure, everyone has their own thoughts and opinions on Ben Roethlisbergers abilities at age … [+2211 chars]"}, {"label": 5, "content": "DETROIT -- Do you have a question that youd like to have answered in Hey, Hoynsie? Submit it here. You can also subscribe to Subtext here or text Hoynsie at 216-208-4346 for a two-week free trial.\r\nH… [+5723 chars]"}, {"label": 5, "content": "As if the Graterol situation wasn’t confusing enough, contrary to the story he is officially on the 10-day, not the 60-day IL, and Dave Roberts said his absence was the result of personal, not medica… [+206 chars]"}, {"label": 5, "content": "While Tom Brady is breaking records on the field, he continues to break records off the field as well. Brady's rookie card sold in March for $1.32 million, believed to be a record high for any footba… [+1715 chars]"}, {"label": 5, "content": "Arsenal and Liverpool face off in the Premier League on Saturday in a game where victory could well be a necessity if they are to secure their bare minimum aims for the season. The visitors to the Em… [+7264 chars]"}, {"label": 5, "content": "Okay, yes, just about everything on Thursday sucked (from the loss, to the boredom, to the weather). But the sun is shining today, the Cubs still have two more shots to win this VERY winnable series … [+2471 chars]"}, {"label": 5, "content": "In his latest mock draft, ESPN’s Todd McShay has the Jets addressing the offensive side of the ball with either of their first-round picks and the Giants taking the opposite route.\r\nAfter Gang Green … [+3080 chars]"}, {"label": 5, "content": "First Four: Beat 11-seed Michigan State, 86-80 (OT)\r\nFirst round: Beat 6-seed BYU, 73-62\r\nSecond round: Beat 14-seed Abilene Christian, 67-47 \r\nSweet 16: Beat 2-seed Alabama, 88-78 (OT)\r\nElite Eight:… [+27 chars]"}, {"label": 5, "content": "The Pittsburgh Pirates announced that their alternate training site will be comprised of 31 players who will play 13 games in April, though two players on their 40-man roster are conspicuously absent… [+2529 chars]"}, {"label": 5, "content": "Evan Fourniers first games as a Celtic were ones he would like to forget.\r\nThe veteran guard, who was acquired by the Celtics prior to the March 25 trade deadline, shot 0-for-10 from the field in his… [+2746 chars]"}, {"label": 5, "content": "Penei Sewell had been preparing for Friday afternoon for a long time. The 20-year old America Samoa native began training for his all-important workout as soon as he knew for sure that opting out of … [+2576 chars]"}, {"label": 5, "content": "With no NFL combine this year (because of COVID-19), many NFL draft prospects are recording their only 40-yard dash times at pro days. Coincidentally, many prospects are posting blazing-fast 40 times… [+412 chars]"}, {"label": 5, "content": "With roughly one-third of the 2020-21 season remaining and the Eastern Conference standings being as tight as they are, every game matters at this point. Even games when several starters are not able… [+9372 chars]"}, {"label": 5, "content": "SportsPulse: Scott Gleeson picked Virginia to win it all in 2019. He called Loyola-Chicago as a Cinderella in 2018. Now he's ready to give you his guarantees for the Final Four.\r\nUSA TODAY\r\nIn a flas… [+6791 chars]"}, {"label": 5, "content": "Skip to contentThe Undefeated"}, {"label": 5, "content": "Four weeks from today, the NFL world will be coming off the high that was the first round of the 2021 NFL Draft.\r\nReading the tea leaves, the New York Jets seem destined to select BYU quarterback Zac… [+1909 chars]"}, {"label": 5, "content": "Often, as we try to find our way through the gray, impenetrable cloud of grief that can accompany a sudden, unexpected death of a young person, we try to find comfort in the phrase that the final day… [+4498 chars]"}, {"label": 5, "content": "Who:Pittsburgh Penguins (24-11-2, 50 points, 2nd place in the Eastern Division) @ Boston Bruins(18-10-5, 41 points, 4th place in the Eastern Division)\r\nWhen: 1:00 p.m. eastern\r\nHow to Watch: AT&amp;T… [+5518 chars]"}, {"label": 5, "content": "CLEVELAND, Ohio -- Guilty, again.\r\nI did this last year around draft time too. The Browns were in need of safeties and receivers. I suggested GM Andrew Berry select University of Minnesota prospects … [+6062 chars]"}, {"label": 5, "content": "It was a game of firsts for the White Sox Friday night in Anaheim, beginning with their first victory of 2021 via a 12-8 win over the Angels at Angel Stadium.\r\nMichael Kopech pitched in a regular-sea… [+3828 chars]"}, {"label": 5, "content": "WASHINGTON As the Mets collect players responses to a survey asking them if they plan to receive the COVID-19 vaccine, J.D. Davis said Friday he hasnt given the matter much thought.\r\nMLB and the MLBP… [+2175 chars]"}, {"label": 5, "content": "SAN DIEGO -- Before Manny Machado picked San Diego, before Fernando Tatis Jr. earned his callup, before general manager A.J. Prellers spending spree turned up a rotation full of aces, before the Padr… [+3993 chars]"}, {"label": 5, "content": "ANAHEIM – For the second game of the year, there was a lot to digest for White Sox fans late Friday night. \r\nThey saw their MVP get his biggest hit of the new year, a big lead get away, a veteran pit… [+2558 chars]"}, {"label": 5, "content": "Los Angeles Lakers center Marc Gasol admitted Friday night that he has been questioning his place on the team since Andre Drummond was added from the buyout market last weekend.\r\nDrummond was named t… [+4065 chars]"}, {"label": 5, "content": "Giannis Antetokounmpo had 47 points and 12 rebounds, and the Milwaukee Bucks snapped the Portland Trail Blazers four-game winning streak with a 127-109 victory Friday night.\r\nAntetokounmpo is just th… [+3346 chars]"}, {"label": 5, "content": "SAN ANTONIO -- Guard Paige Bueckers had an amazing freshman season at UConn, but it ended a game earlier than she hoped. She picked up some national player of the year awards this season, but not the… [+4766 chars]"}, {"label": 5, "content": "As it turns out, the season was not over after the Giants suffered an embarrassing loss in their opener, despite what you might have read on social media. \r\nThe Giants got back on track in their seco… [+2354 chars]"}, {"label": 5, "content": "PHOENIX — The Phoenix Suns played like they remembered what happened the last time they played the Oklahoma City Thunder.\r\nA loss in late January put the Suns at 8-8 and led to a postgame rant from h… [+4075 chars]"}, {"label": 5, "content": "After a convincing win on Opening Day, the Astros looked to make it two wins in a row to start the season.\r\nAlex Bregman put the Astros on the board in a big way in the 3rd inning when he connected o… [+1867 chars]"}, {"label": 5, "content": "HOUSTON For the past 16 days, the NFL had the luxury of time and patience as civil suits piled up against Houston Texans quarterback Deshaun Watson.\r\nWhile lawyers slung accusations back and forth th… [+5494 chars]"}, {"label": 5, "content": "Patricio Pitbull is still the undisputed king of the Bellator featherweight division.\r\nFacing Emmanuel Sanchez (20-5) for a second time, Pitbull (32-4) made short work of his rival in Fridays Bellato… [+5682 chars]"}, {"label": 5, "content": "One week with coach Mike Woodson convinced Trayce Jackson-Davis he wanted to stick around and revive Indiana's program.\r\nThe decision could help convince a few more players to stay.\r\nLess than a week… [+3075 chars]"}, {"label": 5, "content": "Stanford survived a late turnover and two game-winning looks by South Carolina to advance to the NCAA women's basketball championship game. The Cardinal won, 66-65, and advance to their fifth title g… [+4907 chars]"}, {"label": 5, "content": "Opening Day has come and gone with the Rays starting the season 1-0. Tonight begins the stretch of games that bring things back to normalcy, with no Opening Day fanfare but simply Rays baseball on th… [+4193 chars]"}, {"label": 5, "content": "For a brief moment Thursday, it looked as if Jay Bruce might play hero in his first game in a Yankees uniform.\r\nAlas, his fly ball in the seventh inning only traveled 363 feet, landing in the glove o… [+2241 chars]"}, {"label": 5, "content": "The day after Opening Day always feels a little like the day after Christmas, to me, so it makes sense that todays starter is the somewhat-of-a-bummer Yusei Kikuchi.\r\nTo be clear, Kikuchi himself is … [+1804 chars]"}]